[
    {
        "comment": "I'm having a real trouble with cities skylines\nthe contents manager doesn't show any mods, maps, or assets so i cant subscribe a new mod and access it.\ni redownloaded the game several times but still the contents manager doesn't display anything. it's just a black screen \nplease help me i cant even start the game because of this.",
        "label": "Bug",
        "title": "\nhelp me with cities skylines contents manager\n",
        "url": "https://forum.paradoxplaza.com/forum/threads/help-me-with-cities-skylines-contents-manager.1151671/preview"
    },
    {
        "comment": " \r\nI bought an addition to skylince- industrial cities. In the steam tick, that the completion is loaded. What is written in the game. That this addition is “recommended to the buyers.” It is not possible to build industrial zones in cities. because they are not there.   ",
        "label": "Bug",
        "title": "Cities: Skylines: lack of supplement\n",
        "url": "https://forum.paradoxplaza.com/forum/threads/cities-skylines-steam-cities-skylines-lack-of-supplement.1151654/preview"
    },
    {
        "comment": "\nCirpizens pathing not properly setting up when roads and pavement touch each other at the top.\nVideo: \n\n\n\n\n",
        "label": "Bug",
        "title": "Pavement not connecting to road properly.\n",
        "url": "https://forum.paradoxplaza.com/forum/threads/cities-skylines-steam-pavement-not-connecting-to-road-properly.1151494/preview"
    },
    {
        "comment": " \r\nhow to change district style on origin version?I have already download the files at http://smods.ru/. Where should i put the files in my computer?   ",
        "label": "Bug",
        "title": "how to change district style on origin version\n",
        "url": "https://forum.paradoxplaza.com/forum/threads/cities-skylines-steam-how-to-change-district-style-on-origin-version.1151234/preview"
    },
    {
        "comment": " \r\nthe game was working yesterday. nothing unusual,. but when i openned it today, it gives me the Oops Game crash error during startup. i uninstalled and re-installoed the game, but tsill have the same problem.   ",
        "label": "Bug",
        "title": "Oops! Game crash error on startup\n",
        "url": "https://forum.paradoxplaza.com/forum/threads/cities-skylines-steam-oops-game-crash-error-on-startup.1151276/preview"
    },
    {
        "comment": " \r\nWhen I was working on my city the other day I noticed that I had this weird graphic glitch the stretched through my buildings. It's like a distorted glitch of the city park fence. I've tried removing the entire park and starting fresh to avail. Does it have to do with the lighting? When I tilt the camera in a certain direction it disappears. \n\nI'm using an ASUS Republic of Gaming Strix Hero II i7, 32 GB, 256GB harddrive with a NVIDIA GeForce GTX 1060 GDDR5.\nAny feedback? Thanks   ",
        "label": "Bug",
        "title": "Graphic Glitch\n",
        "url": "https://forum.paradoxplaza.com/forum/threads/cities-skylines-steam-graphic-glitch.1151321/preview"
    },
    {
        "comment": " \r\nOn a save that I have not played on for a month now, I noticed that in the bottom left corner (where it says how much money you have) it said that I had -$800,000,000. The last time I played the game was 19th January 2019.   ",
        "label": "Bug",
        "title": "Infinite Money Being ... Well ... Not infinite.\n",
        "url": "https://forum.paradoxplaza.com/forum/threads/cities-skylines-steam-infinite-money-being-well-not-infinite.1151219/preview"
    },
    {
        "comment": " \r\nBeen playing the game for a couple of years, never had any major problems. Tried playing again the last couple of weeks but haven't been able to do so. Every time i start up the game i get the text:\n\nThe game crashed\nThe crash report folder named \"2019-02-09_191226\" next to game executable.\nIt would be great if you'd sent it to the developer of the game.\n\nI haven't downloaded any mods or DLC in the last few months since i haven't played the game, so the game is in the same shape it was in when i last played it.\n\nI have removed all mods and tried launching without them but to no avail. I also tried to reinstalle it a couple of times but nothing seems to work. \n\nTried to find a solution on the internet but can't seem to find anything. i have copied the crash and outputlog:\n\ncrash: https://pastebin.com/HCqJK2Kx \noutputlog: https://pastebin.com/5M9b1Nm1\n\nhope somebody can help me, thank you in advance.   ",
        "label": "Bug",
        "title": "Game crashes on startup\n",
        "url": "https://forum.paradoxplaza.com/forum/threads/cities-skylines-steam-game-crashes-on-startup.1151108/preview"
    },
    {
        "comment": "\nI've played this game since 2015 and it has been possible to move hand-place houses, airports etc. holding right mouse button and moving your cursor when placing...\nBut, it doesnt work anymore after newest update maybe...? That is an important feature for me, when building a city and i dont want to lose it.\n\nAnd... i've already reinstalled the game and deleted all mods and assets, but does not help....\n\n",
        "label": "Bug",
        "title": "Cant rotate hand-place buildings.\n",
        "url": "https://forum.paradoxplaza.com/forum/threads/cities-skylines-steam-cant-rotate-hand-place-buildings.1103444/preview"
    },
    {
        "comment": "\nGuess the problem is, that I have too many assets and mods. Is there something I can do without unsubscribing hundreds by hand? I don't want to ask, which mod could cause this problem as there are simply too many.\n\n",
        "label": "Bug",
        "title": "Crashing in loading screen at 90%\n",
        "url": "https://forum.paradoxplaza.com/forum/threads/cities-skylines-steam-crashing-in-loading-screen-at-90.1151032/preview"
    },
    {
        "comment": "\nRegular CTD when performing various tasks such as drawing roads or rail or placing buildings. Happens at various times of day in various parts of my region, in the city or in smaller satellite towns. City population only 20k. CTD will normally happen around autosaving or other processes shown in the top right hand corner of the screen.\n\n",
        "label": "Bug",
        "title": "Crash to Desktop\n",
        "url": "https://forum.paradoxplaza.com/forum/threads/cities-skylines-steam-crash-to-desktop.1150752/preview"
    },
    {
        "comment": "\nIn some zones offline my City buildings spawn and despawn in a loop, while demand is high. That happens just in some districts, not in others. Not things in common I could say.\nCant say if it's just with high density, but It seems so. Problem seems more common with Offices then Commercial. Happens with residentials only in one part of the town.\n\n",
        "label": "Bug",
        "title": "Spawning and despawning buildings\n",
        "url": "https://forum.paradoxplaza.com/forum/threads/cities-skylines-steam-spawning-and-despawning-buildings.1150851/preview"
    },
    {
        "comment": " \r\nWhen I load a map (after editing it in the Map Editor), the map is not the same as the edit map.\n\nI edited/modified Beach Shores so the road coming off the main road is different (changed from two 3-lane roads to two 2-lane roads) and saved the modified map under a different name (Beach Shores modified).\n\nWhen I load the modified map, the road is still two 3-lanes.   ",
        "label": "Bug",
        "title": "\n[SOLVED] Cities: Skylines (Steam) - Loaded Edited Map Isn't Same as Map I Edited\n",
        "url": "https://forum.paradoxplaza.com/forum/threads/solved-cities-skylines-steam-loaded-edited-map-isnt-same-as-map-i-edited.1149943/preview"
    },
    {
        "comment": " \r\nThe game launches, shows the two startup logos, then crashes.\n\nAttaching gdb to the process:\nProgram received signal SIGSEGV, Segmentation fault.\n0x00000000008ef8b4 in ?? ()\n(gdb) bt\n#0  0x00000000008ef8b4 in ?? ()\n#1  0x0000000000aa299e in ?? ()\n#2  0x00000000410c2ad1 in ?? ()\n#3  0x0000000002534c40 in ?? ()\n\nOr in another gdb run:\nProgram received signal SIGSEGV, Segmentation fault.\n0x00000000400f8064 in ?? ()\n(gdb) bt\n#0  0x00000000400f8064 in ?? ()\nBacktrace stopped: Cannot access memory at address 0x7ffcf8019ff0\n\nThe exact crash location is inconsistent, it doesn't always occur at the same instruction or function.\n\nThe crash itself seems to always occur on a write to (%rsp). Plus, at times the stack is smashed and no backtrace is possible. So... it seems you are writing out of bounds on a local array.\n\nI'm a programmer if that helps, I don't mind giving a hand on my end (I really want to try this game!). If the segfault location had been more consistent, I would have dug a little more...\n\nThanks.   ",
        "label": "Bug",
        "title": "Crash on startup after logos, SIGSEV on Linux\n",
        "url": "https://forum.paradoxplaza.com/forum/threads/cities-skylines-steam-crash-on-startup-after-logos-sigsev-on-linux.1150336/preview"
    },
    {
        "comment": " \r\nI'm not getting any sound, though my speakers work fine and other Steam games get sound just fine too. All of my CS sound bars are turned up to 100%. I'm not sure if the attached picture has anything to do with the issue, but I don't remember C:S ever having those two icons down bottom. I don't know what its for, but clicking on it does nothing.   ",
        "label": "Bug",
        "title": "No Sound in Cities: Skylines\n",
        "url": "https://forum.paradoxplaza.com/forum/threads/cities-skylines-steam-no-sound-in-cities-skylines.1150700/preview"
    }
]