[
    {
        "author": {
            "last_played": 1623060184,
            "num_games_owned": 16,
            "num_reviews": 3,
            "playtime_at_review": 772,
            "playtime_forever": 1510,
            "playtime_last_two_weeks": 1510,
            "steamid": "76561198439245998"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 144,
        "received_for_free": false,
        "recommendationid": "92822135",
        "review": "Edit: I messaged support, and the problem was fixed. This is a really fun game and I definitely recommend it.\n\nI don't know whether to recommend or not. It's a really fun game, but even at the lowest settings, it has issues. My computer isn't top of the line, but it is fairly new, and it runs modern games at mid settings quite smoothly. It surpasses both the minimum and recommended requirements, so I'm sure that's not the problem. The game runs really well for about 20 minutes, and then it freezes and I have to close it down and reopen it, losing a bit of progress. This happens with no dlc, and it started before I had any mods installed. Idk why it's like this. The version on xbox game pass didn't do this at all, but I bought it on here earlier yesterday to use mods. I uninstalled the version on gamepass, and I even did a reset of my pc because I thought something was wrong with it. But even after reinstalling the game and resetting my computer, I'm still having this issue. If anyone has suggestions, please let me know.",
        "review_lem": "edit message support problem be fix this really fun game definitely recommend do n't know whether to recommend or not 's really fun game but even at low setting have issue computer n't top of line but fairly new run modern game at mid setting quite smoothly surpass both minimum recommend requirement so 'm sure that 's not problem game run really well for about 20 minute then freeze have to close reopen lose bit of progress this happen with no dlc start before have any mod instal idk why 's like this version xbox game pas do n't do this at all but buy here early yesterday to use mod uninstalled version gamepass even do reset of pc because think something be wrong with but even after reinstall game reset computer 'm still have this issue if anyone have suggestion please let know",
        "steam_purchase": true,
        "timestamp_created": 1622320181,
        "timestamp_updated": 1622497224,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1622775054,
            "num_games_owned": 5,
            "num_reviews": 3,
            "playtime_at_review": 39027,
            "playtime_forever": 122792,
            "playtime_last_two_weeks": 3582,
            "steamid": "76561198838128897"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 69,
        "received_for_free": false,
        "recommendationid": "57507606",
        "review": "This game is very enjoyable but you better have a strong pc. If you do have one of this gen then your set also when you access the workshop i suggest the fps booster its great but make sure its got the patch loader attached the other one always crashes my game no offense to the person who made it but the one i use boosts fps up to 15fps so just a suggestion i use nearly 3000 assets and i stand at a solid 30fps enjoy! Favorite game ever kinda calming.",
        "review_lem": "this game very enjoyable but better have strong pc if do have one of this gen then set also when access workshop suggest fps booster great but make sure get patch loader attach other one always crash game no offense to person who make but one use boost fps to 15fps so just suggestion use nearly 3000 asset stand at solid 30fps enjoy ! favorite game ever kinda calming",
        "steam_purchase": false,
        "timestamp_created": 1574216433,
        "timestamp_updated": 1621649436,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1617507380,
            "num_games_owned": 41,
            "num_reviews": 2,
            "playtime_at_review": 5642,
            "playtime_forever": 5795,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198131365851"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 13,
        "received_for_free": false,
        "recommendationid": "89230373",
        "review": "Best city sim ever made! (change my mind with some good suggestions!)",
        "review_lem": "best city sim ever make ! change mind with some good suggestion !",
        "steam_purchase": true,
        "timestamp_created": 1616909015,
        "timestamp_updated": 1616909015,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1621062540,
            "num_games_owned": 8,
            "num_reviews": 2,
            "playtime_at_review": 2577,
            "playtime_forever": 3699,
            "playtime_last_two_weeks": 0,
            "steamid": "76561199095906527"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 105,
        "received_for_free": false,
        "recommendationid": "85378158",
        "review": "City Skylines is with no hesitation, the best city building game out there. The possibility’s are endless. It’s practically Minecraft if Minecraft was a city building game. Do anything, build a super high tech city full of skyscrapers, or build a small little town. Then connect the places in your city with roads, paths, buses, trains, planes and more, with no limits or suggestions, just free building. Watch your city grow from a place no one knows about to a Megacity with over 1 million people. Even little details like where people and cars are going are implemented. And if you get bored, despite all those features, there is a world full of mods made by the community. So, stop reading by review, go ahead and buy it right now!",
        "review_lem": "city skyline with no hesitation best city building game there possibility endless practically minecraft if minecraft be city building game do anything build super high tech city full of skyscraper or build small little town then connect place city with road path bus train plane more with no limit or suggestion just free building watch city grow from place no one know about to megacity with over 1 million people even little detail like where people car go implement if get bore despite all those feature there world full of mod make by community so stop reading by review go ahead buy right now !",
        "steam_purchase": true,
        "timestamp_created": 1611660718,
        "timestamp_updated": 1611660718,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1611725220,
            "num_games_owned": 85,
            "num_reviews": 1,
            "playtime_at_review": 249,
            "playtime_forever": 548,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198025533189"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 41,
        "received_for_free": false,
        "recommendationid": "84701804",
        "review": "Great city builder, the best in the last 10 years for sure. A lot to learn and I wish there were more tips/suggestions though. My starter city is doing pretty well but I'm going to have to look up videos to answer some questions I have. Very good game and a good value.",
        "review_lem": "great city builder best last 10 year for sure lot to learn wish there be more tips/suggestions though starter city do pretty well but 'm go to have to look video to answer some question have very good game good value",
        "steam_purchase": true,
        "timestamp_created": 1610673757,
        "timestamp_updated": 1610673757,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1611974142,
            "num_games_owned": 230,
            "num_reviews": 5,
            "playtime_at_review": 110549,
            "playtime_forever": 113476,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198013596001"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 187,
        "received_for_free": false,
        "recommendationid": "84544142",
        "review": "What can you say about Cities Skylines... It is probably the greatest city builder game today and probably well into the future. I do not know really how they could make this game better. They have made the game extremely mod friendly and many take advantage of that including myself. The developers might surprise us and come out with something better like a cities skylines 2, but...lol I feel like the only thing they can do is destroy the game like SimCity did with their new additions. Therefore my suggestion for the developers would be if you want to upgrade this game in any way. Just use mods. I own all but the music ones which do not interest me. That way they wont destroy the game and just continue to make it better if that is possible...lol....This is the best city building game on the market...Period. Please do not destroy that by coming out with a version 2 of this game... Just create mods.  With all that said... I cannot recommend this game enough if you like to build cities. There is a very large support community as well as many modders that support this game. But beware! Once you start building a city. You will be doomed and will become part of this community and you will live in your city. Life as you knew it will be over and your Sim life will begin.",
        "review_lem": "what can say about city skyline probably great city builder game today probably well into future do not know really how could make this game well have make game extremely mod friendly many take advantage of that include developer might surprise u come with something well like city skylines 2 but lol feel like only thing can do destroy game like simcity do with new addition therefore suggestion for developer would be if want to upgrade this game any way just use mod own all but music one which do not interest that way wont destroy game just continue to make good if that possible lol this best city building game market period please do not destroy that by come with version 2 of this game just create mod with all that say can not recommend this game enough if like to build city there very large support community as well a many modders that support this game but beware ! once start build city will be doom will become part of this community will live city life a know will be over sim life will begin",
        "steam_purchase": true,
        "timestamp_created": 1610448828,
        "timestamp_updated": 1610448828,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1611653612,
            "num_games_owned": 59,
            "num_reviews": 10,
            "playtime_at_review": 4715,
            "playtime_forever": 11023,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198880827479"
        },
        "comment_count": 1,
        "language": "english",
        "num_words": 132,
        "received_for_free": false,
        "recommendationid": "54597309",
        "review": "Price: 10/10 \nMicrotransactions: 9/10\nFun: 10/10 \nReplayability:10/10\nMultiplayer:n/a (Single Player)\nStory:n/a (There are milestones in this game, but it is not a generic story mode. When you hit certain population sizes you unlock new buildings. These buildings can have various benefits to your city.)\n\nMy Rating: 9.75/10\n\nWhat I liked:\n-Basically infinitely playable\n-Great Community\n-Everything modifiable\n-DLC is good (Have not played, but the community loves the natural disaster content.)\n\nWhat I did not like:\n-Sewage/ Water\n\nDeveloper suggestions:\n-Water on this game is just odd. Sewage backs up in a weird way. Hydro-Dams from my experience due more damage than good. Try using sewage treatment to clear up dirty water and it does nothing even if the only thing is sewage treatment and all normal drainage pipes are removed. Considering this is the most annoying part of the game it is minor in comparison to the overall game which is absolutely a pinnacle of the city building genre.\n\n*2020 update: This game is still great!",
        "review_lem": "price 10/10 microtransactions 9/10 fun 10/10 replayability:10/10 multiplayer n/a single player story n/a there milestone this game but not generic story mode when hit certain population size unlock new building these building can have various benefit to city rating 9.75/10 what like -basically infinitely playable -great community -everything modifiable -dlc good have not play but community love natural disaster content what do not like -sewage/ water developer suggestion -water this game just odd sewage back weird way hydro-dams from experience due more damage than good try use sewage treatment to clear dirty water do nothing even if only thing sewage treatment all normal drainage pipe remove consider this most annoying part of game minor comparison to overall game which absolutely pinnacle of city building genre 2020 update this game still great !",
        "steam_purchase": true,
        "timestamp_created": 1565699097,
        "timestamp_updated": 1606411065,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": "0.484822928905487061",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1613845014,
            "num_games_owned": 17,
            "num_reviews": 3,
            "playtime_at_review": 16404,
            "playtime_forever": 23592,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198378679572"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 336,
        "received_for_free": false,
        "recommendationid": "80288081",
        "review": "Somewhere back in 2016 I bought cities skylines as it was back then a popular city builder game. After having played simcity i really got fascinated how paradox interactive reincarnated city simulator games. Today its been around 4 years since i have the game with on my account being 270+ hours and here is what i found good and bad about the game.\n\nTo start of I bought the game back in 2016 shortly before the snowfall DLC. With a 2012 Windows 8 computer I was capable to play the game until 2018. Somewhere around that time a DLC came out that finally terminated my computer from being able to cope with the game. In fact it didnt really matter if the city had a population of about 70000 or 3500 people. It was mostly because of mods and the new content that added up to the pile of slowing down my computer. I suppose that today the game wouldnt be still playable on a Windows 8 computer with all the mods off but thats only a suggestion i have on base of a trend that my pc was following when it came to performance. \n\nToday as I write this review I have a newer computer (Acer Nitro) I can say that the game is moving along with modern technology, newer and better computers. The game runs very smooth with minimal to no lag caused by graphics. However cities is in fact a game with plenty of AI that needs processing power and RAM to be able to function. Regarding assets I would suggest that 800 assets is about the best performance maximum you could get to run the game smoothly. Regarding mods I would stick with up to 30 active mods to not have the RAM start baking burgers.\n\nShortly said a few Pros and Cons are\n\nPros +:\nGame is up to date\nRealistic (well mostly in compared with other city builders)\nA huge diversity of assets and mods\nAn enormous community\nLow graphic usage\n\nCons -:\ndefinitively not a game for a 2012 computer or older\nthe addiction of adding more and more assets and mods causing the game to lose on performance (Steam Exclusive)\ngenerally a high RAM required (but that is because of mods and assets)\nA few features that are not included on the steam version that do appear on console (in my case the PS4)\n\nConclusion overall I still find Cities a game still worthy its content and diversity which has been implemented into the game. Therefor I do recommend it to friends and others that have a good taste for simulator games and a good computer.",
        "review_lem": "somewhere back 2016 buy city skyline a be back then popular city builder game after have play simcity really get fascinated how paradox interactive reincarnate city simulator game today be around 4 year since have game with account be 270+ hour here what find good bad about game to start of buy game back 2016 shortly before snowfall dlc with 2012 window 8 computer be capable to play game until 2018 somewhere around that time dlc come that finally terminate computer from be able to cope with game fact didnt really matter if city have population of about 70000 or 3500 people be mostly because of mod new content that add to pile of slow computer suppose that today game wouldnt be still playable window 8 computer with all mod off but thats only suggestion have base of trend that pc be follow when come to performance today a write this review have new computer acer nitro can say that game move along with modern technology new good computer game run very smooth with minimal to no lag cause by graphic however city fact game with plenty of ai that need process power ram to be able to function regard asset would suggest that 800 asset about best performance maximum could get to run game smoothly regard mod would stick with to 30 active mod to not have ram start bake burger shortly say few pro con pro game to date realistic well mostly compare with other city builder huge diversity of asset mod enormous community low graphic usage con definitively not game for 2012 computer or old addiction of add more more asset mod cause game to lose performance steam exclusive generally high ram require but that because of mod asset few feature that not include steam version that do appear console case ps4 conclusion overall still find city game still worthy content diversity which have be implement into game therefor do recommend to friend others that have good taste for simulator game good computer",
        "steam_purchase": true,
        "timestamp_created": 1606395180,
        "timestamp_updated": 1606395180,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1623032632,
            "num_games_owned": 5,
            "num_reviews": 1,
            "playtime_at_review": 17379,
            "playtime_forever": 43177,
            "playtime_last_two_weeks": 1617,
            "steamid": "76561198026488522"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 129,
        "received_for_free": false,
        "recommendationid": "79160935",
        "review": "As an old SimCity fanatic, I love this game.  Way better than the new SimCity.  Reminds me of the old Rush Hour pack in Sim City 4 which I loved and it's expanded so far beyond it.  This game is much closer to the Sim City 5 that I was hoping for instead of the one that we got.  The only suggestion I have for developers is that they consider increasing some of the building limits for people with systems that can support it.  My very first major city that I started and I actually hit both the building limit and the node (Streets) limit.  Granted, the city was huge, but it limited it on adding a new building or adding a new sidewalk/path to my already huge city.  I understand the reason for the limits, but I think now that the game is several years old and computer CPU and GPU have advanced even further, it's time to expand on those limits a little more.  \nBut all in all, I absolutely love this game.",
        "review_lem": "a old simcity fanatic love this game way good than new simcity remind of old rush hour pack sim city 4 which love 's expand so far beyond this game much closer to sim city 5 that be hop for instead of one that get only suggestion have for developer that consider increase some of building limit for people with system that can support very first major city that start actually hit both building limit node street limit grant city be huge but limit add new building or add new sidewalk/path to already huge city understand reason for limit but think now that game several year old computer cpu gpu have advance even far 's time to expand those limit little more but all all absolutely love this game",
        "steam_purchase": true,
        "timestamp_created": 1605205206,
        "timestamp_updated": 1605205206,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1622269869,
            "num_games_owned": 80,
            "num_reviews": 2,
            "playtime_at_review": 23285,
            "playtime_forever": 27132,
            "playtime_last_two_weeks": 1846,
            "steamid": "76561198030998687"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 62,
        "received_for_free": false,
        "recommendationid": "78832031",
        "review": "As someone who grew up on the SimCity series, I definitely have to say that City: Skylines is the true successor to that Series, Though it may be a bit unfair to compare this game to that series since Skylines really takes it beyond anything SimCity was and at this point will ever be. If you're thinking of buying it, my only suggestion is, is to take your time in the Workshop and the mods that the great community around it has built.",
        "review_lem": "a someone who grow simcity series definitely have to say that city skyline true successor to that series though may be bit unfair to compare this game to that series since skyline really take beyond anything simcity be at this point will ever be if 're think of buy only suggestion to take time workshop mod that great community around have build",
        "steam_purchase": true,
        "timestamp_created": 1604683322,
        "timestamp_updated": 1604683322,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 3,
        "weighted_vote_score": "0.536082446575164795",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1622828523,
            "num_games_owned": 6,
            "num_reviews": 3,
            "playtime_at_review": 15205,
            "playtime_forever": 28446,
            "playtime_last_two_weeks": 1521,
            "steamid": "76561198342672332"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 41,
        "received_for_free": false,
        "recommendationid": "77672068",
        "review": "Absolutely the best city building game out there. Worth every single penny.\nCan't wait for paradox to make more DLCs  :)\n\n\n\n\n\n\nDLC suggestions: maybe do a war DLC where you could build army bases and such... enemies would attack your city and it would work kinda like Natural Disasters",
        "review_lem": "absolutely best city building game there worth every single penny ca n't wait for paradox to make more dlcs dlc suggestion maybe do war dlc where could build army base such enemy would attack city would work kinda like natural disaster",
        "steam_purchase": true,
        "timestamp_created": 1602887691,
        "timestamp_updated": 1602887691,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1622965909,
            "num_games_owned": 38,
            "num_reviews": 1,
            "playtime_at_review": 32895,
            "playtime_forever": 37017,
            "playtime_last_two_weeks": 199,
            "steamid": "76561198033618983"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 72,
        "received_for_free": false,
        "recommendationid": "76789422",
        "review": "This game is absolutely the best city building game I have every played. This literally is the thing that makes people turn in to city builders! I can totally recommend this to other players as this can get very addicting. People can get engaged in so many ways! I have a suggestion for the game. I would like to see more One-way streets and Highway roads since there is very few One-Way Roads. This could make things easier for more people who plays the game.",
        "review_lem": "this game absolutely best city building game have every play this literally thing that make people turn to city builder ! can totally recommend this to other player a this can get very addict people can get engage so many way ! have suggestion for game would like to see more one-way street highway road since there very few one-way road this could make thing easy for more people who play game",
        "steam_purchase": false,
        "timestamp_created": 1601426389,
        "timestamp_updated": 1601426389,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1618858325,
            "num_games_owned": 135,
            "num_reviews": 28,
            "playtime_at_review": 63045,
            "playtime_forever": 64633,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198060270669"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 348,
        "received_for_free": false,
        "recommendationid": "24175892",
        "review": "C:S is probably one of the games i have played the most, ever - look at my hour count for evidence. \n\nAnd i cannot help but notice every single flaw in it.\n\nThe description gives an idea. \"whilst expanding on some well-established tropes of the city building experience.\" The difference is - the game *utterly relies* on these tropes. Gameplay isn't deeper than, say, Simcity 2013 or Simcity 4 or Simcity 3K. It's the same sorta \"Just plug things in and make the numbers go up\" game.\n\nYou build police stations, crime goes down. You build schools, education goes up and people get richer and smarter. That's just the core gameplay loop. There's nothing deeper, no modeling of the trends and quirks of a city, no thought as to *why*  poor people are uneducated - it's just the Normal State of Things, unmoving as the borders of your city.\n\nThe constant expansion packs - expanding things that nobody has actually asked for - really just punctuate this. There's still a lot of flaws in the basegame - there's still disappearing cars, there's still traffic problems (just look at all the photos of cars lined up in a single lane) - and none of those have been addressed. Conversely, the DLC has only added things that nobody wanted. I don't think there was a single suggestion for Blimps, or Helicopters, or Radio. Even the ones that were asked for are added in a very half-assed way - Donoteat did a great teardown of Industries.\n\nThe game is decent at decorating, yeah, but performance during loading is ram-eating and horrific with a lot of mods. In addition, your modded city files are at constant risk of being bricked the moment C:O decides the game needs management of every individual toilet. Oh, and as a bit of a side-note - most content creators have mods which *actively disable* certain parts of the game - because it's so irritating otherwise.\n\nThe Launcher Fiasco just punctuates this. The game didn't need a launcher. I don't think anyone ever asked for a launcher. But nobody asks for 99% of the stuff C:O adds on for a premium, while suggestions from the very beginning of the game's life cycle remain unaddressed. Where's a better traffic simulation? Where's mixed-use buildings? Where's a vanilla way to get around the idiotic road angle requirements? WHERE'S VANILLA ELEVATED TRAIN STATIONS???\n\nOf course, the response is \"Let modders do it\". But at a certain level, you gotta face facts and admit your game is shit.",
        "review_lem": "c probably one of game have play most ever look at hour count for evidence can not help but notice every single flaw description give idea whilst expand some well-established trope of city building experience difference game utterly rely these trope gameplay n't deep than say simcity 2013 or simcity 4 or simcity 3k 's same sorta just plug thing make number go game build police station crime go build school education go people get rich smarter that 's just core gameplay loop there 's nothing deeper no modeling of trend quirk of city no thought a to why poor people uneducated 's just normal state of thing unmoving a border of city constant expansion pack expand thing that nobody have actually ask for really just punctuate this there 's still lot of flaw basegame there 's still disappearing car there 's still traffic problem just look at all photo of car line single lane none of those have be address conversely dlc have only add thing that nobody want do n't think there be single suggestion for blimp or helicopter or radio even one that be ask for add very half-assed way donoteat do great teardown of industry game decent at decorate yeah but performance during loading ram-eating horrific with lot of mod addition modded city file at constant risk of be bricked moment c o decide game need management of every individual toilet oh a bit of side-note most content creator have mod which actively disable certain part of game because 's so irritating otherwise launcher fiasco just punctuate this game do n't need launcher do n't think anyone ever ask for launcher but nobody ask for 99 of stuff c o add for premium while suggestion from very beginning of game 's life cycle remain unaddressed where 's good traffic simulation ? where 's mixed-use building ? where 's vanilla way to get around idiotic road angle requirement ? where 's vanilla elevated train station ? ? ? of course response let modders do but at certain level get ta face fact admit game shit",
        "steam_purchase": true,
        "timestamp_created": 1467961729,
        "timestamp_updated": 1599404203,
        "voted_up": false,
        "votes_funny": 0,
        "votes_up": 2,
        "weighted_vote_score": "0.523809552192687988",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1619442921,
            "num_games_owned": 23,
            "num_reviews": 3,
            "playtime_at_review": 1765,
            "playtime_forever": 2664,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198172606455"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 47,
        "received_for_free": false,
        "recommendationid": "73817582",
        "review": " A suggestion from someone who wants to buy expansion packs but doesn't want the bundles. It would be beneficial to let players make their own bundle from 3 games on up. I personally would like to play some of the expansions but not all of them as they do not interest me. But some of them are very intriguing.",
        "review_lem": "suggestion from someone who want to buy expansion pack but do n't want bundle would be beneficial to let player make own bundle from 3 game personally would like to play some of expansion but not all of a do not interest but some of very intriguing",
        "steam_purchase": true,
        "timestamp_created": 1596639282,
        "timestamp_updated": 1596639282,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1590831371,
            "num_games_owned": 102,
            "num_reviews": 36,
            "playtime_at_review": 1308,
            "playtime_forever": 1308,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198818166011"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 113,
        "received_for_free": false,
        "recommendationid": "71957473",
        "review": "1st day\nA friend buying this game, intrigued, ask him to share it with me.\n\n2nd day\nPlaying this game after office hour whilst waiting for my wife\n\n3rd day\nStarting to play on-work hour, thankfully it's linux supported\n\n4th day\nplaying as soon as I got home, wife complaining alot\n\n5th day\nwife complaining a lot more, watching me play every time\n\n6th day\nwife starting to ask question and give suggestion\n\n7th day\nwife starting to play on her own\n\n8th day\nwife complains the game unplayable because my friend who share it is currently playing\n\n9th day\nwife cannot take it anymore, finally give the order to buy the game\n\n10th day\ncannot access my own computer, wife is playing all the time, starting to regret playing this game....",
        "review_lem": "1st day friend buying this game intrigue ask to share with 2nd day play this game after office hour whilst wait for wife 3rd day start to play on-work hour thankfully 's linux support 4th day playing as soon a get home wife complain alot 5th day wife complain lot more watch play every time 6th day wife start to ask question give suggestion 7th day wife start to play own 8th day wife complain game unplayable because friend who share currently play 9th day wife can not take anymore finally give order to buy game 10th day can not access own computer wife play all time start to regret play this game",
        "steam_purchase": true,
        "timestamp_created": 1593790899,
        "timestamp_updated": 1593790899,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1616109394,
            "num_games_owned": 72,
            "num_reviews": 6,
            "playtime_at_review": 637,
            "playtime_forever": 753,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198342024745"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 60,
        "received_for_free": false,
        "recommendationid": "70647578",
        "review": "So far the game has been amazing. I only have the base game and a couple dlc's from humble, but thats enough for me. i can see myself playing this for thousands of hours. from what i have gathered looking at the dlc and other's reviews of dlc, it really doesnt seem worth it. if you want my suggestion, buy the base game (having played it i can say this 100% worth $30) and leave the dlc alone.",
        "review_lem": "so far game have be amaze only have base game couple dlc 's from humble but thats enough for can see play this for thousand of hour from what have gather look at dlc other 's review of dlc really doesnt seem worth if want suggestion buy base game have play can say this 100 worth 30 leave dlc alone",
        "steam_purchase": false,
        "timestamp_created": 1591911042,
        "timestamp_updated": 1591911042,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1623001423,
            "num_games_owned": 58,
            "num_reviews": 12,
            "playtime_at_review": 93124,
            "playtime_forever": 109891,
            "playtime_last_two_weeks": 785,
            "steamid": "76561198064617389"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 122,
        "received_for_free": false,
        "recommendationid": "70492741",
        "review": "SUGGESTIONS FOR THE DEVELOPERS BELOW ;)\n\nSo, perfect Cities Skylines is not, but given the limitations of technology it comes close. It's now 5 years since launch, and still it's to me the best city building game of it's kind. It's great and it's fun and has incredible water physics. But where does the game fall short?\n\n[b]- Lane picking of cars!\n- Junction blocking of trains!\n- Ship and plane spamming\n- memory consumption\n- total lack of parking lots in the base game!\n- rethink the pointless power line and water pipe system!\n- winter maps are boring without seasons!\n- no uprises, riots and manifestations when things go bad\n- turn Chirper into a useful warning tool in stead of ever the same nonsense chatter.\n- rain does not add to the water layer[/b]\n\nBut  again, this is a great game, and I am curious about the next expansions...",
        "review_lem": "suggestion for developer below so perfect city skyline not but give limitation of technology come close 's now 5 year since launch still 's to best city building game of 's kind 's great 's fun have incredible water physic but where do game fall short ? b lane picking of car ! junction blocking of train ! ship plane spamming memory consumption total lack of park lot base game ! rethink pointless power line water pipe system ! winter map bore without season ! no uprises riot manifestation when thing go bad turn chirper into useful warning tool stead of ever same nonsense chatter rain do not add to water layer /b but again this great game curious about next expansion",
        "steam_purchase": true,
        "timestamp_created": 1591628488,
        "timestamp_updated": 1591634421,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 1,
        "weighted_vote_score": "0.523809552192687988",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1609480531,
            "num_games_owned": 111,
            "num_reviews": 11,
            "playtime_at_review": 15044,
            "playtime_forever": 17690,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198008402826"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 246,
        "received_for_free": false,
        "recommendationid": "67670674",
        "review": "If you've ever played a citybuilder and been left wanting more, look no further. \n\nThis game can keep you building and maintaining your city for years. Real-life years. Mods and the epic modding community of Cities make it possible to build on as epic a scale as you like (that your machine can handle) on your own custom-designed map, creating your perfect city. The DLC is totally dependent on your personal taste; you can tailor the game to how you want to play it. Should you wish to build an epic city in the base game, you can! Tired of abandoned houses? Mod them out! Want to build a sprawling metropolis? Ditch the boundaries! The possibilities are endless right off the bat. \n\nThe downsides? Managing an entire city is A LOT. Both in real-life and in-game. Cities manages to compile a system that makes micromanaging possible, even more so with modded, however this can be a little daunting and very complicated without the help of streamers and YouTube guides. Most of the frustration comes from trying to figure out why a particular project isn't going the way you want it to, and is usually down to the way it's been built. However, if you're determined and willing to watch a couple of videos before/ whilst playing; you'll be rewarded with your very own fully functioning digital city. \n\nSide Note: The cherry on top, for me, would be a DLC/ modpack that changes the face of the game. For example; a steampunk-themed city. A medieval build. Many fantastic modellers have created some beautiful assets, however no-one's gunna re-skin an entire game's worth of assets on their own. Perhaps a suggestion if Paradox is ever thinking of a sequel?\n\nRight now, though, they don't need a sequel. This game satisfies that \"model train set\" urge. The desire to create something and watch it come to life.",
        "review_lem": "if 've ever play citybuilder be leave want more look no far this game can keep build maintain city for year real-life year mod epic modding community of city make possible to build a epic scale a like that machine can handle own custom-designed map create perfect city dlc totally dependent personal taste can tailor game to how want to play should wish to build epic city base game can ! tired of abandon house ? mod ! want to build sprawling metropolis ? ditch boundary ! possibility endless right off bat downside ? manage entire city lot both real-life in-game city manage to compile system that make micromanaging possible even more so with modded however this can be little daunting very complicate without help of streamer youtube guide most of frustration come from try to figure why particular project n't go way want to usually to way 's be build however if 're determine willing to watch couple of video before/ whilst play 'll be reward with very own fully function digital city side note cherry top for would be dlc/ modpack that change face of game for example steampunk-themed city medieval build many fantastic modeller have create some beautiful asset however no-one 's gunna re-skin entire game 's worth of asset own perhaps suggestion if paradox ever think of sequel ? right now though do n't need sequel this game satisfy that model train set urge desire to create something watch come to life",
        "steam_purchase": false,
        "timestamp_created": 1587365911,
        "timestamp_updated": 1587365911,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1616913068,
            "num_games_owned": 16,
            "num_reviews": 1,
            "playtime_at_review": 3889,
            "playtime_forever": 4278,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198066453760"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 135,
        "received_for_free": false,
        "recommendationid": "67309276",
        "review": "Game time: 64 hours and still adding.\nIt is funny how skills and problem solving learned from a game could have an impact on actual people's life. Near where I live was a private high school with more than 2000 students and every time when school finishes it will cause a massive jam on the surrounding roads, teachers, workers from the school will be send to assist traffic police on managing the jam. While having casual chat with my friend who happened to be a newly appointed city coucillor asked for my opinion on this. After a short observation onsite, I recommended that the green light duration of a traffic light 1.5km away from the school to be lengthened and problem shall be largely solved. \nAlthough the suggestion was initially doubted but the city council adopted my idea and now, the 2km traffic crawl was reduced to about 500m, at worst.\nI strongly recommend this game to everyone, even accountants that sat in office for long hours as me.",
        "review_lem": "game time 64 hour still add funny how skill problem solve learn from game could have impact actual people 's life near where live be private high school with more than 2000 student every time when school finish will cause massive jam surround road teacher worker from school will be send to assist traffic police manage jam while have casual chat with friend who happen to be newly appoint city coucillor ask for opinion this after short observation onsite recommend that green light duration of traffic light 1.5km away from school to be lengthen problem shall be largely solve although suggestion be initially doubt but city council adopt idea now 2km traffic crawl be reduce to about 500m at bad strongly recommend this game to everyone even accountant that sit office for long hour a",
        "steam_purchase": true,
        "timestamp_created": 1586884430,
        "timestamp_updated": 1586884430,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1603296514,
            "num_games_owned": 7,
            "num_reviews": 1,
            "playtime_at_review": 6524,
            "playtime_forever": 8245,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198281708723"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 30,
        "received_for_free": false,
        "recommendationid": "65932013",
        "review": "Enough complexity to keep my interest while also being frustratingly fun. This is the first game I've had to youtube for suggestions on strategies. The mods and expansions are very beautiful and add a lot of value to the game.",
        "review_lem": "enough complexity to keep interest while also be frustratingly fun this first game 've have to youtube for suggestion strategy mod expansion very beautiful add lot of value to game",
        "steam_purchase": true,
        "timestamp_created": 1585314082,
        "timestamp_updated": 1585314082,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1621825791,
            "num_games_owned": 30,
            "num_reviews": 1,
            "playtime_at_review": 53594,
            "playtime_forever": 58454,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198122623645"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 36,
        "received_for_free": false,
        "recommendationid": "65857701",
        "review": "This is, hands down, my favourite simulation game. I love the amount of control you have over everything you build, and the DLC keeps getting better and better. Traffic is always an issue, but the community has really great suggestions and mods to help will almost every issue you might have.",
        "review_lem": "this hand favourite simulation game love amount of control have over everything build dlc keep get well well traffic always issue but community have really great suggestion mod to help will almost every issue might have",
        "steam_purchase": true,
        "timestamp_created": 1585229832,
        "timestamp_updated": 1585229832,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1623040850,
            "num_games_owned": 4,
            "num_reviews": 1,
            "playtime_at_review": 54585,
            "playtime_forever": 88813,
            "playtime_last_two_weeks": 5659,
            "steamid": "76561198073154289"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 93,
        "received_for_free": false,
        "recommendationid": "65272317",
        "review": "Just re installed Steam and Cities Skylines on my Mac Catalina.  The game will not even open.  If there is a way to play this game on a Mac running Catalina, without being a tech wizard, I'd sure like to know.  Otherwise, I just wasted a bunch of money and time.\n\nAn update:  I deleted the Paradox folder from my Library as per a suggestion I found by following the Community tab in Steam.  I was able to finally get the game working.  Why Steam and/or Paradox don't just fix this problem rather than make users flounder around trying to solve the issue is beyond me.  But, I am happy to have the game available to play again and it runs great.",
        "review_lem": "just re installed steam city skyline mac catalina game will not even open if there way to play this game mac run catalina without be tech wizard 'd sure like to know otherwise just waste bunch of money time update delete paradox folder from library a per suggestion find by follow community tab steam be able to finally get game work why steam and/or paradox do n't just fix this problem rather than make user flounder around try to solve issue beyond but happy to have game available to play again run great",
        "steam_purchase": true,
        "timestamp_created": 1584542475,
        "timestamp_updated": 1585003054,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": "0.5",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1612770354,
            "num_games_owned": 280,
            "num_reviews": 2,
            "playtime_at_review": 10435,
            "playtime_forever": 11680,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198004883634"
        },
        "comment_count": 1,
        "language": "english",
        "num_words": 110,
        "received_for_free": false,
        "recommendationid": "62254260",
        "review": "One of my favorite games on my computer ... till this update, i've done everything short of reinstalling but the game won't load. Seems funny this happens on the day that they forced the launcher on the community ... very disappointing.\n\nEdit: 1/30/2020\nSo after going through a bunch of suggestions for deleting files/folders from my appdata i finally found a working solution.   need to go to wherever your steam is installed and run the file below  E:\\Program Files\\Steam\\SteamApps\\common\\Cities_Skylines\\launcher-installer-windows   This will install the paradox launcher and allow you to open the game ... not sure if deleting the files before hand allowed this to work so it might only be part of the solution.  sure there must have been a better way for paradox to implement this and not break the game for so many people, not changing my review",
        "review_lem": "one of favorite game computer till this update 've do everything short of reinstall but game wo n't load seem funny this happen day that force launcher community very disappointing edit 1/30/2020 so after go through bunch of suggestion for delete files/folders from appdata finally find working solution need to go to wherever steam instal run file below e \\program files\\steam\\steamapps\\common\\cities_skylines\\launcher-installer-windows this will install paradox launcher allow to open game not sure if delete file before hand allow this to work so might only be part of solution sure there must have be good way for paradox to implement this not break game for so many people not change review",
        "steam_purchase": true,
        "timestamp_created": 1579740664,
        "timestamp_updated": 1580420927,
        "voted_up": false,
        "votes_funny": 0,
        "votes_up": 10,
        "weighted_vote_score": "0.501160085201263428",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1618275673,
            "num_games_owned": 19,
            "num_reviews": 3,
            "playtime_at_review": 1996,
            "playtime_forever": 3240,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198436023213"
        },
        "comment_count": 1,
        "language": "english",
        "num_words": 163,
        "received_for_free": false,
        "recommendationid": "61241456",
        "review": "Got this on Winter Sale which is the positive note.\n\nI like this game, but I wouldn't recommend it to other people because there's no tutorials and you have to learn it yourself (not a bad note) AND citizens shouldn't get sick and affect everyone at the city like it's a Black Plague.\n\nYou have to pause the game AS SOON AS medical building is unlocked and you need to put down like three medical buildings close together. Hell, MAKE THE WHOLE BLOCK OF MEDICAL BUILDINGS. Even though it's expensive, you NEED to get Industries DLC and make some money from industry areas by placing them in the richest areas possible. The richer area means the richer you.\n\nMy suggestion feedback to the devs of Cities Skylines is citizens need to drive their sick ass to the medical buildings and stay there until they're better instead of medical trucks going to their houses like they're the king or queen of the city, WHICH IS US!\n\nNow my rant is over, I'm saying is you can buy the game, but have unlimited money on, so you can build the whole damn block of medical buildings for your sickass people when you reach like 400 people and listen for the coughin and sneezin dumbfucks.",
        "review_lem": "got this winter sale which positive note like this game but would n't recommend to other people because there 's no tutorial have to learn not bad note citizen should n't get sick affect everyone at city like 's black plague have to pause game a soon a medical building unlocked need to put like three medical building close together hell make whole block of medical building even though 's expensive need to get industry dlc make some money from industry area by place rich area possible rich area mean rich suggestion feedback to devs of city skyline citizen need to drive sick as to medical building stay there until 're well instead of medical truck go to house like 're king or queen of city which u ! now rant over 'm say can buy game but have unlimited money so can build whole damn block of medical building for sickass people when reach like 400 people listen for coughin sneezin dumbfucks",
        "steam_purchase": true,
        "timestamp_created": 1578088124,
        "timestamp_updated": 1578088124,
        "voted_up": false,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1575936053,
            "num_games_owned": 443,
            "num_reviews": 4,
            "playtime_at_review": 14036,
            "playtime_forever": 14111,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198021738746"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 121,
        "received_for_free": false,
        "recommendationid": "57364380",
        "review": "If you new to this game, it is exactly you expect to be! Build your own city while you need to manage all other aspects of your city from power, water, services to traffic.... \nBut ''proper'' fun comes later after game going to hook you up like junkie. Thanks to large community there are TONS of mods and assets and you can literally build your own dream city.\n\nFirst try the game without mods, build your city, so you get feel and after you can start implementing mods which is extremely easy thanks to steam workshop (Click on game/workshop than just choose mods/assets you like and subscribe)\nThere is a lot of YT online videos where you can check others people masterpieces :)\n(few suggestions: Biffa, Sam Bur, Fluxtrance, two dollars twenty....... and Many more!!!!)\n\n- AI traffic is not the best (first basic mod is traffic manager)",
        "review_lem": "if new to this game exactly expect to be ! build own city while need to manage all other aspect of city from power water service to traffic but proper fun come later after game go to hook like junkie thanks to large community there ton of mod asset can literally build own dream city first try game without mod build city so get feel after can start implement mod which extremely easy thanks to steam workshop click game/workshop than just choose mods/assets like subscribe there lot of yt online video where can check others people masterpiece few suggestion biffa sam bur fluxtrance two dollar twenty many more ! ! ! ! ai traffic not best first basic mod traffic manager",
        "steam_purchase": true,
        "timestamp_created": 1573999859,
        "timestamp_updated": 1574812960,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1578202940,
            "num_games_owned": 399,
            "num_reviews": 9,
            "playtime_at_review": 2656,
            "playtime_forever": 3975,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198029272313"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 41,
        "received_for_free": false,
        "recommendationid": "57299149",
        "review": "I have had Cities Skylines for a while. While I am easily distracted by other games, I absolutely LOVE CS and how it plays. There's some things I might look at improving or implementing, but all of my suggestions are more based on deep learning AI and global learnings based on real-world data.",
        "review_lem": "have have city skyline for while while easily distract by other game absolutely love c how play there 's some thing might look at improve or implementing but all of suggestion more base deep learning ai global learning base real-world data",
        "steam_purchase": true,
        "timestamp_created": 1573922243,
        "timestamp_updated": 1573922243,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1574447473,
            "num_games_owned": 88,
            "num_reviews": 8,
            "playtime_at_review": 41,
            "playtime_forever": 921,
            "playtime_last_two_weeks": 0,
            "steamid": "76561197980175867"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 118,
        "received_for_free": false,
        "recommendationid": "56961750",
        "review": "Well, that was a lesson in frustration.  I decided to try this game during the free weekend, and I've played some sim city-like games over the years; however, this made no sense.  I decided to try a basic town... about 6 different times.  The last town was just one street.  There was power, water, and sewage run to all zones.  I just had three small zones: light residential, light commercial, and light industrial.  No matter how many water pipes I ran (I went into debt running water and sewage pipes) I didn't have a the capacity for ONE STREET.  I had two water pumps pulling water out of the river, but it didn't matter.  There were no suggestions from the \"twitter\", and none of the descriptions helped.  Maybe I was a bit impatient, but I would think a person could run at least one street.",
        "review_lem": "well that be lesson frustration decide to try this game during free weekend 've play some sim city-like game over year however this make no sense decide to try basic town about 6 different time last town be just one street there be power water sewage run to all zone just have three small zone light residential light commercial light industrial no matter how many water pipe run go into debt running water sewage pipe do n't have capacity for one street have two water pump pull water of river but do n't matter there be no suggestion from twitter none of description help maybe be bit impatient but would think person could run at least one street",
        "steam_purchase": false,
        "timestamp_created": 1573435311,
        "timestamp_updated": 1573435311,
        "voted_up": false,
        "votes_funny": 2,
        "votes_up": 0,
        "weighted_vote_score": "0.431574016809463501",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1620391660,
            "num_games_owned": 241,
            "num_reviews": 41,
            "playtime_at_review": 2349,
            "playtime_forever": 12737,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198047616056"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 89,
        "received_for_free": false,
        "recommendationid": "54733456",
        "review": "Awesome game, took me a while to get used to after playing Simcity 2004, its a major upgrade with so much to do. \n\nBetter graphics, better gameplay, tons of interesting DLC and mods.\n\nI would request some multiplayer features with player or npc cities competing with campuses, politics, sports or even military, fighting over resources on multiplayer region and topping it off with the natural disasters or man made with the nuclear plant blowing up and spreading radiation.\n\nWould make the game an amazing simulator. \n\nIt also needs to fix seasons to automaticly change over the course of a year. \n\nThese are my top suggestions to add to the game.",
        "review_lem": "awesome game take while to get use to after play simcity 2004 major upgrade with so much to do better graphic good gameplay ton of interest dlc mod would request some multiplayer feature with player or npc city compete with campus politics sport or even military fight over resource multiplayer region top off with natural disaster or man make with nuclear plant blow spread radiation would make game amazing simulator also need to fix season to automaticly change over course of year these top suggestion to add to game",
        "steam_purchase": true,
        "timestamp_created": 1566395678,
        "timestamp_updated": 1566403128,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1559447888,
            "num_games_owned": 108,
            "num_reviews": 14,
            "playtime_at_review": 7752,
            "playtime_forever": 7752,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198178577461"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 364,
        "received_for_free": false,
        "recommendationid": "54359206",
        "review": "Couldn't honestly recommend the game. It plays well and has an interesting slant to city building and management, but what content you don't get leaves a lot to be desired. The game was built over the course of a few years, a lot of it being based on player feedback and recommendations. They really did listen to the suggestions and a few mods were even incorporated straight into the game itself. Oh did I say Mods? Yeah this game has tons of them, and bottomless assets to really customize your city. There's tons of great graphic mods that make you feel like you're playing Sim City for adults. Sounds pretty good doesn't it? So what's the problem? \n\nWell about 2-3 updates in they decided to stop giving content away as \"updates\" and start charging for it as \"DLC\". Again, on the surface you wouldn't THINK this would be an issue if you're getting more content, until you start to look at what content you getting. It's stuff that should be included in the base game, but was cleverly omitted so they can charge you for it later. Let's go over a few. \n\nMass Transit: You FOR SURE need this DLC. If not, you're public transportation options are severely limited and city wide logistics turn into a nightmare after you hit a certain population density. It's just unplayabale. There are mods that help mitigate this but unfortunately the AI patches for path finding included in this are just too critical to base game to pass up. \n\nSnowfall: You literally don't get snow until you buy this update. On top of that, you can only have a snow map or not, it can't just snow in any map or not snow in a snow map. \n\nNatural Disasters: Just as the name implies. Weather is virtually nonexistent until you buy this update.\n\nIndustries: Probably the worst offender. Your options for \"industry\" before this update were limited to placing industry zones, and defining the type of industry within it. That's it. \n\nPractically all the DLC over $10 is certainly content that should be included in the base game. If you don't buy these, what you can do is essentially watered down to the point of \"Place this here. Okay you're done.\" It's just a let down to market as game as $30 only to quickly realize you're going to be spending $150 (and that's without the radio stations) to really play it. Not to mention the buck doesn't stop here. They'll release another update and it will cost $14.99 like the rest. \n\nWhy do you think they're calling the sequel 'City Skylines $200'?",
        "review_lem": "could n't honestly recommend game play well have interesting slant to city building management but what content do n't get leave lot to be desire game be build over course of few year lot of be base player feedback recommendation really do listen to suggestion few mod be even incorporate straight into game oh do say mod ? yeah this game have ton of bottomless asset to really customize city there 's ton of great graphic mod that make feel like 're play sim city for adult sound pretty good do n't ? so what 's problem ? well about 2-3 update decide to stop give content away a update start charge for a dlc again surface would n't think this would be issue if 're get more content until start to look at what content get 's stuff that should be include base game but be cleverly omit so can charge for later let 's go over few mass transit for sure need this dlc if not 're public transportation option severely limited city wide logistics turn into nightmare after hit certain population density 's just unplayabale there mod that help mitigate this but unfortunately ai patch for path finding include this just too critical to base game to pass snowfall literally do n't get snow until buy this update top of that can only have snow map or not ca n't just snow any map or not snow snow map natural disaster just a name implies weather virtually nonexistent until buy this update industry probably bad offender option for industry before this update be limit to place industry zone define type of industry within that 's practically all dlc over 10 certainly content that should be include base game if do n't buy these what can do essentially water to point of place this here okay 're do 's just let to market as game a 30 only to quickly realize 're go to be spend 150 that 's without radio station to really play not to mention buck do n't stop here 'll release another update will cost 14.99 like rest why do think 're call sequel 'city skyline 200 ?",
        "steam_purchase": true,
        "timestamp_created": 1564419071,
        "timestamp_updated": 1564419071,
        "voted_up": false,
        "votes_funny": 0,
        "votes_up": 2,
        "weighted_vote_score": "0.498113185167312622",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1608811673,
            "num_games_owned": 27,
            "num_reviews": 4,
            "playtime_at_review": 4907,
            "playtime_forever": 17145,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198413839561"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 143,
        "received_for_free": false,
        "recommendationid": "54005411",
        "review": "Very good game. It encourages you to think with your brain and how to build a beautiful city that you imagine. Not only allows players to develop their personal creative ability, but also test the player's care and patience.\nOf course, the shortcomings can not be ignored: 1. The game's memory and graphics card requirements are actually very high, if you want to experience the game effect on the network video, my suggestion is that you have a very high configuration computer. 2. The game compatibility is very poor. The mods of many creative workshops produced by the players are not very compatible. I don't know if the game itself is designed or the loopholes. I hope all the good mods are compatible, and the front mods are compatible. It is too much, I hope that when the game is updated, I can try to put the mod into the game content. 3. The game needs to buy a lot of Dlc, if you can't buy it, you can't experience a lot of game content. This is actually a change to the price of the game, and I think the effect of the update is actually very small.\n",
        "review_lem": "very good game encourage to think with brain how to build beautiful city that imagine not only allow player to develop personal creative ability but also test player 's care patience of course shortcoming can not be ignore 1 game 's memory graphic card requirement actually very high if want to experience game effect network video suggestion that have very high configuration computer 2 game compatibility very poor mod of many creative workshop produce by player not very compatible do n't know if game design or loophole hope all good mod compatible front mod compatible too much hope that when game update can try to put mod into game content 3 game need to buy lot of dlc if ca n't buy ca n't experience lot of game content this actually change to price of game think effect of update actually very small",
        "steam_purchase": false,
        "timestamp_created": 1562733117,
        "timestamp_updated": 1562733117,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 1,
        "weighted_vote_score": "0.523809552192687988",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1586051784,
            "num_games_owned": 186,
            "num_reviews": 1,
            "playtime_at_review": 9877,
            "playtime_forever": 10208,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198083089848"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 332,
        "received_for_free": false,
        "recommendationid": "50348573",
        "review": "One of the best city builders which I played in my life.\n\nThere are nearly no limits how you want to play your game. It is extremely enjoyable, even more with mods, but if you want to unlock everything in a legitimate way you will need to give it some time and plan your gameplay well in order to unlock the unique buildings, etc.\n\nI do not own all DLCs. They are too expensive to buy all at the same time. You should better buy the game and DLC's when it is reduced. Unfortunately, the discounts only from time to time go lower than -50%. Sometimes you can buy something for -66%, but it won't be any of the newer DLC's.\n\nGraphics are great, you can zoom it and enjoy the really detailed view of the city (I would recommend doing it at night what makes this game looking just beautiful - you will need Afterdark DLC though - highly recommended regardless of cosmetics as it adds tons of content to the game).\n\nYou can play it well on relatively old PC, even older laptop with dedicated graphics should make it (lowering details is highly recommended). Even dedicated budget laptop cards (like GeForce MX150) can do well, but I would recommend at least the 4 core CPU. \n\nThe only real problem I encountered and which is really annoying is the management of deceased citizens, what can make your life really hard when your city is big enough (I would say it can be difficult for new player over 50,000 citizens and without smart decisions it is a real challenge when your city grows over 150,000). There are the ways to overcame it of course, but you will learn it with getting more experienced.\n\nSimilar problem applies to garbage collection but it is muuuuch easier to fix, expecially with Green Cities DLC (or mods).\n\nI would add some content to it as there are some aspects that could be done better - more buildings! - but Steam workshop provides dozens of addons for free. If would be nice if Paradox made use of gamers suggestions (and mods ideas) to add content to their game for free or at least cheaper than usual.\n\nThe game is extremely enjoyable and the more time you spend with it the more you understand it and every new city you build is more complex and governed better.\n\nRegardless of some issues, I can honestly give this game 10/10 in city builder category (8,5/10) for every other gamer, especially strategy fans.",
        "review_lem": "one of best city builder which play life there nearly no limit how want to play game extremely enjoyable even more with mod but if want to unlock everything legitimate way will need to give some time plan gameplay well order to unlock unique building etc do not own all dlcs too expensive to buy all at same time should better buy game dlc 's when reduce unfortunately discount only from time to time go low than -50 sometimes can buy something for -66 but wo n't be any of new dlc 's graphic great can zoom enjoy really detailed view of city would recommend do at night what make this game look just beautiful will need afterdark dlc though highly recommended regardless of cosmetic a add ton of content to game can play well relatively old pc even old laptop with dedicated graphic should make lower detail highly recommend even dedicated budget laptop card like geforce mx150 can do well but would recommend at least 4 core cpu only real problem encounter which really annoying management of deceased citizen what can make life really hard when city big enough would say can be difficult for new player over 50,000 citizen without smart decision real challenge when city grow over 150,000 there way to overcome of course but will learn with get more experienced similar problem applies to garbage collection but muuuuch easy to fix expecially with green city dlc or mod would add some content to a there some aspect that could be do good more building ! but steam workshop provide dozen of addons for free if would be nice if paradox make use of gamers suggestion mod idea to add content to game for free or at least cheap than usual game extremely enjoyable more time spend with more understand every new city build more complex govern good regardless of some issue can honestly give this game 10/10 city builder category 8,5/10 for every other gamer especially strategy fan",
        "steam_purchase": true,
        "timestamp_created": 1556360975,
        "timestamp_updated": 1556360975,
        "voted_up": true,
        "votes_funny": 1,
        "votes_up": 9,
        "weighted_vote_score": "0.589266777038574219",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1611539531,
            "num_games_owned": 26,
            "num_reviews": 3,
            "playtime_at_review": 812,
            "playtime_forever": 1861,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198447330740"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 51,
        "received_for_free": false,
        "recommendationid": "49037457",
        "review": "Played Skyline for about 20 hours. It's a modern take on the Sim City franchise. If you've played those games in the past you'd be able to pick this game up and have a good idea of how to play it. There's also the flexibility of added depth to the genre provided by the advisors suggestions, data, and trial and error of building cities.",
        "review_lem": "played skyline for about 20 hour 's modern take sim city franchise if 've play those game past 'd be able to pick this game have good idea of how to play there 's also flexibility of added depth to genre provide by advisor suggestion data trial error of building city",
        "steam_purchase": true,
        "timestamp_created": 1550346255,
        "timestamp_updated": 1550346255,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1615857557,
            "num_games_owned": 419,
            "num_reviews": 6,
            "playtime_at_review": 23906,
            "playtime_forever": 53196,
            "playtime_last_two_weeks": 0,
            "steamid": "76561197970256857"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 75,
        "received_for_free": false,
        "recommendationid": "46868849",
        "review": "THE BEST city building game out there.  Yeap.  Waaaaay better than that other sim game you use to play.  One suggestion I would say to a new player is not to load up on every Mods and Assets that you find.  There are many, many items that are nice to see but, I have played since it's launch and it was time for some asset cleaning.  Loading up on items may cause the game to load more slowly.\n\nThe game play is very relaxing.  You have the option to make it more challenging via difficulty levels or the DLC.",
        "review_lem": "best city building game there yeap waaaaay good than that other sim game use to play one suggestion would say to new player not to load every mod asset that find there many many item that nice to see but have play since 's launch be time for some asset cleaning load item may cause game to load more slowly game play very relaxing have option to make more challenging via difficulty level or dlc",
        "steam_purchase": false,
        "timestamp_created": 1543119533,
        "timestamp_updated": 1543119768,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1599099714,
            "num_games_owned": 71,
            "num_reviews": 13,
            "playtime_at_review": 5429,
            "playtime_forever": 15614,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198044649081"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 74,
        "received_for_free": false,
        "recommendationid": "45963943",
        "review": "You can tell the devs had passion when they created this game back in 2015, and it's continued to grow and gain fans & players everyday since. They are a prime example of devs that take in and implement ideas and suggestions that their players put out there. I am really thankful and appreciative of that. That sure shows pride in your work! I truly enjoy the attention to detail, players mods, the DLC's, and updates. There's endless possibilties for any city you make, you'll get spend many hours and wonder how the time flew by so fast.",
        "review_lem": "can tell devs have passion when create this game back 2015 's continue to grow gain fan player everyday since prime example of devs that take implement idea suggestion that player put there really thankful appreciative of that that sure show pride work ! truly enjoy attention to detail player mod dlc 's update there 's endless possibilties for any city make 'll get spend many hour wonder how time fly by so fast",
        "steam_purchase": true,
        "timestamp_created": 1542827378,
        "timestamp_updated": 1542827483,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1586555583,
            "num_games_owned": 163,
            "num_reviews": 77,
            "playtime_at_review": 1552,
            "playtime_forever": 3867,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198010488294"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 241,
        "received_for_free": false,
        "recommendationid": "45163031",
        "review": "I grew up loving Sim City 2000, and playing the crap out of it.\n\nWhen my city-building itch needed scratching again, a friend of mine turned me to Cities: Skylines.\nI love it.\n\nUnless you have the patience and motivation to sit through a tutorial, the game can be a fun challenge beginning for the first time. Have you ever had to think about where your waste water is going? Whether or not it is downstream from your freshwater source? How far away those wind turbines are from the rest of the city and how much noise pollution they create? What about how industrial zones close to residential areas slowly deteriorate the quality of health in that neighborhood?\nLearning these as I played were frustrating in the most fun ways.\n\nAnd yet, sometimes it isn't always that fun when big problems arise. What happens when you find out nobody is working in this new commercial zone when you have plenty of workers and empty office buildings? Probably because you don't have enough schools to create educated workers in that area. What happens when everyone is suddenly getting sick, with no clear cause in site? Maybe because you accidentally connected one pipe wrong, and now the waste water is mixing with the drinking water.\nThe game rarely tells you if you are screwing up, nor does it provide any suggestions for solutions, making it a largely \"learn by doing\" or \"learn by asking your friends\" kind of game.\nPersonally, I don't mind it. In fact, I think it adds to the fun mystique of a city builder, but I think it is worth mentioning to you, reader, in the event it doesn't thrill you.\n\nThe game still hasn't quite gotten that stale for me. The DLC is mad expensive, and I don't know if it will ever be worth it, but the core game is excellent.",
        "review_lem": "grow love sim city 2000 play crap of when city-building itch need scratching again friend of mine turn to city skyline love unless have patience motivation to sit through tutorial game can be fun challenge begin for first time have ever have to think about where waste water go ? whether or not downstream from freshwater source ? how far away those wind turbine from rest of city how much noise pollution create ? what about how industrial zone close to residential area slowly deteriorate quality of health that neighborhood ? learn these a play be frustrate most fun way yet sometimes n't always that fun when big problem arise what happen when find nobody work this new commercial zone when have plenty of worker empty office building ? probably because do n't have enough school to create educated worker that area what happen when everyone suddenly get sick with no clear cause site ? maybe because accidentally connect one pipe wrong now waste water mix with drinking water game rarely tell if screw nor do provide any suggestion for solution make largely learn by do or learn by ask friend kind of game personally do n't mind fact think add to fun mystique of city builder but think worth mention to reader event do n't thrill game still have n't quite get that stale for dlc mad expensive do n't know if will ever be worth but core game excellent",
        "steam_purchase": true,
        "timestamp_created": 1538937303,
        "timestamp_updated": 1538937303,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1623030140,
            "num_games_owned": 5,
            "num_reviews": 1,
            "playtime_at_review": 3285,
            "playtime_forever": 76545,
            "playtime_last_two_weeks": 447,
            "steamid": "76561198188352927"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 10,
        "received_for_free": false,
        "recommendationid": "43568543",
        "review": "Suggestion: city map would be VERy useful when navigating in the game.",
        "review_lem": "suggestion city map would be very useful when navigate game",
        "steam_purchase": true,
        "timestamp_created": 1531760102,
        "timestamp_updated": 1531760102,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1623006286,
            "num_games_owned": 240,
            "num_reviews": 37,
            "playtime_at_review": 17381,
            "playtime_forever": 29551,
            "playtime_last_two_weeks": 1168,
            "steamid": "76561198081991716"
        },
        "comment_count": 8,
        "language": "english",
        "num_words": 249,
        "received_for_free": false,
        "recommendationid": "42614517",
        "review": "[b][ Graphics ][/b]\n☐ WTF\n☐ Bad\n☐ Fine\n☐ Pixel Art\n☐ Good\n☑ Beautiful (Pretty good for its genre)\n\n\n[b][ Difficulty ][/b]\n☐ Braindead \n☐ Easy\n☑ Average (Traffic management is Savage though)\n☐ Hard \n☐ Extreme\n☐ Savage\n\n\n[b][ Game Length ][/b]\n☐ Really short ( 0 - 5 hours)\n☐ Short ( 5 - 15 hours)\n☐ Average ( 15 - 30 hours)\n☐ Long ( 30 - 60 hours)\n☑ Very long ( 60+ hours)\n☐ Endless \n\n\n[b][ Audio ][/b]\n☐ What is Audio?\n☐ Bad\n☐ Average\n☑ Good (It has a catchy soundtrack but you will ignore it sooner or later)\n☐ Fantastic\n☐ Masterpiece\n\n\n[b][ Gameplay ][/b]\n☐ Monotonous\n☐ Very Repetitive \n☐ Average\n☐ A Little Repetitive\n☐ Not Repetitive \n☑ Never Gets Boring (Maybe gets a little bit frustrated though)\n\n\n[b][ Bugs ][/b]\n☐ Unplayable\n☐ Game Breaking\n☐ Occasional Crashes\n☐ Lots of Bugs\n☐ Few Bugs\n☑ Nothing\n\n[h1][ Final Verdict ][/h1]\n[b]8/10 - Awesome[/b]\n\nFor me this is the best building simulator in the market which gets constant updates and support from devs. You are in charge of the city, so control zones, districts, public services and transportation, pollution, resource consumptions, health, happiness, unemployment, budget and MOST importantly - traffic (this is going to be your nemesis unless you start watching YouTube for their fancy/ingenious solutions). One of those games where you want to play \"just a little bit more\" and it is 2 AM already.\n\n\nWhat kind of achievements does this game offer?\n☑ Story Related\n☐ Grindy\n☐ Missable\n☐ Collectibles\n☑ Skill Based\n☐ In Game Secrets\n☐ Multiplayer\n\nIt is almost impossible to play without mods which help you to deal with the trafic and other stuff which gets out of control when you have an enormous city. The most useful of them is Traffic ++ or Traffic Report Tool and Automatic Bulldoze/Empty. The first will help you to improve your roads, while the second mod will automatically clean your city for you.\nThanks to [b][u]Der O-Saft[/u][/b] for the suggestion.",
        "review_lem": "b graphic /b wtf bad fine pixel art good beautiful pretty good for genre b difficulty /b braindead easy average traffic management savage though hard extreme savage b game length /b really short 0 5 hour short 5 15 hour average 15 30 hour long 30 60 hour very long 60+ hour endless b audio /b what audio ? bad average good have catchy soundtrack but will ignore sooner or later fantastic masterpiece b gameplay /b monotonous very repetitive average little repetitive not repetitive never get boring maybe get little bit frustrated though b bug /b unplayable game breaking occasional crash lot of bug few bug nothing h1 final verdict /h1 b 8/10 awesome /b for this best building simulator market which get constant update support from devs charge of city so control zone district public service transportation pollution resource consumption health happiness unemployment budget most importantly traffic this go to be nemesis unless start watch youtube for fancy/ingenious solution one of those game where want to play just little bit more 2 already what kind of achievement do this game offer ? story related grindy missable collectible skill base game secret multiplayer almost impossible to play without mod which help to deal with trafic other stuff which get of control when have enormous city most useful of traffic or traffic report tool automatic bulldoze/empty first will help to improve road while second mod will automatically clean city for thanks to b u der o-saft /u /b for suggestion",
        "steam_purchase": true,
        "timestamp_created": 1528584713,
        "timestamp_updated": 1530610814,
        "voted_up": true,
        "votes_funny": 14,
        "votes_up": 173,
        "weighted_vote_score": "0.809600472450256348",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1528360149,
            "num_games_owned": 323,
            "num_reviews": 40,
            "playtime_at_review": 1256,
            "playtime_forever": 1256,
            "playtime_last_two_weeks": 0,
            "steamid": "76561197999078873"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 122,
        "received_for_free": false,
        "recommendationid": "42459010",
        "review": "I really wanted to like this game, but it leaves one without closure just to the nature of its design. It should allow for more automated options at a granular level. It doesn't cater for the 2 types of people that usually play these games: those that want to design things that run smoothly, and those that want perfection and control in every little detail.\n\nIt would be great if you could hire 'AI helpers' to make suggestions in areas like traffic management, abandonment issues, etc., or even better yet - have the option to have them take care of it for you. Hell - DELEGATE FFS!\n\nFurthermore, all the DLC should be included as part of the core game - their 'features' should be standard in city builders. Hell, there is no real way to see what MAKES people WANT residential/commercial/industrial zones in the first place!",
        "review_lem": "really want to like this game but leave one without closure just to nature of design should allow for more automated option at granular level do n't cater for 2 type of people that usually play these game those that want to design thing that run smoothly those that want perfection control every little detail would be great if could hire 'ai helper to make suggestion area like traffic management abandonment issue etc. or even good yet have option to have take care of for hell delegate ffs ! furthermore all dlc should be include a part of core game 'features should be standard city builder hell there no real way to see what make people want residential/commercial/industrial zone first place !",
        "steam_purchase": true,
        "timestamp_created": 1527987313,
        "timestamp_updated": 1527987313,
        "voted_up": false,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1599895093,
            "num_games_owned": 26,
            "num_reviews": 1,
            "playtime_at_review": 7051,
            "playtime_forever": 27014,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198245808250"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 60,
        "received_for_free": false,
        "recommendationid": "41745603",
        "review": "Please Have a Discount again, The Last time I bought only the main game but I want the DLC's, \n\nI have Suggestion: \n ► Can you do the Pedestrian more convient because it causes more Traffic, Like underpass or Overpass\n ► Can you do road with lane barriers to avoid the switching lanes in the middle of road.\n ► Lastly, The Traffic Manager too can you add that as an official DLC?\n\nThank you Very Much Paradox Interactive Team :D",
        "review_lem": "please have discount again last time buy only main game but want dlc 's have suggestion can do pedestrian more convient because cause more traffic like underpass or overpass can do road with lane barrier to avoid switching lane middle of road lastly traffic manager too can add that a official dlc ? thank very much paradox interactive team d",
        "steam_purchase": true,
        "timestamp_created": 1524964403,
        "timestamp_updated": 1524964403,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1583874913,
            "num_games_owned": 1028,
            "num_reviews": 8,
            "playtime_at_review": 4732,
            "playtime_forever": 11562,
            "playtime_last_two_weeks": 0,
            "steamid": "76561197995358712"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 337,
        "received_for_free": false,
        "recommendationid": "40734394",
        "review": "Good game overall.  Scratches the city builder itch that I get every now and then.  Definitely better than any other option on the market right now.  This tiny little game studio made monolithic EA eat humble pie and Colossal Order deserves significant praise for making a game that consumers actually wanted to play rather than what some clueless nitwit in an suit told them to make.\n\nThe only real nitpick I have with this game is that the traffic AI has some annoying issues that force you to game the system rather than build realistically sometimes.  I've been hoping to see them fix it but its been so long now that I have to assume they aren't going to.  Still fun to play but when your city gets large it can start getting crazy with the traffic to a very unrealistic degree because of nonsensical AI pathing.  I don't know about anyone else but I play city builders to build realistic cities, not to build cities that game a bad AI.  It is the most glaring flaw of the game which is rather perplexing since this is the same studio that made the Cities in Motion traffic simulation games.  If there is one thing Colossal Order should have down by now, it is simulated traffic.  It is an absolute shame it hasn't been corrected since otherwise Cities: Skylines is a stellar game. \n\nThis is a game published by Paradox Interactive which means DLCs.  Lots of them.  This is a love/hate thing for me.  I'm a pretty big Paradox game fan and I love their commitment to continued support for these games years after release but the DLCs are often overpriced for what you get, especially at release. Paradox DLCs are definitely worth buying, just not at the price point Paradox seems to think they are worth.  This is totally on Paradox Interactive, not Colossal Order.  Because DLCs are so frequent with Paradox games, it can get daunting to buy them all as a newcomer.  The Cities: Skylines base game is great on its own so my suggestion is to buy the extras when they go on sale.  Sales happen often on Paradox games between steam, legit online retailers that provide steam keys, and the Paradox website so just wait for one to grab up the extra content packs.\n\nArbitrary score card from 1 to 5 (5 being best):\nPrice: base game 4 / DLCs 2\nFeatures: 4\nEase of play: 4\nReplayability: 5\nGraphics: 4 (for a city builder)\nMusic: 3\n\n",
        "review_lem": "good game overall scratch city builder itch that get every now then definitely well than any other option market right now this tiny little game studio make monolithic ea eat humble pie colossal order deserve significant praise for make game that consumer actually want to play rather than what some clueless nitwit suit tell to make only real nitpick have with this game that traffic ai have some annoy issue that force to game system rather than build realistically sometimes 've be hop to see fix but be so long now that have to assume n't go to still fun to play but when city get large can start get crazy with traffic to very unrealistic degree because of nonsensical ai pathing do n't know about anyone else but play city builder to build realistic city not to build city that game bad ai most glaring flaw of game which rather perplexing since this same studio that make city motion traffic simulation game if there one thing colossal order should have by now simulate traffic absolute shame have n't be correct since otherwise city skyline stellar game this game publish by paradox interactive which mean dlcs lot of this love/hate thing for 'm pretty big paradox game fan love commitment to continue support for these game year after release but dlcs often overprice for what get especially at release paradox dlcs definitely worth buying just not at price point paradox seem to think worth this totally paradox interactive not colossal order because dlcs so frequent with paradox game can get daunt to buy all a newcomer city skyline base game great own so suggestion to buy extra when go sale sale happen often paradox game between steam legit online retailer that provide steam key paradox website so just wait for one to grab extra content pack arbitrary score card from 1 to 5 5 be best price base game 4 dlcs 2 feature 4 ease of play 4 replayability 5 graphic 4 for city builder music 3",
        "steam_purchase": false,
        "timestamp_created": 1520755598,
        "timestamp_updated": 1520755598,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1615150735,
            "num_games_owned": 223,
            "num_reviews": 24,
            "playtime_at_review": 399,
            "playtime_forever": 1068,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198013971931"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 129,
        "received_for_free": false,
        "recommendationid": "36256915",
        "review": "I like this game especially with the ability to add mods.  One suggestion i would make would be to include the first person view as a default option instead of from a mod and to have mini missions like stopping a robber after he's robbed someones purse.  City building is fun but it would make it a much better game.   Not sure I agree with so many dlc's.  The game works out quite expensive once you've purchased the same basic funcionality as simicity through paradox's mods like natural disasters.  I think game developers flunk in the market because games have such high prices.  People just don't have that sort of money to spend on pretty pictures on their screens.  As far as city builders go though i'd say this could be good if they made a cheaper version of their dlc addons as a pack or a season pass to include dlc's.",
        "review_lem": "like this game especially with ability to add mod one suggestion would make would be to include first person view a default option instead of from mod to have mini mission like stop robber after 's robbed someone purse city building fun but would make much well game not sure agree with so many dlc 's game work quite expensive once 've purchase same basic funcionality a simicity through paradox 's mod like natural disaster think game developer flunk market because game have such high price people just do n't have that sort of money to spend pretty picture screen as far a city builder go though 'd say this could be good if make cheap version of dlc addons a pack or season pas to include dlc 's",
        "steam_purchase": true,
        "timestamp_created": 1509759369,
        "timestamp_updated": 1509759369,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1585959817,
            "num_games_owned": 155,
            "num_reviews": 37,
            "playtime_at_review": 9680,
            "playtime_forever": 12270,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198115708208"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 59,
        "received_for_free": false,
        "recommendationid": "34386155",
        "review": "Great game as is.  All around. So I thought I'd give suggestions for future content instead of list all the good things about this game (everything).\nSome Ideas:\n  Future/Cyberpunk DLC\n  Double decker roads\n  Ability to make elevated tram stations\n  Elevated tram 4 lane road\nThere's probably more things I'd recommend but I can't remember.  Please consider adding these features CO / modders.",
        "review_lem": "great game a all around so think 'd give suggestion for future content instead of list all good thing about this game everything some idea future/cyberpunk dlc double decker roads ability to make elevated tram station elevate tram 4 lane road there 's probably more thing 'd recommend but ca n't remember please consider add these feature co modders",
        "steam_purchase": false,
        "timestamp_created": 1503281111,
        "timestamp_updated": 1507408879,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1500239347,
            "num_games_owned": 12,
            "num_reviews": 7,
            "playtime_at_review": 872,
            "playtime_forever": 933,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198041844520"
        },
        "comment_count": 1,
        "language": "english",
        "num_words": 38,
        "received_for_free": true,
        "recommendationid": "33571341",
        "review": "no user friendly game, the tutorial is totally dumb without even a slightest usefulness. problem rises but player would never know what the problem is and it is just becoming increasingly annoying and frastrating because without even a slightest suggestion and clues. The difficult game is only frastrating than any interesting.",
        "review_lem": "no user friendly game tutorial totally dumb without even slightest usefulness problem rise but player would never know what problem just become increasingly annoy frastrating because without even slight suggestion clue difficult game only frastrating than any interesting",
        "steam_purchase": false,
        "timestamp_created": 1500158056,
        "timestamp_updated": 1507381583,
        "voted_up": true,
        "votes_funny": 1,
        "votes_up": 0,
        "weighted_vote_score": "0.49751242995262146",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1505511154,
            "num_games_owned": 38,
            "num_reviews": 2,
            "playtime_at_review": 1673,
            "playtime_forever": 1673,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198171290659"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 88,
        "received_for_free": false,
        "recommendationid": "34830043",
        "review": "I downloaded this game instead of SimCity because the game mechanics were well thought out and the funcitonality is smooth and intuitive. My main suggestion would be to put a LOT more effort into the asthetics of the game. I want to support a new city builder game, but the game would be vastly more engaging if more time was spent on making the buildings look better. Make simple buildings like hospitals or police stations look good instead of being eyesores. Simple things like beautiful parks and more user-friendly road customization would go a long way for this game. \n\nShort version:\nGreat game, kinda ugly though.",
        "review_lem": "download this game instead of simcity because game mechanic be well think funcitonality smooth intuitive main suggestion would be to put lot more effort into asthetics of game want to support new city builder game but game would be vastly more engaging if more time be spend make building look good make simple building like hospital or police station look good instead of be eyesore simple thing like beautiful park more user-friendly road customization would go long way for this game short version great game kinda ugly though",
        "steam_purchase": true,
        "timestamp_created": 1504936864,
        "timestamp_updated": 1504936864,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1613833188,
            "num_games_owned": 7,
            "num_reviews": 1,
            "playtime_at_review": 5705,
            "playtime_forever": 15929,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198353401035"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 22,
        "received_for_free": false,
        "recommendationid": "34796986",
        "review": "Very fun and addicting! Reccomend 10/10 to get! Only suggestion is if they could add some type of danger factor ( War, diseases, gangs )",
        "review_lem": "very fun addict ! reccomend 10/10 to get ! only suggestion if could add some type of danger factor war diseases gang",
        "steam_purchase": true,
        "timestamp_created": 1504799426,
        "timestamp_updated": 1504799426,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1571443402,
            "num_games_owned": 76,
            "num_reviews": 23,
            "playtime_at_review": 1380,
            "playtime_forever": 2920,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198146725267"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 74,
        "received_for_free": false,
        "recommendationid": "34315773",
        "review": "This game is amazing it really is, and the possiblities as to what you can do are endless. I will be honest though the DLC's arn't really worth it and the prices are ridiculous. However, DLC is OPTIONAL which means you don't need to buy them to have a good time, and I don't see why you should dislike the game and state that your shouldn't play just because of some DLC which you don't really need.\n\nI guess the better suggestion is research DLC before you buy it, or stop wasting your money on a virtual world of nothingness.",
        "review_lem": "this game amaze really possiblities a to what can do endless will be honest though dlc 's ar n't really worth price ridiculous however dlc optional which mean do n't need to buy to have good time do n't see why should dislike game state that should n't play just because of some dlc which do n't really need guess good suggestion research dlc before buy or stop waste money virtual world of nothingness",
        "steam_purchase": true,
        "timestamp_created": 1503006070,
        "timestamp_updated": 1503795410,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1498101760,
            "num_games_owned": 8,
            "num_reviews": 1,
            "playtime_at_review": 216,
            "playtime_forever": 5115,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198364982799"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 138,
        "received_for_free": false,
        "recommendationid": "32046867",
        "review": "I've always been a fan and player of city building games, and I always like trying out new ones coming out and ones that have had some good overhauls. However I've never tried out this game until a couple weeks ago and I'm in love! 😎 I thought simcity was the game to have and even though it's a great game, cities skylines takes the cake! The visual graphics, constant needs of the city, mods, maps and dlc's make this the game to have! I really enjoy playing it and although I'm not the best player out there, I am able to start and thrive a successful city so far. But I haven't bought the mass transit and the snowfall dlc yet (I really want them both), I'm having a blast with the natural disasters dlc and the others currently! Anyways if your debating on buying this game or not. DO IT!! You won't be disappointed! 😀 And if yall have any suggestions on maps I should download and play, please let me know!!?!",
        "review_lem": "'ve always be fan player of city building game always like try new one come one that have have some good overhaul however 've never try this game until couple week ago 'm love ! think simcity be game to have even though 's great game city skylines take cake ! visual graphic constant need of city mod map dlc 's make this game to have ! really enjoy play although 'm not best player there able to start thrive successful city so far but have n't buy mass transit snowfall dlc yet really want both 'm have blast with natural disaster dlc others currently ! anyways if debating buy this game or not do ! ! wo n't be disappoint ! if yall have any suggestion map should download play please let know ! ! ? !",
        "steam_purchase": true,
        "timestamp_created": 1496081485,
        "timestamp_updated": 1496081485,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1615521081,
            "num_games_owned": 287,
            "num_reviews": 42,
            "playtime_at_review": 6396,
            "playtime_forever": 21723,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198069996606"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 36,
        "received_for_free": false,
        "recommendationid": "29782384",
        "review": "If you thought SimCity was a bit stale, you're going to love this game.\n\nJust one simple suggestion - read up some real-world city designs and road networks. It'll make your life easier in the long run. Else you'll face a city gone HORRIBLY wrong.",
        "review_lem": "if think simcity be bit stale 're go to love this game just one simple suggestion read some real-world city design road network 'll make life easier long run else 'll face city go horribly wrong",
        "steam_purchase": true,
        "timestamp_created": 1486563486,
        "timestamp_updated": 1486563486,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 1,
        "weighted_vote_score": "0.51538461446762085",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1502620965,
            "num_games_owned": 108,
            "num_reviews": 1,
            "playtime_at_review": 16,
            "playtime_forever": 31,
            "playtime_last_two_weeks": 0,
            "steamid": "76561197960484272"
        },
        "comment_count": 1,
        "language": "english",
        "num_words": 48,
        "received_for_free": false,
        "recommendationid": "29771539",
        "review": "It seems some people just can't play this game, at all. At launch, you'll get an error message \"getthreadcontext failed\" and it'll close. And nobody, FUCKING NOBODY, knows how to fix this shit. Sure, people have suggestions, but none of them actually worked. \n\nCare to make the gamble, and spend several hours frustrated?",
        "review_lem": "seem some people just ca n't play this game at all at launch 'll get error message getthreadcontext fail 'll close nobody fucking nobody know how to fix this shit sure people have suggestion but none of actually work care to make gamble spend several hour frustrate ?",
        "steam_purchase": true,
        "timestamp_created": 1486510386,
        "timestamp_updated": 1486510386,
        "voted_up": false,
        "votes_funny": 0,
        "votes_up": 1,
        "weighted_vote_score": "0.343831270933151245",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1530042194,
            "num_games_owned": 6,
            "num_reviews": 1,
            "playtime_at_review": 1102,
            "playtime_forever": 2843,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198201520555"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 285,
        "received_for_free": false,
        "recommendationid": "29104195",
        "review": "Love this game. I'm a fanatic on public transport, cities and their dynamics, etc. At bare minimum this deserves a 8.75/10. Oh, and I bought the After Dark expansion, as well. \n\nBut I will ask for a few things from Colossal Order:\n\nMixed-use zoning (within one building), please? I have friends on a blog who mentioned C:S in a post, giving it kudos for in-detail management of public transport, but wished that mixed-use zoning was an option. I would be absolutely thrilled if Colossal Order went further and allowed users to notate the proportion of floors dedicated to a specific use (residential, commercial/retail, office, hospitality). \n\nBike lanes? I would really like to see both bike trails and (not mixed traffic) on-street bike lanes as options. \nAnd maybe the option for a trail with a built-in tree and/or green space buffer, with the option to make it elevated, like the High Line in New York?\n\nMore street layout options? For example, 1 lane per direction for buses only (exclusive street), and contra-flow bus lane(s) on a one-way street? And maybe streets with dedicated transit lanes for both buses and trams to utilize, with passing lanes for transit vehicles not stopping? \n\nMetro stations with in-station transfers (so, stations with space for 2 or more lines to have their own 2 tracks) ? \nAnd maybe the option to have multiple entrances to a Metro station?\n\nUnderground electricity lines?\n\nOption to connect railway stations with Metro stations for a free transfer?\n\nUnderground railway stations for city centers?\n\nRailway stations with 2 middle tracks for trains passing through to bypass trains stopped at platforms?\n\nOption to designate districts and/or neighborhoods as 24/7 centers of activity, such as entertainment, retail, bars, etc?\n\nAbility to charge a congestion/cordon fee for entering certain neighborhoods in a motor vehicle, like London (UK) does? \n\n\nJust some suggestions that would make for a truly walkable, bikeable, and transit-friendly city. \n",
        "review_lem": "love this game 'm fanatic public transport city dynamic etc at bare minimum this deserve 8.75/10 oh buy after dark expansion as well but will ask for few thing from colossal order mixed-use zoning within one building please ? have friend blog who mention c post give kudos for in-detail management of public transport but wish that mixed-use zoning be option would be absolutely thrill if colossal order go far allow user to notate proportion of floor dedicate to specific use residential commercial/retail office hospitality bike lane ? would really like to see both bike trail not mixed traffic on-street bike lane a option maybe option for trail with built-in tree and/or green space buffer with option to make elevate like high line new york ? more street layout option ? for example 1 lane per direction for bus only exclusive street contra-flow bus lane one-way street ? maybe street with dedicated transit lane for both bus tram to utilize with pass lane for transit vehicle not stop ? metro station with in-station transfer so station with space for 2 or more line to have own 2 track ? maybe option to have multiple entrance to metro station ? underground electricity line ? option to connect railway station with metro station for free transfer ? underground railway station for city center ? railway station with 2 middle track for train pass through to bypass train stop at platform ? option to designate district and/or neighborhood a 24/7 center of activity such a entertainment retail bar etc ? ability to charge congestion/cordon fee for enter certain neighborhood motor vehicle like london uk do ? just some suggestion that would make for truly walkable bikeable transit-friendly city",
        "steam_purchase": true,
        "timestamp_created": 1483839764,
        "timestamp_updated": 1483839764,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": "0.49972236156463623",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1531918745,
            "num_games_owned": 46,
            "num_reviews": 5,
            "playtime_at_review": 1270,
            "playtime_forever": 1538,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198202924108"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 111,
        "received_for_free": false,
        "recommendationid": "28281253",
        "review": "What can I say about this game...... First, I'll start with the bad:\n- You have to wait for it to download.\n\nNow the good:\nYou never get bored with this game! There is always something to do and, once you start thinking you've seen everything, you realize 3 more updates have arrived which all bring FREE extra content to the original game! The community is also amazing, as shown with the huge assortment of things available in the workshop.\nYou use logic in this game, and I love every minute of it. \nIts so relaxing to come home, fire up Cities, and just watch your little citizens scurry around like ants. \n\nAs a suggestion to the developers: If you could make a huge version of this, along the idea of the Civilization games, that would be amazing! Countries: Skylines ;)",
        "review_lem": "what can say about this game first 'll start with bad have to wait for to download now good never get bore with this game ! there always something to do once start think 've see everything realize 3 more update have arrive which all bring free extra content to original game ! community also amazing a show with huge assortment of thing available workshop use logic this game love every minute of so relax to come home fire city just watch little citizens scurry around like ant a suggestion to developer if could make huge version of this along idea of civilization game that would be amazing ! country skyline",
        "steam_purchase": true,
        "timestamp_created": 1481339665,
        "timestamp_updated": 1481339665,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1622323924,
            "num_games_owned": 12,
            "num_reviews": 4,
            "playtime_at_review": 8905,
            "playtime_forever": 95406,
            "playtime_last_two_weeks": 227,
            "steamid": "76561198030919230"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 137,
        "received_for_free": false,
        "recommendationid": "28201451",
        "review": "Very good city simulation, much much better than Sim City, but I am still missing some features.\n\n-You should be able to easily build raised railways. That includes trams and maglev trains. You should also easily be able to build train track and maglev tunnels.\n\n-Similary you should easily be able to build roads and highways in tunnels with ramps to the surface to connect to the city roads....and easily build raised roads an highways.\n\n-The terraforming tools should be more precise and easier and more effective to use.\n\n-There should be more possibility in getting a special feel to different areas in your city. If you had the ability to designate areas to for instance to: Beach community, Commercial center, Financial center, Tourist paradise, cultural center... and the buildings and services concentrated in your designated area should follow this designation, son in the beach community you would see surfers on the water, people at the beach, surfer shops and houses to fit...\n\nOh well just some suggestions...",
        "review_lem": "very good city simulation much much good than sim city but still miss some feature -you should be able to easily build raise railway that include tram maglev train should also easily be able to build train track maglev tunnel -similary should easily be able to build road highway tunnel with ramp to surface to connect to city road easily build raise road highway -the terraforming tool should be more precise easy more effective to use -there should be more possibility get special feel to different area city if have ability to designate area to for instance to beach community commercial center financial center tourist paradise cultural center building service concentrate designated area should follow this designation son beach community would see surfer water people at beach surfer shop house to fit oh well just some suggestion",
        "steam_purchase": true,
        "timestamp_created": 1480937080,
        "timestamp_updated": 1480937080,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1617855300,
            "num_games_owned": 53,
            "num_reviews": 23,
            "playtime_at_review": 5036,
            "playtime_forever": 24745,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198083830254"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 194,
        "received_for_free": false,
        "recommendationid": "14832535",
        "review": "Cities Skylines Review\n\nOne of the best city-builder games I've ever played.\n-----------------------------------------------------------------------------------\nGameplay                                                                                   \n-----------------------------------------------------------------------------------\nGameplay in Cities Skylines gives you plenty of options and customization in the game. There are lots of buildings and models, the traffic simulation is detailed and mesmerizing, the zoning, taxing, and budgeting panels are easy to learn, the simulation is deep and visual, and the fluid dynamics put a cherry on top.\n\n9/10\n----------------------------------------------------------------------------------\nModding\n----------------------------------------------------------------------------------\nModding in Cities Skylines is extremely simple, easy to learn, detailed, and fun. You can edit buildings, make new ones, make your own maps, and import height maps to create real world terrain maps. The Cities Skylines workshop also has hundreds of mods that you can add in to the game with one click.\n\n10/10\n---------------------------------------------------------------------------------\nDisasters\n---------------------------------------------------------------------------------\nDisasters are the only let down of Cities Skylines. There are only occasional fires that don't even spread, and the only 'disaster' you can create is when you a dam on a fast flowing river and break it to make a devastating wave. Other than that, when it comes to disasters, Cities Skylines is bone dry.\n\n4/10\n--------------------------------------------------------------------------------\nDeveloper Involvement\n--------------------------------------------------------------------------------\nThe devs of Cities Skylines are wide open to suggestion and feedback on the game, they give good feedback to community creations, and they are all ears on social media.\n\n10/10\n-------------------------------------------------------------------------------\nMusic\n-------------------------------------------------------------------------------\nThe soundtrack in Cities Skylines is beautiful, it's not overwhelming, and it adds a nice feel to the game that makes you feel like you really are building a city.\n\n9/10\n-------------------------------------------------------------------------------\n\nFINAL SCORE FOR CITIES SKYLINES:\n\n84/100\n\nVery good game, I'd recommend it to any city builder fan.",
        "review_lem": "city skyline review one of best city-builder game 've ever play gameplay gameplay city skyline give plenty of option customization game there lot of building model traffic simulation detailed mesmerizing zoning taxing budgeting panel easy to learn simulation deep visual fluid dynamic put cherry top 9/10 modding modding city skyline extremely simple easy to learn detail fun can edit building make new one make own map import height map to create real world terrain map city skyline workshop also have hundred of mod that can add to game with one click 10/10 disaster disaster only let of city skyline there only occasional fire that do n't even spread only 'disaster can create when dam fast flowing river break to make devastating wave other than that when come to disaster city skyline bone dry 4/10 developer involvement devs of city skyline wide open to suggestion feedback game give good feedback to community creation all ear social medium 10/10 music soundtrack city skyline beautiful 's not overwhelming add nice feel to game that make feel like really build city 9/10 final score for city skyline 84/100 very good game 'd recommend to any city builder fan",
        "steam_purchase": true,
        "timestamp_created": 1426047028,
        "timestamp_updated": 1480044295,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 1,
        "weighted_vote_score": "0.523809552192687988",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1610284716,
            "num_games_owned": 171,
            "num_reviews": 7,
            "playtime_at_review": 7781,
            "playtime_forever": 20398,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198010977100"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 221,
        "received_for_free": false,
        "recommendationid": "27027317",
        "review": "Great game, well implemented, no issues for me at all on Win 7 64 bit, 20GB ram, and Nvidia 750i card.\n\nI dont write many reviews but this product deserves it, so here goes.\n\nMy only criticisms, might be:\n[*] documentation regarding placement of intersections, train stations etc, how to rotate them, but the answers are all available.  Select item, right click and drag to rotate, easy to do once you know.\n[*] the inability to undo.......but at least you get a refund for destruction. \n[*] difficulty in making bus routes go where you want them. My solution make more stops to limit possible paths.\n[*] workshop add-on to show angles of curves and snap points great for precise control of road curves, and shapes, should be part of the game.\n\nThe workshop and editor make a good product,  great!\n\nShort of adding different visuals, I cant think of anything significant to make this a better product.\n\nSuggestions:\n[*] Possibly the ability to control timing of traffic lights, users could create a traffic light object and save the timing.\n[*] Parking lots, or control of parking on the side of road, effectively making it wider for heavy traffic.\n[*] Use of GPS to determine the fastest route based on traffic flow, and policies.\n[*] Creation of traffic monitoring object for a limited area to work with GPS.\n[*] Accidents\n[*] Mountainous terrain limiting traffic, resources and development ruining enviroment and tourism.\n[*] Cities split by national boundaries (build a wall) and nations with different labour, infrastructure  and tax issues.\n\nVery well done, as far as city builders go 9.6 out of 10! ;-)",
        "review_lem": "great game well implement no issue for at all win 7 64 bit 20gb ram nvidia 750i card dont write many review but this product deserve so here go only criticism might be documentation regard placement of intersection train station etc how to rotate but answer all available select item right click drag to rotate easy to do once know inability to undo but at least get refund for destruction difficulty make bus route go where want solution make more stop to limit possible path workshop add-on to show angle of curve snap point great for precise control of road curve shape should be part of game workshop editor make good product great ! short of add different visuals cant think of anything significant to make this good product suggestion possibly ability to control timing of traffic light user could create traffic light object save timing parking lot or control of park side of road effectively make wide for heavy traffic use of gps to determine fast route base traffic flow policy creation of traffic monitoring object for limited area to work with gps accident mountainous terrain limit traffic resource development ruin enviroment tourism city split by national boundary build wall nation with different labour infrastructure tax issue very well do as far a city builder go 9.6 of 10 !",
        "steam_purchase": true,
        "timestamp_created": 1479963502,
        "timestamp_updated": 1479968154,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1600288169,
            "num_games_owned": 6,
            "num_reviews": 1,
            "playtime_at_review": 77,
            "playtime_forever": 6552,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198151506662"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 19,
        "received_for_free": false,
        "recommendationid": "22984501",
        "review": "When ever I get on it lags and crashes! I would recommend this game just beware of the lag! It is horrible any suggestions?",
        "review_lem": "when ever get lag crash ! would recommend this game just beware of lag ! horrible any suggestion ?",
        "steam_purchase": true,
        "timestamp_created": 1463256527,
        "timestamp_updated": 1463256527,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1600351710,
            "num_games_owned": 297,
            "num_reviews": 24,
            "playtime_at_review": 13795,
            "playtime_forever": 20231,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198127611100"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 98,
        "received_for_free": false,
        "recommendationid": "15113004",
        "review": "This game is amazeballs! If you have a pattern down with SimCity games, apart from 5, then buy this game. If, like me, you have no fucking clue what to do, buy this game!!! I found it fun to work out how everything worked, even if that involved going to YouTube and typing in the search bar, \"WHAT THE FUCK DO I DO IN CITIES: SKYLINES\". All jokes aside, this game is amazing and it is totally worth your money right now. If you have not bought this game, I have a few other suggestions for you... All of which are mental hospitals. =D\n\nEDIT!!!: The game has gotten a few expansion packs. They are both fantastic and totally worth the money.",
        "review_lem": "this game amazeballs ! if have pattern with simcity game apart from 5 then buy this game if like have no fuck clue what to do buy this game ! ! ! find fun to work how everything work even if that involve go to youtube type search bar what fuck do do city skyline all joke aside this game amazing totally worth money right now if have not buy this game have few other suggestion for all of which mental hospital =d edit ! ! ! game have get few expansion pack both fantastic totally worth money",
        "steam_purchase": true,
        "timestamp_created": 1427650496,
        "timestamp_updated": 1455992365,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1617606608,
            "num_games_owned": 41,
            "num_reviews": 8,
            "playtime_at_review": 9135,
            "playtime_forever": 88911,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198065490543"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 128,
        "received_for_free": false,
        "recommendationid": "21282342",
        "review": "This is the EA Sim City killer! I specify the EA version because Maxis used to be a solid company prior to EA aquiring them, but I digress.\n\nThere are still a few bugs and some features that we, the community, want implemented. This is where it gets awesome. Typically, these suggestions and bugs would go unnoticed by the developers; however, the devs for C:S listen, respond and do their absolute best at letting us know they hear our complaints and suggestions.\n\nThe game itself, prior to the Snowfall DLC, is very solid and engaging. The assets are beautiful, the landscapes are well drawn and most of the mechanics work flawlessly.\n\nThe biggest pro to this game is the community. Without the support of hundreds of thousands of players, world-wide, this game would not have the depth that it does. The C:S mod and asset community is almost too large to quantify.\n\nI will be an active player of this game and member of the C:S community for many years to come!",
        "review_lem": "this ea sim city killer ! specify ea version because maxi use to be solid company prior to ea aquiring but digress there still few bug some feature that community want implement this where get awesome typically these suggestion bug would go unnoticed by developer however devs for c listen respond do absolute best at let u know hear complaint suggestion game prior to snowfall dlc very solid engage asset beautiful landscape well draw most of mechanic work flawlessly big pro to this game community without support of hundred of thousand of player world-wide this game would not have depth that do c mod asset community almost too large to quantify will be active player of this game member of c community for many year to come !",
        "steam_purchase": true,
        "timestamp_created": 1455741848,
        "timestamp_updated": 1455741848,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1542072714,
            "num_games_owned": 348,
            "num_reviews": 13,
            "playtime_at_review": 2004,
            "playtime_forever": 2599,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198146114872"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 193,
        "received_for_free": false,
        "recommendationid": "21168915",
        "review": "The death of Maxis was a huge blow to me after the release of Sim City 5? I think? What was Sim City 5? Anyways, a slew of bad reviews and ratings kept me away from buying that game, and after learning how restrictive that game was, I decided against ever buying it.\n\nSo there I was looking for an alternative to a city building sim. There weren't many and the few that existed weren't that great. With the release of Cities: Skylines that all changed.\n\nIf you guys remember Sim City 4 and all it's glory, Cities: Skylines is pretty much that and more. It has a huge modding community that have done a wonderful job sharing their creations and tools with all of us (seriously guys I can't thank you enough : ) ). Other than that, this game is about as good as you can get with a city building sim. On top of that the developers are very active and are listening to their playerbase for suggestions and everything, And I see that as a huge plus. One bummer is that you can't unleash natural disasters on your city but ohh wellllll.\n\nI give this 9 goofy tweeters out of 10. Seriously, get this if you're a veteran of the Sim City series and are looking into getting the latest city builder sim. You. Will. Not. Regret. a. Thing...except putting more of your alotted time into this than you have. ;)",
        "review_lem": "death of maxi be huge blow to after release of sim city 5 ? think ? what be sim city 5 ? anyways slew of bad review rating keep away from buy that game after learn how restrictive that game be decide against ever buy so there be look for alternative to city building sim there be n't many few that exist be n't that great with release of city skyline that all change if guy remember sim city 4 all 's glory city skyline pretty much that more have huge modding community that have do wonderful job share creation tool with all of u seriously guy ca n't thank enough other than that this game about as good a can get with city building sim top of that developer very active listen to playerbase for suggestion everything see that a huge plus one bummer that ca n't unleash natural disaster city but ohh wellllll give this 9 goofy tweeter of 10 seriously get this if 're veteran of sim city series look into get late city builder sim will not regret thing except put more of alotted time into this than have",
        "steam_purchase": true,
        "timestamp_created": 1455338032,
        "timestamp_updated": 1455338252,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": "0.497702896595001221",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1612209848,
            "num_games_owned": 9,
            "num_reviews": 1,
            "playtime_at_review": 2256,
            "playtime_forever": 4540,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198150474370"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 224,
        "received_for_free": false,
        "recommendationid": "20321903",
        "review": "Very impressive since first play, after dark is also a great update. Thanks to some great mods. The best simulation games at this scale yet. Much better than Simcity and City XXL. You guys have said so much of the advantages, I would like to talk some disadvantages.\n1.Traffix: built in traffic control systems is not intelligent enough, for instance when you have a motorway exit it must be a single lane to avoid \"unnatural\" lane switch caused jam, if you want to have a two lane exit or three lane exit, you would have to rely on T++ to \"teach the\" the traffic system how to switch lanes reasonablily.\n2.power and water supply is boring, you must drag silly pipes one by one to ensure water supply and build wires to power the city which does not make sense. Why not supply water and power once a power station is connected to roads like it works in Sim city? If you would like to make it serious and  reasonable please add some sewage system building functions with considering terrains and introduce sewage flow mechanism just like build ground/underground traffic system.\n3. Pollution treatment: you could build skyscrapers and hi tech factories, but there are no recycle centres or sewage treatment plant. You cannot put the garbage car centres far from your city since they have limited coverage areas.If you would like to build Green cities, congrats: not possible.\n4. Additional suggestions: \ndisasters such as unclear power plant explosion is achievable.\nYet jails introduced, police is just silly as it looks, learn from fire engine please.",
        "review_lem": "very impressive since first play after dark also great update thanks to some great mod best simulation game at this scale yet much good than simcity city xxl guy have say so much of advantage would like to talk some disadvantage 1.traffix build traffic control system not intelligent enough for instance when have motorway exit must be single lane to avoid unnatural lane switch cause jam if want to have two lane exit or three lane exit would have to rely t++ to teach traffic system how to switch lane reasonablily 2.power water supply boring must drag silly pip one by one to ensure water supply build wire to power city which do not make sense why not supply water power once power station connect to road like work sim city ? if would like to make serious reasonable please add some sewage system build function with consider terrain introduce sewage flow mechanism just like build ground/underground traffic system 3 pollution treatment could build skyscraper hi tech factory but there no recycle centre or sewage treatment plant can not put garbage car centre far from city since have limit coverage areas.if would like to build green city congrats not possible 4 additional suggestion disaster such a unclear power plant explosion achievable yet jail introduce police just silly a look learn from fire engine please",
        "steam_purchase": true,
        "timestamp_created": 1451998703,
        "timestamp_updated": 1451998703,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1615139180,
            "num_games_owned": 22,
            "num_reviews": 1,
            "playtime_at_review": 125,
            "playtime_forever": 1734,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198146089483"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 30,
        "received_for_free": false,
        "recommendationid": "19442557",
        "review": "Its a very good game and i do think its the best city game however on laptop it is laggy and i really want this to be patched any suggestions on stopping it, or has anyone else experianced this problem (please give me tips)",
        "review_lem": "very good game do think best city game however laptop laggy really want this to be patch any suggestion stop or have anyone else experianced this problem please give tip",
        "steam_purchase": true,
        "timestamp_created": 1449080508,
        "timestamp_updated": 1449080508,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1601669916,
            "num_games_owned": 276,
            "num_reviews": 2,
            "playtime_at_review": 11292,
            "playtime_forever": 58074,
            "playtime_last_two_weeks": 0,
            "steamid": "76561197989432020"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 680,
        "received_for_free": false,
        "recommendationid": "19439419",
        "review": "After 150+ hours on this game (I know embarrassing) I think a few things are worth pointing out for people still on the fence.  I was someone who loved the late Sim City remake.  Don’t get me wrong it certainly had its problems especially when considering things such as size and scope and the debacle that was online only gameplay.  Sim City also came with the normal hooks we’ve become accustom to with most EA titles.  That being said I found the core elements of Sim City to be quite fun and once you got used to playing within the restrictions that it demanded it was a very fun game.\n\nWhy did I just yammer about Sim City on a skylines review?  It seemed necessary because Cities Skylines will immediately feel a lot like Sim City.  My actual immediate first impression of Skylines was it felt as if the designers played and loved Sim City.  They then sat around reading all of the comment and forum boards that were undoubtedly exploding with complaints and suggestions for improvements.  They then took all of the most common threads and built a new Sim City that addressed all of the popular issues.\n\nCities Skylines lets you build huge cities, gives you a ton more flexibility than Sim City and the presence of Steam Workshop only furthers the experience.  The development team’s experience from Cities in Motion shines through as the transportation system works great as well.   Especially when you consider the price point and the fact that its developers have been great in working with the game community it is in my mind a no doubt buy.  However, I figured I should also talk about the less amazing parts of the game as well.\n\nDespite all the above mentioned great things the game does a few minor sore spots stick out.  Agriculture (without steam workshop) seems a bit off.  The agriculture zones the same exact way any other zone works.  So instead of having massive farms like you would expect to see (and what you might be accustom to from say Sim City 4) you do not get this.  Instead you get agriculture buildings that rise like those in the heavy industry sectors accompanied by small 4x4 farms.  Keep in mind the game was developed by Europeans so for American gamers the farms (again without workshop items) have a European flare instead of what you might see in say Texas/Kansas/etc.  Not that this is a bad thing mind you, just something to be aware of before jumping in.  \nAnother point worth mentioning, without mincing words… tourism doesn’t work well in this game.  Don’t get me wrong the game has all the staples built in, landmarks, airports, stadiums, etc.  However, in a city with well over 100,000 people, an intl airport, train connection, etc sometimes I could still only manage around 200 tourists.  This aspect of the game is a far cry from the fun you might recall having when building say a tourist city in Sim City.  This is by no means a game breaker, but a bit of a disappointment and something I imagine will eventually get addressed by devs.  It is worth mentioning that there are tourism mods floating around as well.  \nLastly and this is probably the biggest issue.  After playing a fair share of this game there is just something missing.  For all the shortcomings that Sim City had, all the frustrations, the limitations, Sim City had a tremendous amount of character.  From the plopable buildings that were customizable to the distinct art theme, for me Sim City always felt like you were building a personalized City that was entirely yours.  Yes cities were frustratingly small and yes, eventually you had so many people living in a city traffic was a complete nightmare, but none of these things took away from the personal relationship Sim City built with its players.  For some reason and I’m not sure I can even explain why, Cities Skylines just doesn’t build this kind of relationship with the player.  While cities are gigantic they seem very mechanical, and while the small cities of Sim Cities made it easier to overlook a limited number of building styles, it’s harder to ignore in Skylines.  When you have a gigantic city and all the lights turn on and off at the same time across hundreds of buildings and you see the same building over a dozen times in a sprawling city it does hurt the overall experience.  Again, not game breaking problems and yes many of these issues can be addressed with Steam workshop issues, but I figured I just throw my two cents in.  \nIn general I find Skyline and its expansion pack to be very satisfying games.  I would still recommend it over Sim City, but not without mentioning some of the above items.  If you’re just jumping in now, know that the folks at Colossal Order are doing a great job staying both connected with the game community as well as supporting the game with continuous updates and patches.  Don’t hesitate to buy this game if you think you might like it, but just know it’s not perfect (like anything else).  \n",
        "review_lem": "after 150+ hour this game know embarrass think few thing worth point for people still fence be someone who love late sim city remake don get wrong certainly have problem especially when consider thing such a size scope debacle that be online only gameplay sim city also come with normal hook ve become accustom to with most ea title that be say find core element of sim city to be quite fun once get use to play within restriction that demand be very fun game why do just yammer about sim city skyline review ? seem necessary because city skyline will immediately feel lot like sim city actual immediate first impression of skyline be felt a if designer play love sim city then sit around read all of comment forum board that be undoubtedly explode with complaint suggestion for improvement then take all of most common thread build new sim city that address all of popular issue city skyline let build huge city give ton more flexibility than sim city presence of steam workshop only further experience development team experience from city motion shine through a transportation system work great as well especially when consider price point fact that developer have be great work with game community mind no doubt buy however figure should also talk about less amazing part of game as well despite all above mention great thing game do few minor sore spot stick agriculture without steam workshop seem bit off agriculture zone same exact way any other zone work so instead of have massive farm like would expect to see what might be accustom to from say sim city 4 do not get this instead get agriculture building that rise like those heavy industry sector accompany by small 4x4 farm keep mind game be develop by european so for american gamers farm again without workshop item have european flare instead of what might see say texas/kansas/etc not that this bad thing mind just something to be aware of before jumping another point worth mentioning without mince words… tourism doesn work well this game don get wrong game have all staple build landmark airport stadium etc however city with well over 100,000 people intl airport train connection etc sometimes could still only manage around 200 tourist this aspect of game far cry from fun might recall have when build say tourist city sim city this by no mean game breaker but bit of disappointment something imagine will eventually get address by devs worth mention that there tourism mod float around as well lastly this probably big issue after play fair share of this game there just something miss for all shortcoming that sim city have all frustration limitation sim city have tremendous amount of character from plopable building that be customizable to distinct art theme for sim city always felt like be build personalized city that be entirely yes city be frustratingly small yes eventually have so many people live city traffic be complete nightmare but none of these thing take away from personal relationship sim city build with player for some reason m not sure can even explain why city skyline just doesn build this kind of relationship with player while city gigantic seem very mechanical while small city of sim city make easy to overlook limited number of building style harder to ignore skyline when have gigantic city all light turn off at same time across hundred of building see same building over dozen time sprawling city do hurt overall experience again not game break problem yes many of these issue can be address with steam workshop issue but figure just throw two cent general find skyline expansion pack to be very satisfying game would still recommend over sim city but not without mention some of above item if re just jump now know that folk at colossal order do great job stay both connect with game community as well a support game with continuous update patch don hesitate to buy this game if think might like but just know not perfect like anything else",
        "steam_purchase": true,
        "timestamp_created": 1449071406,
        "timestamp_updated": 1449071406,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1443919468,
            "num_games_owned": 45,
            "num_reviews": 6,
            "playtime_at_review": 1471,
            "playtime_forever": 1667,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198035963100"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 91,
        "received_for_free": false,
        "recommendationid": "18282753",
        "review": "There are a lot of city building games and I wanted something (unlike SimCity) that worked :-O I chose very good, this game looks great, and so do the trains in it, I like trains too :-) I just got it with After Dark and not far into a city yet, but love it so far!\n\nSuggestion : I would love to see a FUTURISTIC expansion, perhaps with a moon and/or mars map, futuristic habitat housing and buildings, even futuristic cars/trucks, etc. I would buy that!\n\nQuestion : As I said, I like trains. I wonder if there is a way to follow/track a train and watch it travel through your city. That would be cool!\n\nGreat looking game!\n",
        "review_lem": "there lot of city building game want something unlike simcity that work -o choose very good this game look great so do train like train too just get with after dark not far into city yet but love so far ! suggestion would love to see futuristic expansion perhaps with moon and/or mar map futuristic habitat housing building even futuristic cars/trucks etc would buy that ! question a say like train wonder if there way to follow/track train watch travel through city that would be cool ! great look game !",
        "steam_purchase": true,
        "timestamp_created": 1443741436,
        "timestamp_updated": 1443741436,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1593808017,
            "num_games_owned": 251,
            "num_reviews": 15,
            "playtime_at_review": 13883,
            "playtime_forever": 28114,
            "playtime_last_two_weeks": 0,
            "steamid": "76561197964299270"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 60,
        "received_for_free": false,
        "recommendationid": "18153822",
        "review": "Can't say this enough, but this is the true successor to the Sim City titles of the past. I owned and played Sim City (2013), and while it could be fun, it was often a letdown. But Cities:Skylines makes up for all that. There's a thriving mod scene, which has expended the game far beyond vanilla. Devs that are open to discussion and suggestions from the community. Once again, we have a proper city-builder sim.",
        "review_lem": "ca n't say this enough but this true successor to sim city title of past own play sim city 2013 while could be fun be often letdown but city skyline make for all that there 's thriving mod scene which have expend game far beyond vanilla devs that open to discussion suggestion from community once again have proper city-builder sim",
        "steam_purchase": false,
        "timestamp_created": 1442974681,
        "timestamp_updated": 1442974681,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1621753271,
            "num_games_owned": 58,
            "num_reviews": 18,
            "playtime_at_review": 708,
            "playtime_forever": 5683,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198143542264"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 41,
        "received_for_free": false,
        "recommendationid": "17921789",
        "review": "Really good city bulider game but you have to be careful of where you put the bulidings, powerplants ect, because you will lose money. My suggestion is to have a instruction manual to the game to make sure you know what you're doing, and you could be a successful citibuilder!\nOverall 9/10",
        "review_lem": "really good city bulider game but have to be careful of where put bulidings powerplants ect because will lose money suggestion to have instruction manual to game to make sure know what 're do could be successful citibuilder ! overall 9/10",
        "steam_purchase": true,
        "timestamp_created": 1441591975,
        "timestamp_updated": 1441592285,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 2,
        "weighted_vote_score": "0.552238762378692627",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1553353822,
            "num_games_owned": 474,
            "num_reviews": 6,
            "playtime_at_review": 1343,
            "playtime_forever": 6043,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198064859432"
        },
        "comment_count": 33,
        "language": "english",
        "num_words": 113,
        "received_for_free": false,
        "recommendationid": "17352254",
        "review": "1st day\nA friend buying this game, intrigued, ask him to share it with me.\n\n2nd day\nPlaying this game after office hour whilst waiting for my wife\n\n3rd day\nStarting to play on-work hour, thankfully it's linux supported\n\n4th day\nplaying as soon as I got home, wife complaining alot\n\n5th day\nwife complaining a lot more, watching me play every time\n\n6th day\nwife starting to ask question and give suggestion\n\n7th day\nwife starting to play on her own\n\n8th day\nwife complains the game unplayable because my friend who share it is currently playing\n\n9th day\nwife cannot take it anymore, finally give the order to buy the game\n\n10th day\ncannot access my own computer, wife is playing all the time, starting to regret playing this game....",
        "review_lem": "1st day friend buying this game intrigue ask to share with 2nd day play this game after office hour whilst wait for wife 3rd day start to play on-work hour thankfully 's linux support 4th day playing as soon a get home wife complain alot 5th day wife complain lot more watch play every time 6th day wife start to ask question give suggestion 7th day wife start to play own 8th day wife complain game unplayable because friend who share currently play 9th day wife can not take anymore finally give order to buy game 10th day can not access own computer wife play all time start to regret play this game",
        "steam_purchase": true,
        "timestamp_created": 1438531768,
        "timestamp_updated": 1438531768,
        "voted_up": true,
        "votes_funny": 6632,
        "votes_up": 1531,
        "weighted_vote_score": "0.905791282653808594",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1620038628,
            "num_games_owned": 155,
            "num_reviews": 2,
            "playtime_at_review": 8561,
            "playtime_forever": 81016,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198062387838"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 37,
        "received_for_free": false,
        "recommendationid": "17326932",
        "review": "It's Nice, If the Developer Read this, I have a suggestion, that the highway or the exit and entrance(i dont know what they call it) must have a Toll Booth just to get the game like Reality :). I like the game I played it if my internet is broken, and also if i have time.",
        "review_lem": "'s nice if developer read this have suggestion that highway or exit entrance dont know what call must have toll booth just to get game like reality like game play if internet break also if have time",
        "steam_purchase": true,
        "timestamp_created": 1438400811,
        "timestamp_updated": 1438400811,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1603648730,
            "num_games_owned": 97,
            "num_reviews": 2,
            "playtime_at_review": 3517,
            "playtime_forever": 16460,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198043244607"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 385,
        "received_for_free": false,
        "recommendationid": "16293737",
        "review": "It took years of waiting, but now thanks to the folks at Colossal Order we have the modern and innovative city builder known as Cities Skylines.\n\nWhat I like:\n- The game is everything that Simcity 2013 should have been and better. To top it all off, it's only $30 (half what Simcity was at launch!)\n\n- The maps are huge. You start on one 2x2km tile (similar to what you got in Simcity), but you have the ability to purchase up to 9 tiles (25 with mods) and you can acquire more land fairly early on in the game.\n\n- Ability to designate specific lines for your buses, subways, and trains to follow instead of having them go all over the place like in Simcity.\n\n- An innovative road construction system. You have a variety of different road types at your disposal, and the game engine has the capability of making some pretty seamless transitions and interesctions. My favourite feature has to be the way you draw highways. Highways are treated as a 3 lane one-way road, and there's a separate onramp/offramp tool. For those who are particularly inclined, you have the potential to make some pretty crazy interchanges.\n\n- Mod support. There's already a large number of fantastic mods available already, and given time they will only get better! If there's a feature that you feel is missing from the base game, you can either get it from the Steam Workshop, or make it yourself!\n\nWhat needs improvement/Suggestions for future additions:\n- Better options for transferring between transit lines, especially for metros. As it stands right now metro stations can only support one tunnel going in two directions. It would be nice to be able to have the ability to transfer between two perpendicular lines in one metro station.\n\n- There's no vanilla teraforming tool. Yes there is a mod that adds one, but it would have been nicer if the developer had made it from the start.\n\n- Road variety is awesome as it is, but there are so many things they could have added. For example, highways with different numbers of lanes (i.e. 2 lanes each direction, 4-5 lanes each direction, etc.)\n\n- One thing I'd really like to see is more modular transport buildings (i.e. multi-track train station, bus terminal, ability to add more terminals/runways on airports, etc).\n\n- There could be more transport options as well (i.e. above ground metro, streetcars, monorail, maglev, etc).\n\nOverall:\n\nThis game is worth the money. They somehow managed to strike a perfect balance for just about everything. The game has a quick enough learning curve that it's forgiving for a beginner, but at the same time it's challenging enough for a seasoned city builder. If you're a fan of city builder games, there's no reason why you shouldn't buy this game!",
        "review_lem": "take year of waiting but now thanks to folk at colossal order have modern innovative city builder know a city skyline what like game everything that simcity 2013 should have be well to top all off 's only 30 half what simcity be at launch ! map huge start one 2x2km tile similar to what get simcity but have ability to purchase to 9 tile 25 with mod can acquire more land fairly early game ability to designate specific line for bus subway train to follow instead of have go all over place like simcity innovative road construction system have variety of different road type at disposal game engine have capability of make some pretty seamless transition interesctions favourite feature have to be way draw highway highway treat a 3 lane one-way road there 's separate onramp/offramp tool for those who particularly inclined have potential to make some pretty crazy interchange mod support there 's already large number of fantastic mod available already give time will only get well ! if there 's feature that feel miss from base game can either get from steam workshop or make ! what need improvement/suggestions for future addition good option for transfer between transit line especially for metro a stand right now metro station can only support one tunnel go two direction would be nice to be able to have ability to transfer between two perpendicular line one metro station there 's no vanilla teraforming tool yes there mod that add one but would have be nicer if developer have make from start road variety awesome a but there so many thing could have add for example highways with different number of lane i.e 2 lane each direction 4-5 lane each direction etc one thing 'd really like to see more modular transport building i.e multi-track train station bus terminal ability to add more terminals/runways airport etc there could be more transport option a well i.e above ground metro streetcar monorail maglev etc overall this game worth money somehow manage to strike perfect balance for just about everything game have quick enough learn curve that 's forgive for beginner but at same time 's challenge enough for seasoned city builder if 're fan of city builder game there 's no reason why should n't buy this game !",
        "steam_purchase": true,
        "timestamp_created": 1433955624,
        "timestamp_updated": 1433955624,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1586290135,
            "num_games_owned": 98,
            "num_reviews": 2,
            "playtime_at_review": 81,
            "playtime_forever": 186,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198179847190"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 30,
        "received_for_free": false,
        "recommendationid": "15915617",
        "review": "Awesome game, loved it. Although suggestion for the creators- At the boundaries, perhaps you could put water there, just to make it a bit more pretty. Make it seem like your building on a big island or system of islands.",
        "review_lem": "awesome game love although suggestion for creators- at boundary perhaps could put water there just to make bit more pretty make seem like building big island or system of island",
        "steam_purchase": true,
        "timestamp_created": 1432136693,
        "timestamp_updated": 1432136693,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1611848073,
            "num_games_owned": 994,
            "num_reviews": 109,
            "playtime_at_review": 6683,
            "playtime_forever": 8716,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198057258664"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 243,
        "received_for_free": false,
        "recommendationid": "15783196",
        "review": "I am not very good with games like this, the fact is I am around 96 hours in (after last game play session) and got very little done apart from a few achievements is not the point however, because I am simply having far too much fun designing things, messing up and re-starting till I get my city and after all isn't that the point of any game, it isn't all about achievements and high scores etc, but can be a lot of fun too.\n\nThe basics of the game are fantastic, it's looks great and the game play and options keep you wanting to come back to play more, to continue building, adding and removing and making your city better and more appreciated by it's inhabitants,  this game makes you want to come back time and time again.\n\nThere are a few things I have noticed though, being a little older sometimes it is hit and miss whether the bulldozer works the first time you click on it, that may just be me however it does seem to happen a lot, also I find that while there is a lot to add to your evolving and expanding city (especially with the Steam community ad-ons) there could be more things to add on, this is a rather minor complaint and without comparing it to another certain game it certainly does cover a lot of options really well to make the city you build feel alive.\n\nOverall while there are minor faults (sorry I am no great writer and know I am missing stuff out but didn't want to make this review too long) they can be easily overlooked as the game is good enough and fun enough to allow it a few imperfections.  I'd certainly recommend buying this game but maybe with the suggestion that when you do you check out some of the ad-ons through Steam's Workshop community to fix a few minor things,",
        "review_lem": "not very good with game like this fact around 96 hour after last game play session get very little do apart from few achievement not point however because simply have far too much fun design thing mess re-starting till get city after all n't that point of any game n't all about achievement high score etc but can be lot of fun too basic of game fantastic 's look great game play option keep want to come back to play more to continue building add remove make city well more appreciate by 's inhabitant this game make want to come back time time again there few thing have notice though be little old sometimes hit miss whether bulldozer work first time click that may just be however do seem to happen lot also find that while there lot to add to evolving expand city especially with steam community ad-ons there could be more thing to add this rather minor complaint without compare to another certain game certainly do cover lot of option really well to make city build feel alive overall while there minor fault sorry no great writer know miss stuff but do n't want to make this review too long can be easily overlook a game good enough fun enough to allow few imperfection 'd certainly recommend buy this game but maybe with suggestion that when do check some of ad-ons through steam 's workshop community to fix few minor thing",
        "steam_purchase": false,
        "timestamp_created": 1431320366,
        "timestamp_updated": 1431320366,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": "0.462633430957794189",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1620018153,
            "num_games_owned": 121,
            "num_reviews": 26,
            "playtime_at_review": 3820,
            "playtime_forever": 12042,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198080543482"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 89,
        "received_for_free": false,
        "recommendationid": "15749446",
        "review": "This is a great city builder.  Nicely put together with lots of involving and intersting aspects.  I am loving playing this game with the exception of of the railroad system, (mentioned below).\n\nThe graphics are excellent and the use of mods is well supported.\n\nIN NEED OF FIXING: Railroad traffic jams are a menace.  Only a single exit is provided to each adjoining unowned region is allowed and these fill up very quickly with dozens of trains stuck in a non-moving queu.  My suggestion to the devs is to allow us additional exit rail connections to get the trains moving again.\n\nIf this one issue is fixed then the game will be the best ever city builder for me.",
        "review_lem": "this great city builder nicely put together with lot of involve intersting aspect love play this game with exception of of railroad system mention below graphic excellent use of mod well support need of fixing railroad traffic jam menace only single exit provide to each adjoin unowned region allow these fill very quickly with dozen of train stick non-moving queu suggestion to devs to allow u additional exit rail connection to get train move again if this one issue fix then game will be best ever city builder for",
        "steam_purchase": true,
        "timestamp_created": 1431142904,
        "timestamp_updated": 1431222728,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 2,
        "weighted_vote_score": "0.503510534763336182",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1559698439,
            "num_games_owned": 339,
            "num_reviews": 2,
            "playtime_at_review": 9350,
            "playtime_forever": 12135,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198119208048"
        },
        "comment_count": 10,
        "language": "english",
        "num_words": 366,
        "received_for_free": false,
        "recommendationid": "15094943",
        "review": "[b]Q: What I think of this game?[/b]\n\nA: Best city builder game I played... ever... period\n\n[b]Q: What I don’t like about it?[/b]\n\nA: Traffic does need to be fine tuned, and I feel mods are necessary to balance the game, but it's very tedious...\n\n[b]Q: What about user generated content?[/b]\n\nA: Workshop community has been very impressive, adding so many cool things to the game. \n\nI am at a point where I feel I am missing out on amazing mods and content, because there are so many to choose from, and I can't invest the time to try them all. \n\nBut how can you really complain from having too much choice, so forget I just said that...\n\n[b]Q: Does it worth the price?[/b]\n\nA: Price might seem a bit steep to some, but for any fan of city builder games, you'll get your money's worth in the first week... and probably lose a bit of grasp on reality at the same time. \n\nBottom line, you will get a lot more then what you pay for, so why wait?\n\n[b]Q: What I would love to see added to the game?[/b]\n\nA: I would like to see some scenarios of some kind being added. \n\nMilestones are great, and sandbox opens so many possibilities... yet still, I would like to have the option of being guided or limited to specific objectives.\n\nIt would help me understand some parts of the game better, and bring my game to another level.\n\n[b]Q: What are my advices when playing the game?[/b]\n\nA: The game expects you to be a pro at this; you'll have to make a lot of mistakes before you find your way.\n\nIt's easy to \"cheat\" the game, but it will not make it more fun. \n\n- Watch tutorials to get some ideas \n- Use mods with caution, they can improve the game, but can also break it... \n- Help rating user generated content, rating takes 5 seconds and creators should get recognition for their work\n- Make suggestions, Colossal Order and Paradox are listening to the feedback and are not wasting any time\n\n[b]Q: What would I like to say to Paradox and Colossal Order’s team?[/b]\n\nA: You have given me what I was waiting for! THANK YOU! \n\nBut you have also stolen 100 hours of my life already... Are you proud?     I am sure you are ;) \n\nYou’ve set new standards in the way a game should be delivered to the community and updated based on user feedback, and all gamers will benefit from your work. \n\nKudos to everyone!!!\n\n[b]Q: Where am I going?[/b]\n\nA: Sorry, I have a city to build... goodbye!",
        "review_lem": "b q what think of this game ? /b best city builder game play ever period b q what don like about ? /b traffic do need to be fine tune feel mod necessary to balance game but 's very tedious b q what about user generate content ? /b workshop community have be very impressive add so many cool thing to game at point where feel miss amaze mod content because there so many to choose from ca n't invest time to try all but how can really complain from have too much choice so forget just say that b q do worth price ? /b price might seem bit steep to some but for any fan of city builder game 'll get money 's worth first week probably lose bit of grasp reality at same time bottom line will get lot more then what pay for so why wait ? b q what would love to see added to game ? /b would like to see some scenario of some kind be add milestone great sandbox open so many possibility yet still would like to have option of be guide or limit to specific objective would help understand some part of game well bring game to another level b q what advice when play game ? /b game expect to be pro at this 'll have to make lot of mistake before find way 's easy to cheat game but will not make more fun watch tutorial to get some idea use mod with caution can improve game but can also break help rating user generate content rating take 5 second creator should get recognition for work make suggestion colossal order paradox listen to feedback not waste any time b q what would like to say to paradox colossal order team ? /b have give what be wait for ! thank ! but have also steal 100 hour of life already proud ? sure ve set new standard way game should be deliver to community update base user feedback all gamers will benefit from work kudos to everyone ! ! ! b q where go ? /b sorry have city to build goodbye !",
        "steam_purchase": true,
        "timestamp_created": 1427563427,
        "timestamp_updated": 1427934609,
        "voted_up": true,
        "votes_funny": 97,
        "votes_up": 238,
        "weighted_vote_score": "0.910864055156707764",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1622049392,
            "num_games_owned": 382,
            "num_reviews": 5,
            "playtime_at_review": 1891,
            "playtime_forever": 10191,
            "playtime_last_two_weeks": 22,
            "steamid": "76561197960927419"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 567,
        "received_for_free": false,
        "recommendationid": "15092402",
        "review": "Remember SimCity 2013? Good. Forget about it. Erase it from your mind.\n\nTHIS is what it should have been! It's literally a mirror image clone of SimCity 2013, without the restrictions.\n\nPositives:\n[list]\n[*]Offline play. \n[*]Purchaseable, expandable plots (not like what SimCity had, these actually join up). \n[*]1000's of mods.\n[*]Excellent road system including 1 way systems.\n[*]Graphics akin to SimCity.\n[*]Ability to name people, shops, districts etc.\n[*]Customisable transportation systems (routes, stops etc).\n[*]Ploppable trees\n[*]Interesting city 'gifts'\n[*]Cities feel alive - busy, buzzing. Parks are in use etc\n[*]Easy to place roads/road/bridge all using keyboard controls - no need to go into a menu to select bridges etc\n[*]Simple, elegant UI\n[*]Performs excellently - no lag, delay for me so far!\n[*]Multi-core support! (Looking at you Cities XL and SimCity!)\n[/list]\n\nThe list goes on...\n\nHowever, it does need some polish in some areas and isn't without fault. There are parts where competitors outshine this, but if the devs add these bits in, then it can and will be the perfect city sim..\n\nNegatives/improvment suggestions;\n[list]\n[*]No air polution currently in game.\n[*]Weather/wind/day/night not changable. Static. I'd love to see my City at night.\n[*]If the above was ever implimented, then being able to 'zone' streetlights etc would be great - but this is obviously a small 'want'\n[*]Trees do not seem to help clear ground pollution\n[*]Tree placement needs more options, such as the zoning 'brush' or line drawing like roads. Being able to select multiple types at once would be nice too.\n[*]Traffic can be buggy. Not SimCity buggy, but emergancy vehicles will often sit in traffic instead of going around them.\n[*]No tunnels (Yet. Apparently due to come with an update)\n[*]Ability to select zone types would be welcome to help create more controlled districts. Perhaps an update to the district tool could solve this? eg - commercial zones types. I often get 20 donut shops in a row. Being able to say \"This is an \"electrical area\" or \"Retail\" area would create diversity amonsgt shops. Additional types should also be applied to Industry to allow cleaner industry/more diverse industry (Electrical, Manufactoring etc).\n[*]Building 'themes' . Related to above, but would be nice to set themes of buildings. I often get a chinese style home amoung european buildings or US buildings and it breaks the flow. Being able to set a theme could also work for commercial areas (say, set type =food/retail, theme = chinese, creat a mini china town)\n[*]Pedestrian only areas for shops/houses using the path tool would be welcome - at present buildings can only be placed along roads. Many city centres revolve around pedestrian only access (certainly in the UK), so being able to place zones along paths could create better environments.\n[*]Car parks - Park and Ride (Transport menu?) and Commercial/Retail (would work well with the above)\n[*]More information for transport network - ie, est.route time and effiency\n[*]Farms need improving - I'd love to see the farming zones resemble the farming zones as found in Cities XL. Farms reside on large fields, and the ones currently in game are all small polts situated against roads. You can't really create a rural area as such.\n[/list]\n\nI'm sure I could think of other suggestions, but they are the bulk of what I feel is missing currently.  Mods can probably rectify a few of these (I've see better transport/road info mods, and to some extent, car parks) but these need to be standard features and need to be controllable where they operate.\n\nOverall, I am extremely impressed with what the team have done thus far, and can only hope future updates bring in additional features to make this the perfect City Simulator. \n\nDon't hesitate to pick this up! It's EXTREMELY cheap (I even got 20% off at GMG), and if you even remotely like City Building games, this will not fail to impress you.",
        "review_lem": "remember simcity 2013 ? good forget about erase from mind this what should have be ! 's literally mirror image clone of simcity 2013 without restriction positive list offline play purchaseable expandable plot not like what simcity have these actually join 1000 's of mod excellent road system include 1 way system graphic akin to simcity ability to name people shop district etc customisable transportation system route stop etc ploppable tree interesting city 'gifts' city feel alive busy buzz park use etc easy to place roads/road/bridge all use keyboard control no need to go into menu to select bridge etc simple elegant ui performs excellently no lag delay for so far ! multi-core support ! look at city xl simcity ! /list list go however do need some polish some area n't without fault there part where competitor outshine this but if devs add these bit then can will be perfect city sim negatives/improvment suggestion list no air polution currently game weather/wind/day/night not changable static 'd love to see city at night if above be ever implimented then be able to 'zone streetlight etc would be great but this obviously small 'want' tree do not seem to help clear ground pollution tree placement need more option such a zone 'brush or line draw like road be able to select multiple type at once would be nice too traffic can be buggy not simcity buggy but emergancy vehicle will often sit traffic instead of go around no tunnel yet apparently due to come with update ability to select zone type would be welcome to help create more controlled district perhaps update to district tool could solve this ? eg commercial zone type often get 20 donut shop row be able to say this electrical area or retail area would create diversity amonsgt shop additional type should also be apply to industry to allow clean industry/more diverse industry electrical manufactoring etc building 'themes relate to above but would be nice to set theme of building often get chinese style home amoung european building or u building break flow be able to set theme could also work for commercial area say set type =food/retail theme chinese creat mini china town pedestrian only area for shops/houses use path tool would be welcome at present building can only be place along road many city centre revolve around pedestrian only access certainly uk so be able to place zone along path could create good environment car park park ride transport menu ? commercial/retail would work well with above more information for transport network ie est.route time effiency farm need improve 'd love to see farm zone resemble farming zone a find city xl farm reside large field one currently game all small polts situate against road ca n't really create rural area a such /list 'm sure could think of other suggestion but bulk of what feel miss currently mod can probably rectify few of these 've see good transport/road info mod to some extent car park but these need to be standard feature need to be controllable where operate overall extremely impressed with what team have do thus far can only hope future update bring additional feature to make this perfect city simulator do n't hesitate to pick this ! 's extremely cheap even get 20 off at gmg if even remotely like city building game this will not fail to impress",
        "steam_purchase": false,
        "timestamp_created": 1427553907,
        "timestamp_updated": 1427553907,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1591131244,
            "num_games_owned": 676,
            "num_reviews": 37,
            "playtime_at_review": 1186,
            "playtime_forever": 2904,
            "playtime_last_two_weeks": 0,
            "steamid": "76561197964815052"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 110,
        "received_for_free": false,
        "recommendationid": "15011921",
        "review": "Preliminary review - All the things you wanted Simcity to be at half the price. Excellent customizability of roadways. Mod support is amazing.\n\nMinor quibbles:\n\nTraffic problems can cause traffic to use only one lane of highways which can create impassible gridlock. I would love to see vehicles use alternate routes if the shortest one has heavy traffic.\n\nThe game provides little guidance on what you're doing wrong. We could use more alerts that our utilities are nearing capacity or suggestions on how to alleviate traffic, or design efficient mass transit.\n\nThe game is extremely forgiving and encourages iterating. Move special buildings a big help. Bulldoze large neighbourhoods to build that highway. Highway roundabout? Sure thing!\n\nAll around amazing, and am excited to see what tweaking is coming.",
        "review_lem": "preliminary review all thing want simcity to be at half price excellent customizability of roadway mod support amaze minor quibble traffic problem can cause traffic to use only one lane of highway which can create impassible gridlock would love to see vehicle use alternate route if short one have heavy traffic game provide little guidance what 're do wrong could use more alert that utility near capacity or suggestion how to alleviate traffic or design efficient mass transit game extremely forgiving encourage iterate move special building big help bulldoze large neighbourhood to build that highway highway roundabout ? sure thing ! all around amazing excite to see what tweak come",
        "steam_purchase": true,
        "timestamp_created": 1427059210,
        "timestamp_updated": 1427059210,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1562004595,
            "num_games_owned": 140,
            "num_reviews": 12,
            "playtime_at_review": 749,
            "playtime_forever": 1634,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198040840296"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 104,
        "received_for_free": false,
        "recommendationid": "14967086",
        "review": "While I do recommend this game for what it is, I have realized that this game may not be for me. I need to react to things... not simply initiate all actions. My main problem is that you are never really punished in this game for bad decisions/not planning ahead.\n\nHere's my main suggestion. Things YOU place should have construction times which would make you have to plan ahead. When something unexpected happens that you didnt' plan for, you should be punished. You forgot to put a cemetary down and dead people are piling up? Well it will take some game time for your new cemetary to be made. Same goes with electricity and water shortages and so forth. That would take this game to the next level in my mind.",
        "review_lem": "while do recommend this game for what have realize that this game may not be for need to react to thing not simply initiate all action main problem that never really punish this game for bad decisions/not plan ahead here 's main suggestion thing place should have construction time which would make have to plan ahead when something unexpected happen that didnt plan for should be punish forget to put cemetary dead people pile ? well will take some game time for new cemetary to be make same go with electricity water shortage so forth that would take this game to next level mind",
        "steam_purchase": true,
        "timestamp_created": 1426815122,
        "timestamp_updated": 1426815122,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1622941266,
            "num_games_owned": 354,
            "num_reviews": 16,
            "playtime_at_review": 1700,
            "playtime_forever": 16408,
            "playtime_last_two_weeks": 552,
            "steamid": "76561198029967785"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 609,
        "received_for_free": false,
        "recommendationid": "14908878",
        "review": "--Initial review at 19.1 hours--\n\nCities: Skylines has given me a great experience so far. Simply put, it's like Sim City if a bunch of corporate wigs didn't tell the developers \"This is what people want in a city sim, and this is how we're telling you to make it\"\n\nIt's well thought out, there is attention to detail, and is a welcome new addition to the city sim genre.\n\nThat being said, it isn't perfect.\n\nPros: \n-Well thought out game mechanics\n-The ability to draw out districts and enact policies in both specific districts and overall city policy.\n-Nice attention to detail with emergency services. As a person involved in the fire service, it's nice seeing that a firetruck in game doesn't just pull up and start shooting water at the building. One or two will show up, a few firemen get out of each and either run into the building or stand near the trucks and get hoses set up, and then the water will start flowing. It's not really important overall, but it's an appreciated detail.\n-Diverse power grid options ranging from coal and oil to solar, two kinds of wind, and hydroelectric. The only addition to that list that I'd like to see is some form of hydrogen power source.\n-Makes fun of Sim City in many ways, including achievement names, base city size, and other things.\n-Zoning is easy and has a layer of customization to it.\n\nCons:\n-There appears to be a self-zoning bug of some sort. I have tried to dezone an area between two roads but it keeps rezoning itself to low-density commercial.\n-The game doesn't always provide clear feedback to what an issue is and how to resolve it. Some issues are fairly simple to trouble shoot, but currently my city is having an issue with a lack of buyers of products from my industrial buildings, but there is no industrial, commercial, or residential demand.\n-The game takes a bit of patience to learn. It took me five or six tries before I created a successful city.\n-Some of the requirements for the unique buildings are counter-productive. Some ask you to have an obsurd number of abandoned buildings present in your city or to have a certain number of sick citizens. Compared to the other requirements like having three filled cemetaries, doing well in this sector, that sector, et cetera, those requirements are backwards and the negative concequences outway the good of unlocking the unique building. It's counter intuitive.\n-No day-night cycle.\n\nSuggestions:\n-It would be nice to see a few more types of unique buildings or a rework of the requirements to unlocking the existing ones.\n-After a certain amount of time has passed for you to get your city up and running, it would be nice to see the introduction of emergencies, disasters, and other events occur that you must deal with. Perhaps things from hurricanes, snowstorms, riots, to water pipes bursting and such, et cetera. It would also allow for new polcies to be added such as putting your city into a state of emergency, curfews, gun control, citizens must shovel their portion of sidewalk during snow storms (Save money, decrease happiness), and more.\n-Perhaps a new utility being created for the road department. Street sweepers can help reduce ground polution, roads can degrade and you'll have to spend money to keep them maintained from pot holes and such, if snowstorms are added then snowplows would be important.\n-Adding the homeless could be interesting. Increased crime rates in areas they squat. You could combat that by building shelters, soup kitchens, or outlawing homelessness if you're feeling particularly evil.\n-It would be nice if parks didn't have to be placed right along a road, so you could put a playground in the middle of a bunch of high rises and have walking paths leading to them.\n-Perhaps adding a mayor's office that could be upgraded to allow for certain buffs or allow citizens to come to you with city propositions, requests, and complaints.\n\nAt this point in time, I'd give this game an 8/10. It's very well made, but there's a lot of room for improvement. After a decent amount of time, there's not much residential, industrial, or commercial demand and the challenge wears off.\n\nIf you have the money to spare, I'd say that you should buy this game at it's full price or wait for a sale.\n",
        "review_lem": "initial review at 19.1 hour city skyline have give great experience so far simply put 's like sim city if bunch of corporate wig do n't tell developer this what people want city sim this how 're tell to make 's well think there attention to detail welcome new addition to city sim genre that be say n't perfect pro -well think game mechanic -the ability to draw district enact policy both specific district overall city policy -nice attention to detail with emergency service a person involve fire service 's nice see that firetruck game do n't just pull start shoot water at building one or two will show few fireman get of each either run into building or stand near truck get hose set then water will start flow 's not really important overall but 's appreciated detail -diverse power grid option range from coal oil to solar two kind of wind hydroelectric only addition to that list that 'd like to see some form of hydrogen power source -makes fun of sim city many way include achievement name base city size other thing -zoning easy have layer of customization to con -there appear to be self-zoning bug of some sort have try to dezone area between two road but keep rezoning to low-density commercial -the game do n't always provide clear feedback to what issue how to resolve some issue fairly simple to trouble shoot but currently city have issue with lack of buyer of product from industrial building but there no industrial commercial or residential demand -the game take bit of patience to learn take five or six try before create successful city -some of requirement for unique building counter-productive some ask to have obsurd number of abandon building present city or to have certain number of sick citizen compare to other requirement like have three filled cemetaries do well this sector that sector et cetera those requirement backwards negative concequences outway good of unlock unique building 's counter intuitive -no day-night cycle suggestion -it would be nice to see few more type of unique building or rework of requirement to unlock exist one -after certain amount of time have pass for to get city run would be nice to see introduction of emergency disaster other event occur that must deal with perhaps thing from hurricane snowstorm riot to water pipe burst such et cetera would also allow for new polcies to be add such a put city into state of emergency curfew gun control citizen must shovel portion of sidewalk during snow storm save money decrease happiness more -perhaps new utility be create for road department street sweeper can help reduce ground polution road can degrade 'll have to spend money to keep maintain from pot hole such if snowstorm add then snowplow would be important -adding homeless could be interesting increase crime rate area squat could combat that by build shelter soup kitchen or outlaw homelessness if 're feel particularly evil -it would be nice if park do n't have to be place right along road so could put playground middle of bunch of high rise have walk path lead to -perhaps add mayor 's office that could be upgrade to allow for certain buff or allow citizen to come to with city proposition request complaint at this point time 'd give this game 8/10 's very well make but there 's lot of room for improvement after decent amount of time there 's not much residential industrial or commercial demand challenge wear off if have money to spare 'd say that should buy this game at 's full price or wait for sale",
        "steam_purchase": true,
        "timestamp_created": 1426449743,
        "timestamp_updated": 1426449743,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1454873713,
            "num_games_owned": 155,
            "num_reviews": 37,
            "playtime_at_review": 1946,
            "playtime_forever": 1993,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198090130969"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 247,
        "received_for_free": false,
        "recommendationid": "14848433",
        "review": "This game is definitely worth the buy. The last city-builder I purchased had so many buttons to figure out how to play it, I got too bored after 30 minutes not knowing what to do and so I deleted it and never tried again. With Cities: Skylines, however, I had no problem figuring out what to do. Took me a few re-do attempts to spend my money on the right stuff starting off, but after that it was a cruise! \n\nI love how this game lets the player control so many things in the city budget, and zone districts, and truly be in control of how the city matures. I also like the progress rate of the game. Not too fast, not too slow. \n\n***MOST OF ALL*** I was so entertained by the game that I lost track of time. Not too many games can make me lose track of time. I started playing around 6pm and the next thing I knew it was 4am. WHOA. Where'd the time go?! That's how you know you're having fun. I quit bad games really fast, and if a game has something I don't like right at the get-go, I won't even give the rest of the game a chance, I just uninstall immediately. Obviously that didn't happen with this game haha. \n\nSuggestions: \n-Make a day/night cycle\n-Offer a service for $2/month to provide in-game live support for help when players are having trouble with their city and need advice\n-Need more trees and landscaping. No gardens?\n-Would be awesome to have events, like Super Bowl in my city every few years. Make it dynamic, increased traffic, increased sales, hotel rooms booked, temporary fan shops, etc. City wide events would be great\n-Make the f-stop on the virtual camera less narrow\n\nMore suggestions coming (eventually)",
        "review_lem": "this game definitely worth buy last city-builder purchase have so many button to figure how to play get too bore after 30 minute not know what to do so delete never try again with city skyline however have no problem figure what to do take few re-do attempt to spend money right stuff start off but after that be cruise ! love how this game let player control so many thing city budget zone district truly be control of how city mature also like progress rate of game not too fast not too slow most of all be so entertain by game that lose track of time not too many game can make lose track of time start play around 6pm next thing know be 4am whoa where 'd time go ? ! that 's how know 're have fun quit bad game really fast if game have something do n't like right at get-go wo n't even give rest of game chance just uninstall immediately obviously that do n't happen with this game haha suggestion -make day/night cycle -offer service for 2/month to provide in-game live support for help when player have trouble with city need advice -need more tree landscape no garden ? -would be awesome to have event like super bowl city every few year make dynamic increased traffic increase sale hotel room book temporary fan shop etc city wide event would be great -make f-stop virtual camera less narrow more suggestion come eventually",
        "steam_purchase": false,
        "timestamp_created": 1426151816,
        "timestamp_updated": 1426398648,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 3,
        "weighted_vote_score": "0.47032475471496582",
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1619485349,
            "num_games_owned": 414,
            "num_reviews": 9,
            "playtime_at_review": 1159,
            "playtime_forever": 10336,
            "playtime_last_two_weeks": 0,
            "steamid": "76561198069268680"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 249,
        "received_for_free": false,
        "recommendationid": "14869053",
        "review": "By far the best city builder I've ever played. The level of detail in every part of this game is stunning. Every person is simulated, and you can watch as they go through their day and drive around your city/use public transport to go to work, home, or shopping, or just visit various landmarks around your city. You can even watch as fire fighters are dispatched from a fire house to put out a fire, as EMS is dispatched to help an injured person, or as police are sent out to patrol or investigate a crime. Your industry can send out trucks to supply your commercial district with products to be bought by your residents, or export it through highways or train stations. Although traffic management can take some time to get used to, you have a large amount of control over how your city flows and operates, and what kind of buildings are built in your city. The graphics for this game are much better than they first appear, and I high recommend getting the 1st person camera mod to get a good experience. Even in a large city with countless cars and sims being simulated, this game has run flawless for me so far, with a medium end computer (GTX 560 Ti/Intel i5 2400). The modding potential is also huge for this game, featuring great mod support and tons of community content, even only 3 days after release. My only major suggestion for this game would be the addition of dynamic events (Such as casino contracts/toxic waste facilites), but there is still plenty to do without that! This game has far more value than most $60 games, so $30 is an amazing price. There are plenty of twitch streams and youtube videos displaying this game that I highly recommend watching if you are still unsure!",
        "review_lem": "by far best city builder 've ever play level of detail every part of this game stun every person simulate can watch a go through day drive around city/use public transport to go to work home or shopping or just visit various landmark around city can even watch a fire fighter dispatch from fire house to put fire a em dispatch to help injured person or a police send to patrol or investigate crime industry can send truck to supply commercial district with product to be buy by resident or export through highway or train station although traffic management can take some time to get use to have large amount of control over how city flow operate what kind of building build city graphic for this game much good than first appear high recommend get 1st person camera mod to get good experience even large city with countless car sims be simulate this game have run flawless for so far with medium end computer gtx 560 ti/intel i5 2400 modding potential also huge for this game feature great mod support ton of community content even only 3 day after release only major suggestion for this game would be addition of dynamic event such a casino contracts/toxic waste facilites but there still plenty to do without that ! this game have far more value than most 60 game so 30 amazing price there plenty of twitch stream youtube videos display this game that highly recommend watch if still unsure !",
        "steam_purchase": false,
        "timestamp_created": 1426272949,
        "timestamp_updated": 1426272949,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    },
    {
        "author": {
            "last_played": 1622497289,
            "num_games_owned": 18,
            "num_reviews": 1,
            "playtime_at_review": 2259,
            "playtime_forever": 15441,
            "playtime_last_two_weeks": 2463,
            "steamid": "76561198025057346"
        },
        "comment_count": 0,
        "language": "english",
        "num_words": 82,
        "received_for_free": false,
        "recommendationid": "14838904",
        "review": "This is the city builder we were waiting for since the last real city builder was launched (SC4). Cities Skylines foundations are solid and the game was developed with one eye in allowing content to be provided by the community and another to be built upon by the developers. By the, the developers (Colossal Order - a bunch of crazy, highly passionate Finns) and the publisher (Paradox) have been super open and transparent with the community (check Reddit and Paradox Plaza), there are open channels of communication with the actual developers and they do listen to suggestions and feedback. Looking forward for hours and years of entertainement!",
        "review_lem": "this city builder be wait for since last real city builder be launch sc4 city skyline foundation solid game be develop with one eye allow content to be provide by community another to be build upon by developer by developer colossal order bunch of crazy highly passionate finn publisher paradox have be super open transparent with community check reddit paradox plaza there open channel of communication with actual developer do listen to suggestion feedback look forward for hour year of entertainement !",
        "steam_purchase": true,
        "timestamp_created": 1426090734,
        "timestamp_updated": 1426090734,
        "voted_up": true,
        "votes_funny": 0,
        "votes_up": 0,
        "weighted_vote_score": 0,
        "written_during_early_access": false
    }
]