[
    {
        "comment": "there should be a new DLC where you can place different denomination churches like catholioliuc church it a jewsh temple. it should also come with a way to build custom cemerterys like the industry area. you can paint a specific denomination ceemtary or just have a generic one . that would be cool to have because sim city 2013 had churches and cities skylines needs custom death car. like they have parks and industry its not hard to make customs cemetarys.",
        "label": "General",
        "title": "NEW DLC IDEA"
    },
    {
        "comment": "It doesn't work on Apple (Macbook Air) M1.How can I deal with it?",
        "label": "General",
        "title": "Does it work on Apple (Macbook Air) M1?"
    },
    {
        "comment": "I was watching a video and the person had all their mods(?) alphabetized.How do I alphabetize the list of mods (the items on the left side of the screen below \"Mod Settings\"?",
        "label": "General",
        "title": "[ANSWERED] Alphabetize Mod List on Options Screen?"
    },
    {
        "comment": "TME has been causing crashes in my game when I try to change the speed limit on my CSUR highway roads or any road for that matter. Seeking help.",
        "label": "General",
        "title": "TM:PE v11.5.2 STABLE-hotfix-1 27/May/2021"
    },
    {
        "comment": "Tried Cities Skylines for the first time in a while after the update, but couldn't deselect by right click ?",
        "label": "General",
        "title": "Deselection"
    },
    {
        "comment": "Playing with the new CCPs, I've noticed a glaring issue (or what seems to be an issue) with the Bridges and Piers pack. Namely that for the Tiered Seawall Wide, there is no option with stairs, and the same for the City Tiered Quay, again, no option with stairs. How are the people supposed to reach the lower levels on both of them? This would be okay if there were just pathways on the upper level for both, but there isn't, there's also the option for a pathway on the lower level. Now, for the Tiered Seawall Wide, you could use the Tiered Seawall with Stairs, but then you would have a large (and kind of ugly) gap between the two, as one is wide and the other isn't. However with the City Tiered Quay there is no option to get people to the lower level, as it is higher than the Tiered Seawall's lower level, but lower than the City Quay Wide with Stairs. This would at least be somewhat easier if you could at least line pathways up with the lower levels, but you can't do that (or at least I haven't figured it out). So why are these types missing? It seems like having options with stairs for these two would have been a pretty obvious thing to include.",
        "label": "General",
        "title": "(Bridges and Piers) Missing Seawall and Quay Types"
    },
    {
        "comment": "Referring back to that latest interview with Colossal Order CEO - Mariina Hallikainen - I would like to see what you think they may have in plans, not what your wishes are (we all know them, and they are various).So here is the interview thatdj97was kind enough to post a link to (interview in GameInformer -https://www.gameinformer.com/interv...ks-development-mod-community-and-six-years-of).Couple of take-outs:\"We had some serious SimCity fans in the dev team and wanted to achieve a spiritual successor to SimCity 4. Naturally, the ambition was much greater than our resources at the time, so we had to prioritize on the amount of content and different features.\" on starting development on Cities:Skylines and its inspiration.\"This was the dream from the start! (that's about current game - Cities:Skylines) We founded Colossal Order with the intent that one day “Colossal Cities” would see the light of day. This was back in 2009 and we were five people with limited funding, so we decided to start with something smaller to build toward greater challenges. (...) I’d say the most important learning from the CIM (Cities In Motion) games was getting to know the community and the meaning of modding for our games. We really see it as an integral part of the player experience we want to offer not only now but in the future.\"\"Our target at Colossal for copies sold was 300,000, so more than our previous games and enough to allow us to work on the game for a couple of expansions before starting something new. Now, six years later, it’s still quite difficult to understand what actually happened, but we have been so happy to have kept it going so long.\" - they did quite a few millions of copies, didn't they? Is it over 5 or 6 millions now?On their biggest success:\"It has been absolutely fantastic, challenging, tiring, and yet always so rewarding to work on Cities: Skylines. I’m a big believer in continuous improvement and it's at the core of our development process at Colossal Order. I think we all regret our failure to get proper seasons in the game, but it was simply not feasible at the time and we decided to live with the winter maps feature in the Snowfall expansion. The game has evolved immensely over the years with improvements and new content and features, but the absolute biggest success is our relationship with the community, our endless source for inspiration. \"And the very end of the interview:\"What does the future hold for Cities: Skylines? Do you have plans for a follow-up game, or are you looking to continue developing upon the existing base?Cities: Skylines, with its community, is the most important game Colossal Order has created. Beyond that, there isn’t much further we can say at the moment.\"I think these are the most important bits telling us that something most important for companies is and should be - their customers, in C:S case, its community built around the game and the ability to adapt to different needs - they, as they said here (\"We focused on the very basic building blocks: roads, houses, jobs. City services to support the needs of the citizens: health, education, recreation. We wanted there to be as much freedom as possible, ability to create something from the real world.\"), gave us \"templates\", very basic staff to play with, manipulate and mod, so each one of us can enjoy the game in their way. And I think it's pretty safe to say, that's the experience many of us (if not all) were looking for and are enjoying it. CO obviously can see that and it looks like they want to provide that to us. For as long as they can.When creating C:S, after their Cities In Motions games, they had a bit of money, a lot more experience than when they started in 2009, and - I suppose - plenty of ideas. And I think that this game, C:S, was meant to be another stepping stone in their game development. To get some more room (especially financially) to create something even better later in future.Their target of 300 000 copies has been reached very quickly (was it few months or weeks?) and it's pretty safe to say - they have resources now, alongside the experience.Was it a tiny suggestion then, when dropping the name “Colossal Cities”, and not just reference to the company name, that one day there would be “Colossal Cities”? I remember a bit of a rumour at the end of 2019, when last DLC didn't turn up when expected (Sunset Harbour was delayed due to working on trolleybuses and plenty of issues they had with them), that they are working on something giving us much larger maps, to possibly build multi-cities on one map and have plenty of room to do that.Maybe, that's a possibility, and a very pleasant one.There was also news about a planned meeting between CO and major game community contributors, back in 2019, that I suppose took place and no one talks about its outcome - I could imagine that event as a meeting to exchange ideas, problems and issues with current game platform (which, as most of us experienced, is not very suitable for running even a small town with all DLCs on and no mods or workshop assets - which is not what CO would have wanted). What happened with it... well...I am getting the impression that, when they stopped issuing DLCs - nothing for over a year now - but they keep us engaged on their community channel and - I suppose it's CO doing it as well - organizing global build-off competitions, that is all to keep us with them for their next... I'd say product and game.Colossal Cities?Maybe.Although they were successful in replacing SimCity, there is always that limitation - not enough room to let your ideas run free across a map.But as at the same time the game community is very important to them (that's their life line enabling them their as well as ours dreams come true), I'm starting to believe tiny bit more (although it still sounds impossible) that if it is the next game that CO is working on and polishing for us (remember? they have money and time now) , maybe whole workshop and all those assets (I guess excluding mods) would be \"transferable\" to that new game too.\"Do you have plans for a follow-up game, or are you looking to continue developing upon the existing base?\"was the last question, and I'm sure they are very aware of it since years ago now. And do you think, they wouldn't splash few details on what they are working on if it was yet another DLC?\"Cities: Skylines, with its community, is the most important game Colossal Order has created. Beyond that, there isn’t much further we can say at the moment\"was the answer, which screams a lot, although it's still just guessing.What are your thoughts on this interview?",
        "label": "General",
        "title": "Next big thing? ;)"
    },
    {
        "comment": "I am sorry to say that, but after years of complains by many people, something must be told.Cities Skylines is one of the most succesful games for Paradox, in both popularity and revenue, and certainly is the best\\main game for Colossal Order.Yet, this game is totally neglected by the marketing side of things.The game feel lost and abandoned, like Paradox itself does not care about it. All other franchises, even within Paradox pool have a lot of dev diaries, what's next, all that stuff that keep the community active and the interest for the game rolling.Cities Skylines meanwhile get complete radio silence, we don't know if the game is abandoned at this point, if a sequel is in the works, if more DLCs are planned, nothing.I think the CEO at Colossal Order (Marina) should talk more with her publisher guys, because I don't think the dev team (CO) are happy knowing that their biggest game, where they spent years of hard work, the game that made their publisher\\owner a lot fo money, it's being threw in the garbage bin.Maybe you can try to Join SEGA, they really care about their PC strategy games and they costantly promote them with huge marketing campaigns and dev blogs about what's next.I am pretty sure SEGA would be happy to have Colossal Order along with Creative Assembly (Total War) and Amplitude studios (Endless legend), and they will probably give you more budget than what Paradox can do for next titles.",
        "label": "General",
        "title": "Marketing for Cities Skyline is very disappointing...and that's why:"
    },
    {
        "comment": "Hey guys. Since the game is out, it's time to show off your cities!You can use F12 in-game to have steam take a screenshot and send it to your library.I'll get started with my first city. It isn't much yet, but I've mostly been experimenting to get familiar with the interface and buildings.Lets see some beautiful road art! Happy city building!",
        "label": "General",
        "title": "Post your City!"
    },
    {
        "comment": "Because the Hearts of Iron III forum has a thread like this, so why not us. In this thread you post quick questions and receive quick answers.If this grows to a certain length, please use the search function before posting a question in the thread. Thank you.I might as well start myself: can a cim's trip from Point A to Point B have several \"legs\"? That is, can they take the bus to the metro station and then take the metro to their destination?",
        "label": "General",
        "title": "Quick questions, quick answers"
    },
    {
        "comment": "Hi everybody, there are a lot of threads popping up of people asking if their computer meets the required specs. I think it would be easier to make this thread a dedicated area where people can get straight answers on their setups. There are a lot of educated people on this forum so I ask that if you know something about computers, please chip in to the discussion.Specs we need to know:CPUGPU (Video Card)RAMExample (AMD):CPU - AMD FX 6300GPU - AMD RADEON R9 270xRAM - 8GBExample (Intel/Nvidia)CPU - intel I5 4670kGPU - Nvidia Geforce GTX 970RAM - 8GBIf you don't know how to find your specs, this website should help:http://www.systemrequirementslab.com/my-computer-detailsHere are the current requirements for reference:Code:WINDOWS Minimum: \r\n\r\nOS: Microsoft Windows XP/Vista/7/8 \r\nProcessor: 2 GHz Dual core \r\nMemory: 3 GB RAM \r\nGraphics: nVIDIA GeForce 8800, 512 MB RAM or ATI Radeon HD 3850, 512 MB RAM \r\nDirectX: Version 9.0 \r\nNetwork: Broadband Internet connection \r\nHard Drive: 2 GB available space\r\nRecommended: \r\n\r\nOS: Microsoft Windows 7/8 (64-bit) \r\nProcessor: 3 GHz Quad core \r\nMemory: 4 GB RAM \r\nGraphics: nVIDIA GeForce GTX460, 1 GB RAM or AMD Radeon HD 6850, 1 GB RAM \r\nDirectX: Version 9.0 \r\nNetwork: Broadband Internet connection \r\nHard Drive: 2 GB available space\r\n What are the Mac System Requirements?\r\n\r\nMAC/OS X Minimum: \r\n\r\nOS: OSX Snow Leopard 10.6.3 \r\nProcessor: 2 GHz Dual core \r\nMemory: 3 GB RAM \r\nGraphics: nVIDIA GeForce 8800, 512 MB RAM or ATI Radeon HD 3850, 512 MB RAM \r\nNetwork: Broadband Internet connection \r\nHard Drive: 2 GB available space\r\nRecommended: \r\n\r\nOS: OSX Snow Leopard 10.6.3 or later \r\nProcessor: 3 GHz Quad core \r\nMemory: 4 GB RAM \r\nGraphics: nVIDIA GeForce GTX460, 1 GB RAM or AMD Radeon HD 6850, 1 GB RAM \r\nNetwork: Broadband Internet connection \r\nHard Drive: 2 GB available space\r\nWhat are the Linux System Requirements\r\n\r\nLINUX Minimum: \r\n\r\nOS: Ubuntu 12.04 LTS \r\nProcessor: 2 GHz Dual core \r\nMemory: 3 GB RAM \r\nGraphics: nVIDIA GeForce 8800, 512 MB RAM or ATI Radeon HD 3850, 512 MB RAM \r\nNetwork: Broadband Internet connection \r\nHard Drive: 2 GB available space\r\nRecommended: \r\n\r\nOS: Ubuntu 12.04 LTS \r\nProcessor: 3 GHz Quad core \r\nMemory: 4 GB RAM \r\nGraphics: nVIDIA GeForce 8800, 512 MB RAM or ATI Radeon HD 3850, 512 MB RAM \r\nNetwork: Broadband Internet connection \r\nHard Drive: 2 GB available space",
        "label": "General",
        "title": "Post your computer specs here and we will tell you if it meets the required specs!"
    },
    {
        "comment": "San Rico",
        "label": "General",
        "title": "San Rico city !!"
    },
    {
        "comment": "How do I get road names and street names to show?",
        "label": "General",
        "title": "Road Names"
    },
    {
        "comment": "just an observation, anyone have any thoughts as to why this is?",
        "label": "General",
        "title": "despite $209 dollars of content it takes a mod to make traffic behave realistically"
    },
    {
        "comment": "If you guys are willing to see what suggestions I have if you guys are making a new cities skylines game watch this youtube video it has a lot of good suggestions please.and a another suggestion is I think it would be cool if the game would allow you to specifically indicate the types of houses that you want in an area before zoning (building mansions in a predominately wealthy district). one last thing,  It would be nice if all buildings to have a basement level, so buildings could be placed on slopes without needing a perfectly flat footprint. Slopes would just gradually reveal the basement level and you can customize and build and design certain buildings yourself like a airport or a train station and one last thing,  It would be nice if all buildings to have a basement level, so buildings could be placed on slopes without needing a perfectly flat footprint. Slopes would just gradually reveal the basement level and you can customize and build and design certain buildings yourself like a airport or a train station.",
        "label": "General",
        "title": "Cities skylines 2 suggestions"
    },
    {
        "comment": "I sincerely hope that CS II runs cleaner/faster than the current version. That said, I would really appreciate some tips from other CS gamers on what I could do to improve my experience with the game. I've got about 1,242 hours invested in the game. It is my favorite game. That said, I have a major complaint:It seems to be a memory hog and a CPU crusher. Even an empty map in the Map Editor takes 5 minutes to load.I have a beast of a machine: 32 GB RAM, 5 ghz AMD 8-core CPU, 2080ti graphics card. That's why my post title facetiously mentions the Cray II supercomputer as a recommended hardware. I don't run any background utilities or other programs. Is Steam also hogging resources? CS is a jealous lover of RAM.One BIG complaint: you can be going along, doing whatever in CS, when you suddenly notice the game freezing up. Then you realize it's only the autosave function. Problem is, sometimes the game getspermanentlylocked up because you were laying down a road or whatever while it was \"packaging\" the work you were doing. Usually, the lockup turns into a hard shutdown (Ctrl-Alt-Del doesn't work) of the machine.I had to get this off my chest. But please, give me some useful tips or things I may have missed, because I really love this game.",
        "label": "General",
        "title": "CS Needs A Cray II To Run Smoothly"
    },
    {
        "comment": "Hi All,I have main game on Steam, but would like to buy DLCs on Epic Games. I have both accounts linked on paradox site. Will it work?Best regards",
        "label": "General",
        "title": "Base game and DLCs on different platforms? (Steam/Epic Games)"
    },
    {
        "comment": "Hello,I have been playing CSL for a while now, and recently I wanted to record some of my builds.I am familiar with OBS, and I used the following settings: 1920 x 1080 and 60 FPS. I was lagging a bit here, so it doesn't look like 60 FPS.But still the video quality itself looks pretty crap.My specs:Processor    Intel(R) Core(TM) i7-9750H CPU @ 2.60GHz   2.59 GHzGeïnstalleerd RAM-geheugen    16,0 GB (15,9 GB beschikbaar)Type systeem    64-bits besturingssysteem, x64-processorVideo card nvidia geforce gtx 1660 ti with max-q designWith these specs I should be able to properly record a game like Cities Skylines.What am I doing wrong?",
        "label": "General",
        "title": "How to record gameplay with OBS?"
    },
    {
        "comment": "At PDXCON, there were esoteric assurances by the team, \"we are working on something\".  It's reasonable to suppose they want to improve the game, and the ideas are all to big and game breaking to just be DLC.What big new ideas would you like to see in CS2?  Do you agree the game vision / \"game pillars\" will be \"locked in\" soon? Personally I love the game as it stands, but it would definitely benefit from a twist or two - here's a few to get started -1. Place city development in an historical timeline. For example, have cities 'start' in 1945, right after WW2 as new green-fields cities, or from ruins of existing cities.  They might have existing monuments, buildings etc from prior centuries. This opens up many options eg Euro vs US vs elsewhere city types.2. Introduce a 'tech tree' and addstoryto the progression through utiltiies and transportation tech.  Allows for real transition challenge, from profitable fossil fuel city, to green city.  Link/limit the available tech/progress to the design focus, industry types and economic success (or otherwise) of the city.3. In same theme, how aboutarchitectural tech. New design techs in buildings of all zone types could evolve over time, ie suburbs/towns should look like the era they were designed in - until there's an \"urban renewal\".  Unless they are 'heritage protected'!4. Transportation - allow development of pedestrian/cycle access-only residential / commercial.  Maybe this is something that needs 'zoned roads' ie only allows commercial/industrial access.5. National government / world events and impact - focussed incentives like 'national freeway initiative', military bases, money for the arts, space centre.  These might need some way of ranking your city in various ways, with a \"political points\" system, ie not just funds?Thoughts?Inspired in part by:[edit] dammit I just realised another like minded soul already posted the topic.  I'm leaving it here anyway - enjoy!",
        "label": "General",
        "title": "Cities Skylines 2?"
    },
    {
        "comment": "So I purchased quite a bit of DLC for Cities: Skylines when it was available on Origin. It says \"Unlocked\" on the origin launcher but how do I gain access to the DLC since Skylines is no longer available on Origin. Or am I just screwed.",
        "label": "General",
        "title": "What to do with my Skylines DLC on Origin"
    },
    {
        "comment": "Hi, I'm getting this error when I try to start the game:Crash folder is down below",
        "label": "Bug",
        "title": "Game crashing on launch"
    },
    {
        "comment": "Describe your issueGame will not launch from Paradox launcher (Mac, Steam)What is your game version?urrent Steam versionWhat expansions do you have installed?(DID NOT ANSWER QUESTION)What mods are you using?problem occurs and recurs even with mods disabledPlease explain your issue is in as much detail as possible.Can you replicate the issue? If yes, please explain how you did it.It happens every time I try to launch the game from the Paradox LauncherAttachmentsFile(s) attached",
        "label": "Bug",
        "title": "Cities: Skylines (Steam) - Game will not launch from Paradox launcher (Mac, Steam)"
    },
    {
        "comment": "Describe your issueCity Skylines Not Loading on MacWhat is your game version?No clue.  Cannot access the game.  Should be latest version.What expansions do you have installed?(DID NOT ANSWER QUESTION)What mods are you using?NonePlease explain your issue is in as much detail as possible.Updated Steam today.  Paradox launcher version 2021.5.2.  Play or resume launches the game but nothing loads; just a black screen with cursor pinwheeling.  Force quit (application not responding) required to exit the game.This is the same issue that has been reported multiple times already on this forum.Can you replicate the issue? If yes, please explain how you did it.Yes, every time I launch the game from the Paradox launcher.AttachmentsFile(s) attached",
        "label": "Bug",
        "title": "Cities: Skylines (Steam) - City Skylines Not Loading on Mac"
    },
    {
        "comment": "Describe your issueCities Skylines crashes my PCWhat is your game version?Not SureWhat expansions do you have installed?(DID NOT ANSWER QUESTION)What mods are you using?NonePlease explain your issue is in as much detail as possible.Bought this game a few years ago, but never had the chance to really get into it. Back then I was able to play for a little while without any issues at all.Now I have a relatively new PC build, and I want to spend some time playing this game, but it will crash my pc into a full restart whenever I play.This is just a vanilla build of the game, no mods or anything else installed.About a week ago it would crash after about 10 minutes of play, so I did some research and tried adding the -force-d3d9 into the launch options settings, and that seemed to fix it for a little bit, as I was able to play for about 20 minutes, and then saved and quit the game. But now it will crash within 5 seconds of the map loading. And by crash I mean that the entire PC just reboots, no errors or anything. That was making me think it was overheating, but I have downloaded speccy and I am watching the temps when it crashes, and the GPU is only at 45-50 deg, and the CPU is less than 40 deg. I also set up a rather aggressive fan speed profile in EVGA Precision X1. I am not sure what to think, as I can play Microsoft Flight Sim without any issues for as long as I want, and even in VR and it still has no problems. I was also able to play Half Life Alyx for a few hours without any problems either.My current PC specs (with current temps) are:Gigabyte Z390 Aorus Pro Wifi (35C)Core i9 9900K @ 3.6 ghz (36C)64GB Corsair VengeanceEVGA 2070 RTX Super (42C)Corsair 850w PSUCities Skylines has been installed on both a NVME drive and a SSD drive.Any thoughts or suggestions are greatly appreciated. If there is anything else I can provide let me know. All of my drivers are also up to date.I wish I could attach some sort of error log, but none are created. The screenshot is useless, but necessary to submit my request for help.Can you replicate the issue? If yes, please explain how you did it.Yes, just by starting the game.AttachmentsFile(s) attached",
        "label": "Bug",
        "title": "Cities: Skylines (Steam) - Cities Skylines crashes my PC"
    },
    {
        "comment": "Describe your issueCities Skylines can't launch from Steam (Mac)What is your game version?Downloaded from Steam on June 8, 2021What expansions do you have installed?After Dark, Snowfall, Mass Transit, Industries, Sunset HarborWhat mods are you using?NoPlease explain your issue is in as much detail as possible.Black screen after clicking the PLAY button from Steam. Before a Steam update on June 8, 2021 it was OK, but after the update it fails to start the game. I can run other Paradox games from Steam though.Can you replicate the issue? If yes, please explain how you did it.Yes, Cities Skylines just won't start every time I try.AttachmentsFile(s) attached",
        "label": "Bug",
        "title": "Cities: Skylines (Steam) - Cities Skylines can't launch from Steam (Mac)"
    },
    {
        "comment": "Describe your issueCities: Skylines fails to launch on Mac (error: launching game failed)What is your game version?2021.5.2What expansions do you have installed?(DID NOT ANSWER QUESTION)What mods are you using?none.Please explain your issue is in as much detail as possible.Brand new steam user, brand new paradox game user.  Fresh install on Mac OS Big Sur 11.4).  When I launch Cities: Skylines, I get the error next to a red triangle by the start buttonCan you replicate the issue? If yes, please explain how you did it.yes.  happens whenever I launch the game.AttachmentsFile(s) attached",
        "label": "Bug",
        "title": "Cities: Skylines (Steam) - Cities: Skylines fails to launch on Mac (error: launching game failed)"
    },
    {
        "comment": "Describe your issueSimulation error as well as a crash at the very end of loading a city inWhat is your game version?1.13.3-f9-steam-winWhat expansions do you have installed?What mods are you using?Multiple (see log file) although some are needed in order to load the city normally.Please explain your issue is in as much detail as possible.I left a city to load in whilst I was AFK and it decided to give a crash message with a folder reference. I had a quick look in the resulting log and it had also given a simulation error relating to numbers. This city normally loads in without issue (I have attached the city CRP file)Can you replicate the issue? If yes, please explain how you did it.Unknown as this is the first time it has done this particular sequence of events.AttachmentsFile(s) attached",
        "label": "Bug",
        "title": "Cities: Skylines (Steam) - Simulation error as well as a crash at the very end of loading a city in"
    },
    {
        "comment": "Describe your issueCrime bug Fluctuates between 7% and 230%What is your game version?1.13.3What expansions do you have installed?After Dark, Mass Transit, Parklife, Industries, CampusWhat mods are you using?Hard ModeUnlimited MoneyUnlimited Oil And OreUnlimited SoilUnlock AllNetwork Extensions 2Automatic Bulldoze v2BargesNode Controller Renewal 3.0.4.1Enhanced Outside Connections ViewUnified UI 1.0Picker 1.6.0Intersection Marking Tool 1.7.3.1[BETA] Quay Upgrade Tool 0.3.0-devHarmony 2.0.4-4Auto RepairAutomatic Pedestrian Bridge2.0Lifecycle Rebalance Revisited 1.5.4RM Unconnected TracksRM Crossings 3.0Klyte's Fine Road Tool 2.0.4Klyte's Fine Road Anarchy 2.0.2Campus ParksToggle It!Network SkinsBuilding Theme: University CityMore Effective Transfer ManagerUltimate Level Of DetailSmart Intersection BuilderSkip IntroForest BrushTME 11.5.2 STABLERoundabout BuilderMove It 2.9.2Resize It!Achieve It![BETA] Parallel Road Tool 2.0.4-devTouch This! Tool 4Parkify r1.0.5Tree LOD FixRelightSort Mod SettingsCSL Map ViewImproved Content ManagerSharp TexturesCinematic Camera Extended 0.5.1ShadowStrengthAdjusterShip Path AnarchyProp Line ToolSurface PainterUltimate Eyecandy 1.5.2Loading Screen ModFirst Person CameraQuay AnarchyProp & Tree Anarchy activated81 Tiles (Fixed for C:S 1.2+)Prefab HookMore Network StuffExtra Landscaping ToolsBuilding ThemesProp SnappingTrain ConverterAdvanced Vehicle Options 1.9.4Network TilingVehicle Effects 1.9.1Find It! 2.5.1Custom Effect LoaderExtra Train Station TracksPollutionRemoverModZoning toolset (toggle + upgrade tool)Environment ChangerImproved Public Transport 2 [r5.0.3]Unlock All + Wonders & LandmarksPrecision EngineeringPlease explain your issue is in as much detail as possible.Two hours after starting a new map, the crime level bugs out and start to jumps in five seconds between 13 and 240 randomlyI deleted all the mods one by one and it didn't solve the problemI even uninstalled the game and downloaded it again, but nothing workedI started a new city and the problem comes back automaticallyI used PollutionRemoverMod to clean up the crime and it didn't workI don't know what the solution is, I can't advance with any map and I'm tired of this endless thingCan you replicate the issue? If yes, please explain how you did it.NOAttachmentsFile(s) attached",
        "label": "Bug",
        "title": "Cities: Skylines (Steam) - Crime bug Fluctuates between 7% and 230%"
    },
    {
        "comment": "Describe your issueFATAL ERROR IN GCWhat is your game version?1.13.3-f9What expansions do you have installed?After Dark, Snowfall, Natural Disasters, Mass Transit, Green Cities, Parklife, Industries, Campus, Sunset HarborWhat mods are you using?MOVE IT 2.9.2TME 11.5.2 STABLEEXTRA LANDSCAPING TOOLSPRECISION ENGINEERINGFINE ROAD ANARCHY 2.0.2FINE ROAD TOOLS 2.0.4Please explain your issue is in as much detail as possible.Every time I start the game after a few minutes I get this error (FATAL ERROR IN GC), in game, game menu or options menu.Can you replicate the issue? If yes, please explain how you did it.Even with the MODS uninstalled, the problem remains.AttachmentsFile(s) attached",
        "label": "Bug",
        "title": "Cities: Skylines (Steam) - FATAL ERROR IN GC"
    },
    {
        "comment": "Describe your issueMonorail curve node fails to display on certain angle.What is your game version?1.13.3-f9What expansions do you have installed?What mods are you using?nonePlease explain your issue is in as much detail as possible.Curved nodes are not displayed as it supposed to be in certain angle. Looks like it usually happens when those are at near of boundary of screen. See attached screenshots.Can you replicate the issue? If yes, please explain how you did it.Try to adjust angle near curved node of monorail. Seems like it is easier to see when in free camera mode.AttachmentsFile(s) attached",
        "label": "Bug",
        "title": "Cities: Skylines (Steam) - Monorail curve node fails to display on certain angle."
    },
    {
        "comment": "Describe your issueOne platform at upper level of Metro Plaza from Train Station pack is not workingWhat is your game version?1.13.3-f9 C:S - Train Stations ExpansionWhat expansions do you have installed?After Dark, Snowfall, Natural Disasters, Mass Transit, Green Cities, Parklife, Industries, Campus, Sunset HarborWhat mods are you using?CSL Music Mod (ID=18446744073709551615)                     activatedHard Mode (ID=18446744073709551615)                         deactivatedUnlimited Money (ID=18446744073709551615)                   deactivatedUnlimited Oil And Ore (ID=18446744073709551615)             activatedUnlimited Soil (ID=18446744073709551615)                    activatedUnlock All (ID=18446744073709551615)                        activatedCompass Mod (ID=420469721)                                  activatedCash on Demand (ID=409171141)                               activatedExtra Landscaping Tools (ID=502750307)                      activatedNo Deathcare (ID=803074771)                                 activatedNo Border Limit Camera (ID=446764406)                       activatedCrossTheLine (ID=498386331)                                 activatedPrecision Engineering (ID=445589127)                        activated25 Spaces (ID=403798635)                                    activatedEnable Achievements (ID=407055819)                          activatedDemand Master (ID=409776678)                                activatedProp Snapping (ID=787611845)                                activatedNetwork Tiling (ID=1274199764)                              activatedProp & Tree Anarchy (ID=593588108)                          activatedProp Precision 1.0.1 (ID=791221322)                         activatedMore Beautification (ID=505480567)                          activatedProp Line Tool (ID=694512541)                               activatedClouds & Fog Toggler (ID=523824395)                         activatedSim City (2013) Music Pack (ID=634216395)                   activatedSim City Societies Music Pack (ID=638395703)                activatedSim City 4 Music Pack (ID=633993845)                        activatedSim City 3000 Music Pack (ID=634046315)                     activatedSim City 2000 Music Pack (ID=634143359)                     activatedMusic pack: Soviet Music Pack (ID=1111498300)               activatedCSL Show More Limits (ID=531738447)                         activatedDynamic Resolution (ID=812713438)                           activatedNo Park Building Fires (ID=1718245521)                      activatedSeniorCitizenCenterMod (ID=554232266)                       activatedAdvanced Stop Selection (ID=1394468624)                     activatedFirst Person Camera (ID=650805785)                          activatedControl Building Level Up (ID=1403136223)                   deactivatedThe Sims 3 Music Pack (ID=1295091678)                       activatedFavorite Cims v0.3.2 (ID=426460372)                         activatedCSLMoreGraphs (ID=577851220)                                activatedNetwork Extensions 2 (ID=812125426)                         activatedTicket Price Customizer (ID=1393820309)                     activatedPrefab Hook (ID=530771650)                                  deactivatedMore Network Stuff (ID=512314255)                           deactivatedCSL Map View (ID=845665815)                                 activatedModTools (ID=450877484)                                     deactivatedMove It 2.9.2 (ID=1619685021)                               activatedSpawn/Unspawn Positions Swapper (ID=538019888)              activatedUnlimitedOutsideConnections (ID=497033453)                  activatedUltimate Level Of Detail (ID=1680642819)                    activatedFind It! 2.5.1 (ID=2133885971)                              activatedNode Controller Renewal 3.0.4.1 (ID=2472062376)             activatedIntersection Marking Tool 1.7.3.1 (ID=2140418403)           activatedHarmony 2.0.4-4 (ID=2040656402)                             activatedTM: PE 11.5.2 STABLE (ID=1637663252)                         activatedEnhanced Outside Connections View (ID=2368396560)           activatedAutomatic Bulldoze (v3.0.7406.37321) (ID=2057780822)        deactivatedPlease explain your issue is in as much detail as possible.After building up the Metro Plaza Station and connecting the lines, I notice one of the outer platforms at upper level never gets used by passengers. It should be the platform closest to the building's road access (I will mark the problematic platform in screenshot).If I switch the line's stop from the outer platform to the inner platform, the line will work just fine. If I switch the stop to the other two platforms on the upper level, it will work fine too.The map I used is Desert Oasis. I cannot tell if this is in any way related, since I tried with some other maps and all platforms work fine (and I can't tell if they will always work). I created the first test city with Desert Oasis which reproduced this issue; then I created other test cities with Desert Oasis and there is no issue. Either way it's with the same set of mods. I also tried launching with -disableMods or -noWorkshop, but the issue persists.I suspected the placement/location of the Metro Plaza might impact it but I am probably wrong. If the issue exists in a particular save, it seems to persist no matter where the station is placed (even bulldozed and rebuilt in a different location, with lines deleted and redrawn). If the station works fine in a savegame, there should be no problem even if the station is placed in a location where I saw problems in another save.If you can work with the savegame I provided that would be great. The savegame should be able to load without any mods enabled. To test the savegame, you can try disconnecting the road between the residential area and the Metro Plaza, and/or deleting Bus Line 3. You should notice citizens take the bus/use their cars to travel to the commercial district or go to work, but they never take Metro Line 1 unless the stop is moved to a different platform. Nevertheless, Metro Line 2 works fine as long as you don't put the stop at the problematic platform.Can you replicate the issue? If yes, please explain how you did it.It's complicated. I first noticed the behavior on my main city (which is using Desert Oasis), then I created a couple test cities (not using Desert Oasis) and did not observe this issue. I created a test city with Desert Oasis and had the issue again, but that is the only time I am able to reproduce the issue. I did create other test cities with Desert Oasis and they all worked fine.AttachmentsFile(s) attached",
        "label": "Bug",
        "title": "Cities: Skylines (Steam) - One platform at upper level of Metro Plaza from Train Station pack is not working"
    },
    {
        "comment": "Describe your issueaudio problemWhat is your game version?What expansions do you have installed?What mods are you using?nonePlease explain your issue is in as much detail as possible.i have no audio in the game. i checked everything, the mixer in win 10 and the settings in the game, i j=hears the audio once but it was laggy as hell.Can you replicate the issue? If yes, please explain how you did it.i did nothing.....AttachmentsFile(s) attached",
        "label": "Bug",
        "title": "Cities: Skylines (Steam) - audio problem"
    },
    {
        "comment": "Hello!Game randomly crashed (may be 5 min, may be 45 min).I try clean reinstall, with system upgrade - clean install w10, try update using mods and delete not actual.Archive contains all the necessary files for review.What will be the solutions to the problem?(Sorry for my English, I'm Russian)",
        "label": "Bug",
        "title": "Cities Skylines randomly crash"
    },
    {
        "comment": "Describe your issue1440p UI resolution not scaling correctlyWhat is your game version?1.13.3-f9What expansions do you have installed?After Dark, Snowfall, Natural Disasters, Mass TransitWhat mods are you using?NonePlease explain your issue is in as much detail as possible.I have noticed that when I try to play CS on my main monitor, which is 1440p, that the resolution of the UI is poor, and results in very blurry text and features.I have tested this by also playing CS on my second monitor, which is 1080p, and sure enough this issue does not occur; it seems as if at 1080p the UI is properly scaled to the selected resolution. Moreover, I have also tried changing the resolution to 1080p whilst playing the game on my primary 1440p monitor, and noticed 0 difference, leading me to conclude that despite supposedly showing a 1440p image, the game is still actually showing the UI at 1080p, even when 1440p is selected in my settings (triple checked this) and when on a monitor of the appropriate resolution.I have even tried hooking my PC up to my 4K TV, and even then it manages to scale the UI correctly. It seems as if when on a 1080p and 4k screen (with the matching resolution selected) there are no issues, but the moment I go to 1440p on a 1440p screen, the UI appears to still be the same as a 1080p resolution. Screenshots are shown below. I recommend viewing them on atleast a 1440p monitor otherwise you will not be able to see the effect.This is a completely fresh CS install with no mods and no files left over from previous installs of the game. I have no issues with UI scaling to 1440p on any other game.Attached files include pictures of the main menu, as well as 2 ingame screencaps, one set for a selected 1440p, and another set for a selected 1080p resolution, all taken on my 1440p monitor, highlighting the fact that the UI appears unchanged, and is equally blurry regardless of selected resolution.Can you replicate the issue? If yes, please explain how you did it.Details mentioned in the above section.AttachmentsFile(s) attached",
        "label": "Bug",
        "title": "Cities: Skylines (Steam) - 1440p UI resolution not scaling correctly"
    },
    {
        "comment": "Describe your issueCities Skylines crashingWhat is your game version?1.13.3-f9What expansions do you have installed?(DID NOT ANSWER QUESTION)What mods are you using?81 Tiles (Fixed for 1.2+)Automatic Pedestrian Bridge Builder V2.0 [Beta]Fine Road Anarchy 2.0.2Fine Road Tools 2.0.4Harmony 2.0.4-4 (Mod Dependency)Hide TMPE crosswalks V3.0 [stable]Move ItNode Controller Renewal 3.0.4Roundabout BuilderTME V11 STABLE (Traffic Manager: President Edition)Undo It!Please explain your issue is in as much detail as possible.The game is freezing for 10-30 seconds and then crash to desktop when saving the city.I have not experienced this without mods.I have checked the mod incompatibility list and none of the mods I'm using are present there.There is a null reference exception in the main log file but no indication that the call trace is originating in a mod.The are no relevant errors that I can see in the mod logs.Can you replicate the issue? If yes, please explain how you did it.AttachmentsFile(s) attached",
        "label": "Bug",
        "title": "Cities: Skylines (Steam) - Cities Skylines crashing [Linux]"
    },
    {
        "comment": "Hi guys, I just installed Cities Skylines after a few years away from the game. I'm running macOS 11.3.1 and the most recent version of steam. When I click 'play' the game will not launch. No error messages, nothing happens. I've been through the forums and followed the advice I've seen.I've done another clean install of Cities Skylines.I've removed the associated files in:~/Library/Application Support/Steam/SteamApps/common/Cities_Skylines/~/Library/Application Support/Steam/userdata/<SteamID>/255710/~/Library/Application Support/Steam/SteamApps/workshop/content/255710/~/Library/Application Support/Colossal Order/Cities_Skylines/Then did a clean install of steam, and another clean install of Cities Skylines.The game still won't start.Any tips? Thanks!",
        "label": "Bug",
        "title": "Cities Skylines not launching in steam, running macOS 11 (Big Sur)"
    },
    {
        "comment": "Describe your issueCities Skylines not launching in steam, running macOS 11 (Big Sur)What is your game version?What expansions do you have installed?Mass TransitWhat mods are you using?NonePlease explain your issue is in as much detail as possible.Hi guys, I just installed Cities Skylines after a few years away from the game. I'm running macOS 11.3.1 and the most recent version of steam. When I click 'play' the game will not launch. No error messages, nothing happens. I've been through the forums and followed the advice I've seen.I've done another clean install of Cities Skylines.I've removed the associated files in:~/Library/Application Support/Steam/SteamApps/common/Cities_Skylines/~/Library/Application Support/Steam/userdata/<SteamID>/255710/~/Library/Application Support/Steam/SteamApps/workshop/content/255710/~/Library/Application Support/Colossal Order/Cities_Skylines/Then did a clean install of steam, and another clean install of Cities Skylines.The game still won't start.Any tips? Thanks!Can you replicate the issue? If yes, please explain how you did it.AttachmentsFile(s) attached",
        "label": "Bug",
        "title": "Cities: Skylines (Steam) - Cities Skylines not launching in steam, running macOS 11 (Big Sur)"
    },
    {
        "comment": "Describe your issueCity Skyline game crashedWhat is your game version?1.13.3-f9What expansions do you have installed?Mass Transit, Industries, Sunset HarborWhat mods are you using?Please explain your issue is in as much detail as possible.I have tried \"-noWorkshop\" as launch options but didn't work. I can launch the game on my Macbook Air though it was quite slow.I have also followed the advice to \"Verify Integrity of Game Files\", but didn't help fix this issue. This is the first time I have installed this game on my HP laptop and the OS version is Windows 10.Can you replicate the issue? If yes, please explain how you did it.AttachmentsFile(s) attached",
        "label": "Bug",
        "title": "Cities: Skylines (Steam) - City Skyline game crashed"
    },
    {
        "comment": "Describe your issueGame constantly crushing when Loading Temperate Themed MapsWhat is your game version?1.13.3-f9What expansions do you have installed?After Dark, Snowfall, Natural Disasters, Mass Transit, Green Cities, Parklife, Industries, Campus, Sunset HarborWhat mods are you using?Loading screen, Mini FPS BoosterPlease explain your issue is in as much detail as possible.Whenever I try to load any maps / scenarios from Temperate Theme, the game is crushing to desktop giving error. Its happening during loading the \"SunnyPrefab\" as per loading screen mod. RAM usage 2.4 GB / 16 GB then.Can you replicate the issue? If yes, please explain how you did it.Yes I can replicate the issue every time I try to load any map from Temperate ThemeAttachmentsFile(s) attached",
        "label": "Bug",
        "title": "Cities: Skylines (Steam) - Game constantly crushing when Loading Temperate Themed Maps"
    },
    {
        "comment": "Hi there, I'm in a bit of a pickle. I can't seem to save games no matter what the situation is. I have tried everything I can find. I've disabled and unsubscribed from all mods, uninstalled and reinstalled the game, but whenever I attempt to save the only thing I get is a temporary CSS file in AppData, but no .crp file.I really do not know why this is happening or what I need to do to fix it, but it needs to be fixed. I'm tired of restarting.",
        "label": "Bug",
        "title": "Unable to Save Games"
    },
    {
        "comment": "I was playing as a Vengeful character and, after winning a fairly challenging civil war, I felt that a Vengeful character would lose stress by punishing (through title revocation, torture or execution) anyone who had rebelled against him and nearly cost him his Empire title. He also possessed the Generous trait, which caused stress gain while revoking titles. I'd imagine a person with these conflicting traits not gaining quite so much stress in the process. I've noticed events where opposing traits seem to balance each other out and this seemed like the sort of situation where that would make sense.",
        "label": "Feature",
        "title": "Vengeful Trait Stress Loss"
    },
    {
        "comment": "So assuming that there is a Cities: Skylines 2 in the works somewhere I thought it would be great to have community suggestions  and input into what form that it takes.  I've read somewhere that there is talk of introducing countries or something but that doesn't especially interest me.  It would be great if Colossal / Paradox setup some sort of user voice forum where people could submit suggestions and vote on them to help shape the new game.  If anyone knows of such a thing please let me know - I've not been able to find it.Barring that I thought I might use the forums here to at least submit some of my thoughts.  Now some of this might be included in mods available but  this is what I would like to see added to the base (un-modded) game.Roads/Network/TrafficEnable PROPER MERGING LANES like those you might find in real life, with various options for lane markings like you might find.Customisable road builder available in game, allow the creation of custom roads in game specifying number of lanes in each direction, with each lane being able to be of a different type sidewalk, car, bike, bus, tram and allow the addition of regular props along the way, trees, lights, signs, post boxes, seating.  Allow these to be created as presets that you can save to use in your city.Improved Traffic AI that lets cars change lanes anywhere and not just on nodes but also makes better use of multi-lane roads instead of queueing up in one lane the whole way.Allow trams to return without needing a roundabout!!!  In fact can you bring this into the current game also - this is ridiculous.Include some basic features from Traffic Manager mod such adding Give Way/Stop/Through, adding and removing stop lights and setting which lanes can turn or go straight (I know that you can add and remove stop lights and stop signs in game currently but the UI for that is awful).Include a net picker so piece of network on the map can be selected and then used to lay down more of that network.  (Yes I know there is a mod for this - build it into the game!  So handy.)Include a basic roundabout builder that can select the type of road to be used and size.  Roundabouts are fundamental and building them should be part of the base game.  Doesn't need all the bells and whistles of the mod as long as it can still be enhanced in a mod.InfrastructureAllow power networks to be created underground similar to water pipes.Remove the power zone created around structures and introduce overhead street power lines instead that can then be replaced with underground power networks  as a later unlock.  More like real life city planning considerations.Add data networks to the game so that internet cabling and 3G, 4G 5G towers can be added potentially onto existing building structures.  Make data networks improve happiness of people and efficiency of businesses.GraphicsImprove the graphics engine to allow even greater detail - Unreal Engine 5 anyone?The more the game looks like a real city the better!AssetsAllow assets to be stretchable to match (to a certain extent) the curve of the road.  This might leave the building unchanged but stretch the garden/outdoor (Fencing/hedges) area to stretch bed around the road, creating less gaps between assets, or allow all or part of a structure to flex a certain amount to the curve.  This would create more realistic blocks where there is no no-man's land like there is in the game now.Introduce the concept of seasons and allow Assets to have different appearances based on seasons, particularly trees & vegetation.  Maybe the option to have snow or not on other assets.Allow some assets particularly train stations to be placed without being connected to a road or to connect onto an existing train line instead!!!Currently if I want a station to line up to a rail network I need to guess where the rail bit of the station will be and create a road in about the right place to put the station then hope that the rail lines up nicely.Ability to have more rounded assets and structuresFind It mod built in.Ploppable RICO built in.TerraformingImprove the UI to smooth terrain, perhaps be able to paint an area and then have it smooth it out to the edges or surrounding roads.Allow placement of Trees and vegetation on steep slopesBe able to paint an area or brush with a combination of vegetation, select a mix of tree, plant or rock assets adjust the % of each and have the game randomly place these assets in the area in the desired concentrations.Paintable pavement and other surfaces that can optionally be bordered by roads or structures (rather than plopping down odd shapes to try and fit).  Have these surfaces be able to crop the vegetation underneath.  (I hate seeing the grass come through an outdoor pool asset - very annoying.)More tools to make more natural looking terrain like water courses and cliffs would be nice - I'm not sure how what exactly here, I just know that I find this a challenge.AudioAllow music to be pulled from playlists in Google Play Music or Spotify.  Allow the option to insert the in game adds in between these tracks through.I grow tired  of the ones in game and I find it somewhat objectionable to buy music packs that have a few more songs that I'm not that keen on either.MORE in game radio adverts!  These are awesome but there needs to be more!Can this be modded or become assets that the community can add into the game also?Other features:Asset and mod profiles - allow the game to be started up with different sets of mods and assets available as presets defined by the player to play the game in different styles.  Or make these presets shareable also in the community so that people can start with recommended packs from community members.Challenge mode - I really enjoyed the community challenges that Biffa put out for biggest city in 30 mins and worst traffic, it would be great if these challenges could somehow be defined and then posted out to the community to attempt with all the appropriate restrictions in place.EDIT: Almost forgot 81 tiles in the base game, & perhaps with option to go larger if resources permit.Anyhow I think there's a few other things that I've though about while playing the game that I've forgotten to include in here.  Mostly I just want more/better of the same game - not too dramatically different from the present game, if significant new features are added that take the game in a whole new direction then they need to be done as options so that the people who have come to love this game for what it is can continue to do so.Finally I would love to hear what others think of this list of mine and especially if you too would like to see a feature list / suggestions site that can take community votes on each feature like the Microsoft User Voice or other software companies use.What other features would you like to see that I have not thought of or included here?",
        "label": "Feature",
        "title": "Cities: Skylines 2 - Wishlist"
    },
    {
        "comment": "Can we get at least one fish warehouse added to \"Sunset Harbor\"?",
        "label": "Feature",
        "title": "Fish warehouse"
    },
    {
        "comment": "As someone who lives near rural areas and loves building rural zones in my cities I always find it odd that I need to connect water to far flung areas that in reality would probably just have septic tanks and wells. Especially camp grounds!On the topic of campgrounds. Cottages are also very common and do not always come with water or electricity but are still fine. I'd kill to be able to put some down without having to build septic and powerlines to them. Just like back home! Sure they wont be very valuable without those amenities but they still make do.Finally energy independent zones might be a later unlock but solar houses off the grid are a real thing and are becoming more common. Having a zone option to put solar on tons of roofs would be not only gorgeous from a birdseye view but also modern and realistic for rural areas.So i'd love to have a new zoning style for these.",
        "label": "Feature",
        "title": "Independent septic zone, energy independant zone, and cottage zone."
    },
    {
        "comment": "I hope the game developers will read the suggestion.My suggestions to improve the game are:- Incorporate 81 tiles and unlimited outside connections mod into the game, which is nicer as there will be more road and train connections instead of just 4.-  Better Water Service Buildings( In Land Water Pumping Station, Large In Land Water Pumping Station) since we got in land water treatment plant in sunset harbor.- Improve farming mechanics ( have more farming buildings such as chicken coop, grape vineyard, orchard).-Regional play similar to Simcity 4                                                                                                                                                                                                - More Power Plants ( Natural Gas which is more environmentally friendly than Coal and Oil, Microwave)- More Education Facilities ( Community Colleges, Private Schools, Large Elementary and Large High Schools)- Have a new category government buildings by moving some buildings (City Hall, Courthouse, Government Offices, Tax Office, Oppression Office, Servicing Services Office, Transport Tower). In additional, more government buildings- Have a new category for religious buildings via some unique buildings ( Temple Complex, Cathedral)- More Police Buildings ( Crime Prevention Centres, Detective Offices)- Better Healthcare Buildings ( Vet, Surgery Centre, Doctor's Office, Dentist, Wellness Centre)- Better fire buildings (Hazmat Buildings which is useful in the event of industrial accidents).- A movie studio, a radio station to turn the city into an entertainment hub- A better television studio with new vehicles that are: news van and news helicopter- MyCim Mode similar to Simcity 4, allow the player to interact with Cims in the city- Manufacturing and High Tech Industry Specialization- Farmer's Market to sell goods from farming industry areas and farming specialization industry, directly to consumers, can bring tourists, boosting the health of the city.- UDriveIt feature similar to SC4.- New Park Areas (Water Park, Safari Park, Country Fair which is a rural version of an amusement park)- More types of casinos that cater to tourists of different wealth- Wealth zones, which is a must as it will determine many things for Cims living in the city such as the type of education they received, the mode of transportation which they prefer.- Increase the game limits an absolute must.- Increase the population cap so the city can house tens of millions.- Better disaster management with TV masts that can warn cims in additional to radio masts.- More natural disasters such as ( Volcano, Hurricane).- More events such as (train derailment because of poor maintenance of rail, potholes appearing on roads if roads are not maintained well, radiation leak if nuclear power plant meltdown).- Arcology which can house a lot of people- Park and ride can be put next to metro stations, bus stations, monorail stations, ferry terminals.- Car and passenger ferry terminals, transporting both car and passengers across water channels, since the ferry terminals from the mass transit DLC are for passenger use only.- Medium and high density industrial- Better security( Private security, Border Security, Public Transport Security, Airport Security)- Police and fire boats",
        "label": "Feature",
        "title": "Suggestions After Train Stations, Bridges and Piers"
    },
    {
        "comment": "Hello Paradox.I have a suggestion. My current iPhone and iPad  has a better CPU and Graphics then my laptop. (I know this from geekbench) And my laptop can run cities Skylines. So, Why can’t my iPhone or iPad? Civilization 6 is on my iPhone and it runs great. People from the PC community say that it won’t work because people want modding support. I will tell you the opposite is true on iOS because on Xbox you can’t mod. And with the A12x processor in the iPad pros, they could no doubt run cities Skylines.",
        "label": "Feature",
        "title": "Cities: Skylines for iPad"
    },
    {
        "comment": "City Skylines has various DLC packs such as Sunset harbor to natural disasters to after dark ect. I feel like the highways in City Skylines need an update with:Speed CamerasHighway PatrolTraffic StopsCrashes / AccidentsVehicle TowHighway MaintenancePursuitsect.Things such as Accidents could block lanes of traffic causing traffic to pile up and would require medics and or Highway Patrol you would also need a tow / highway maintenance. Also, the police/Highway patrol should Pursue Vehicles down the highway and possibly in the actual city. Things like this would be more realistic as in City Skylines vehicles drive normally with out mistake.",
        "label": "Feature",
        "title": "City Skylines - Highway Control DLC Consept"
    },
    {
        "comment": "For a better overview, I would suggest to provide a selection of time periods.For this I could imagine, for example periods of (12 months do not know if this is possible) 1, 5, 10 years and total.The current overview (see picture) is difficult to understand for recent changes.",
        "label": "Feature",
        "title": "Selection of periods in the city statistics"
    },
    {
        "comment": "Self explanatory. You should be able to upgrade roads to rail, rail to roads, so we don't experience that \"centipede\" tie up.",
        "label": "Feature",
        "title": "Railroad Roundabouts"
    },
    {
        "comment": "Recently, there are a few threads regarding a hypothetical successor of Cities: Skylines and our wishes. One thing that seems to be posted a lot is a new mechanic for building roads, so I thought we could discuss how a good road building tool would look like, how we can build the roads and paths we want.I posted this on another thread but I'm really interested in what other ideas there are:Have a modular system which allowscustomized lanes, decoration, footpaths. Allow to change the size of the footpaths. You could have a two-way road but with tram tracks just in one direction and trees on the other side or a one-way road with a bike lane etc. You could have parking spaces in between the bike lane and the rest of the road. Or a pedestrian area. Or a bike highway. And so on. You should have some templates and ready-to-use roads for beginners. Don't give us bike and foot paths as a separate system to roads. If you make a road just consisting of a footpath, you have: a footpath that snaps to your roads! You could have different styles (like gravel, dirt, asphalt, cobblestones, pavement etc.) for them, with lanes for vehicles these types could influence the possible speed. I would love be able toconnect footbridges/foot tunnelsover/under roads with bridges/tunnels to train platforms in a train station or to have stairs to footbridges or tunnels on the sidewalk (not just beside). In really dense areas this would give us much more possibilities for pedestrians. And can we haveescalators and elevators? What aboutwheelchair users, elderly and people with buggies, so you need to think about accessibility? There shouldn't be required gaps between roads and quays. Being able tobuild on quaysfrom the beginning would be great. We need the possibility to mark walk-able areas that connect to this new road/path system for squares, beaches or just walking in the forest. Or maybe cims could be able to walk just shorter routes over grass and create trails by constantly walking on the vegetation. A mod likeTM: PEshould be part of the game from the beginning. You should be able to build traffic-lights, zebra-crossings, ... outside road crossings. Oh, and we needferries for cars and passengers(eg. like in Norway) that really connect and can be used by services too so that bridges/tunnels aren't always required for smaller islands or wider waters.Click to expand...",
        "label": "Feature",
        "title": "(C:S 2's ?) New network/road system"
    },
    {
        "comment": "Suggestion: Add Size and pop density statistic into district info panel.Reason: Easier measurement of development of each district in term of land usage. Allowing me to compare different districts and set appropriate population density goal, and add corresponding public transportation.",
        "label": "Feature",
        "title": "Additional district statistic : district size and population density"
    },
    {
        "comment": "I thought this could be interesting. We've got a fair few wishlists for the possibly upcoming Cities Skylines sequel, but I though it would be interesting to have a compilation of peoples'Now, I know from experience with forums that these threads tend to devolve into spamming suggestions, so please show some restraint and only post your topthreewishes for Cities Skylines 2.1. more zoning options- mixed zoning (allow multi-story buildings to house shops, offices, and apartments), single-family only housing, apartment buildings, etc.2. better road and traffic design,for example the ability to upgrade a street into a pedestrian-only street (the street remains as before, except possibly with a different road texture, but is only for pedestrians), and traffic calming efforts, and the ability to block off intersections in certain directions with chains or bollards (useful for intersections with lots of traffic).3. more actual interaction with the outside world, like in the Sim City games.As it is, it feels like your city exists in a vacuum. Examples of what new features could be: have neighbouring cities have their own needs, surpluses, goods production, unemployment issues, and so on. Allow me to decide the number of neighbouring cities and the size of them when founding my own city.",
        "label": "Feature",
        "title": "Your top three wishes for CS2"
    },
    {
        "comment": "after a certain amount of time you have to make pledges for the city e.g. 20% fire safety by 2050 and then if you don’t meet them people are unhappy and don’t want to upgrade and even put people of from moving into the city. Polling stations are needed or can be set up in schools and in sports halls and yoga parks",
        "label": "Feature",
        "title": "City mayor elections"
    },
    {
        "comment": "I know there's a mod for this but I didn't realize it wasn't in the base game yet. We really should be able to make road and rail tunnels in the map editor. beyond anything else, when making islands that aren't supposed to be connected to the main land tunnels are a good way to add road and rail access without needing a long bridge coming from nowhere.",
        "label": "Feature",
        "title": "Tunnels in map builder"
    },
    {
        "comment": "These MODS literally make City Skylines 2. There is little work for Devs to do. #WIN/WINPlease, Please, take heed.",
        "label": "Feature",
        "title": "These MODS are absolutely insane!!!"
    },
    {
        "comment": "PLEASE PARADOX GAMES add an expansion or a free update for console players to buy more tiles. I have no space in my city and my city has hit a stage 5 demographic. If the old consoles cannot run more than 9 tiles, atleast let next gen players have this update/expansion. It could be paid for free (right now I don’t care).",
        "label": "Feature",
        "title": "More tiles for console players"
    },
    {
        "comment": "Hello,I was searching for a more direct form of contact like an e-mail address, but I could not find. I hope my suggestion is well received by the community.At this point I believe many of you have already heard of Google Stadia and other similar cloud gaming services. They all have been growing and improving drastically over the past years. Now Stadia is expanding outside the US and is available here in Europe as well.Stadia has a free and a \"Pro\" tier plan. The free plan works like Steam where you buy games individually on their platform and you're free to play as you wish. The Pro plan includes 4K streaming and access to a library of selected games that you can claim and become part of your library forever as part of the plan, among other things.The beauty of using Stadia is how it adapts well to any situation you find yourself in. Sitting at your desk with a keyboard and mouse? No problem, kb&m controls you have, just like any other game. Wanna pickup your pad? Why not? Prefer to sit on the couch and play on the big screen? All you need is a Chromecast or a compatible smart TV (and a Stadia controller). Kids want to watch their favorite cartoon now? Well pause the game and move to your bedroom TV. At a friend's house without your laptop? All you need is your Google account and a browser!I've been out of the most recent titles as I don't feel like I want to invest on a powerful stationary desktop computer when I have already a perfectly functional new and incredibly mobile laptop I use for work which kicks ass at anything it does but only lacks the graphics card to play recent games, but draws immense amounts of power and heats up when it does, throttles the FPS when running on battery (for only 20 minutes or so at best), but i can comfortably stream at max FPS best quality on Stadia.Some of you will say Stadia is already dead and Google gave up on it, but that's not true. If you're seeing from outside and only sometimes see the tendentious news that's the impression you have, but when Google sold their gaming studio, that was the right move, they decided instead of creating their own in-house games (which let's face it probably they wouldn't be great) it would be better to use this money to invest on bringing in new publishers and improving the platform, and that is exactly what's been happening over the past few months. Stadia has been seeing active development and release of UI and performance improvements, new bigger games are coming such as Resident Evil 7 and the brand new Resident Evil Village are available and playing great in the platform.I believe Stadia is so great that I am comfortably using it alongside my Switch for other games as my main gaming platform, and I can comfortably say it is the future of non-professionally-competitive gaming as the PCMR e-sports players will definitely notice the inhuman added ~10ms of input latency.Having all that said, I believe Cities: Skylines and all other paradox Interactive games would find Stadia to be a great and comfortable new home, so I'd like to formally suggest Paradox Interactive to consider bringing them in to the new platform.",
        "label": "Feature",
        "title": "Cities: Skylines and other Paradox Interactive games on Stadia"
    },
    {
        "comment": "Buildings can reach up to lvl 10, and can merge across streets if they lvl up far enough. Ex: Big buildings like in New York, or like the Peach Trees in Dredd.",
        "label": "Feature",
        "title": "Mega Blocks"
    },
    {
        "comment": "Cities: Skylines is a really wonderful game. It provided many hours of creativity-evoking gameplay to me. For a possible successor of Cities: Skylines, I would see even more potential than solely a delightful city builder with commercial success.Our society faces enormous challenges in the 21st century, like climate change.A potential successor of Cities: Skylines would have excellent requirements to not only be enjoyable but also help tackle these challenges.Game mechanics that resemble the systemic ways our real world works, and letting the natural world react to the player's actions, could create exciting systemic gameplay, which simultaneously teaches systems thinking, life cycle thinking, and sustainability in an entertaining way.Among other things, the game could reflect on the consequences of having a linear economy versus a circular one or using conventual agriculture versus methods rooted in permaculture.By shining a light on the Rights of Nature and reflecting on concepts like ecocide, the game could raise awareness and influence design trends long term.I would be so hyped for that kind of systemic gameplay!You as well?PS:In that regard, I think you could like this YouTube video as well:",
        "label": "Feature",
        "title": "Cities: Skylines successor - systemic gameplay and sustainability"
    },
    {
        "comment": "In a game all about managing a city, traffic flow, education etc... why are there nodriving schools/driving centres. It makes sense. People from outside the city can come by car but like education, as the city grows the newer generations would have to learn how to drive before being able to do so.Why do I think this would be cool?- It adds a gameplay element.- It would make traffic managing more interesting- It would force citizens to use transport over driving until they learn just like IRL.- It would mean the player will have to make sure people have a good way of going about the city.- Finally, it would also lessen traffic in cities.",
        "label": "Feature",
        "title": "Driving Schools"
    }
]