{
    "cursor": "AoIIP1lL4HTqjVo=",
    "query_summary": {
        "num_reviews": 100,
        "review_score": 9,
        "review_score_desc": "Overwhelmingly Positive",
        "total_negative": 2173,
        "total_positive": 87339,
        "total_reviews": 89512
    },
    "reviews": [
        {
            "author": {
                "last_played": 1622424453,
                "num_games_owned": 16,
                "num_reviews": 3,
                "playtime_at_review": 87205,
                "playtime_forever": 259028,
                "playtime_last_two_weeks": 3170,
                "steamid": "76561198076348453"
            },
            "comment_count": 42,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "28381602",
            "review": "As a retired truck driver of 40 years I never though I would end up playing a game about truck driving but I find it a pleasing experiance when I can travel the European roads which I traveled daily. The experiance is so realistic I would recomend this game to all who would like a glimps of the life of a European trucker without all the grind and hardship which goes along with the job. Congratulations SCS you have a realistic product even taking into account the suicidal AI.",
            "steam_purchase": true,
            "timestamp_created": 1481775487,
            "timestamp_updated": 1481775487,
            "voted_up": true,
            "votes_funny": 117,
            "votes_up": 842,
            "weighted_vote_score": "0.976082563400268555",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1595537238,
                "num_games_owned": 233,
                "num_reviews": 67,
                "playtime_at_review": 1042,
                "playtime_forever": 2467,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198003473030"
            },
            "comment_count": 16,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "31403010",
            "review": "You know, it honestly feels like a joke at first. There’s thousands of games out there – some offer compelling storylines, others offer non-stop thrills, and pretty much all of them let us escape the dull monotony and grind of daily life... And then there’s Euro Truck Simulator 2. Which, unsurprisingly, is a simulation game where you drive trucks around a crude rendition of Europe. Okaaaay. \n\nTo emphasise the absurdity of things, you only need to look at the basic gameplay loop that’s taking place here; you pick a job from a list of options in your area. You go and hitch up your cargo. Then you slowly trundle towards your destination, taking into account every road law and speed limit, and spending the great majority of your time on vast highways and never-ending strips of asphalt. After dragging yourself to your destination for 20 to 30 real-time minutes, you drop off the cargo – and do the whole thing again.\n\nSuffice to say, then, that this isn’t for everyone; there’s a good chance a few of you have fell asleep merely reading the last paragraph. If you do actually get to the point where you boot up the game for the first time, it even does a lot to try and immediately frighten you off... You’re instantly met with a plethora of menus that are incredibly overwhelming, allowing you to do everything from create a profile to adjusting your X-axis sensitivity for... Well, something. The tutorial then doesn’t help matters, basically stemming down to telling you “Just drive the truck”, and then buggering off and leaving you to work out how exactly you do that in the first place. \n\nYet give it a chance to get things rolling and – amazingly and most crucially – it really works. There’s a bunch of reasons why this is the case, that go way beyond the primal satisfaction that comes with driving a hulking great big rig. For one, there’s an incredibly calming sense of slow progression constantly burning away in the background, with the sat-nav in the corner of your screen always slowly ticking down the miles left towards your destination. It’s surprisingly satisfying to watch the numbers keep dropping, and finally whittling a distance that seemed impossible to begin with down to nothing. \n\nSecondly, there's the option to turn on your own music while driving, or even tune in to actual radio stations across Europe. Set one of these up and hit the perfect moment, where the right song comes on as you watch the sun slowly rise and peep through the trees, and it all just feels… Right. Heck, take my word for it when I say that having AC/DC’s “Highway to Hell” blasting out your speakers as you’re racing down the road at max speed is something that’s hard to beat. If you’re daring, you can even pop a video or TV show up in another window and zone out... But just like real life, the chances of you suddenly finding yourself wrapped round the nearest streetlight rapidly increase if you do this. Still, it’s fun to try. In the game, that is. \n\nThere’s also a healthy degree of strategy mixed in as well. Your truck needs fuel and your driver needs rest, and managing the two becomes a delicate balancing act of effective time management, where you are constantly checking out your route and seeing how far you can push yourself before you literally fall asleep at the wheel. While it takes way too long if you’re not wishing to put yourself in a position of extreme bank debt (so much so it actually gets a little frustrating), you can even make enough money to hire other truckers to your cause. Suddenly you’re busy plotting out an empire, trucks roaming across all of Europe, and your hard work being rewarded with a skyrocketing bank account. You can even make the core game more complicated, if you’re that way inclined. An automatic gearbox might be the obvious choice, but there’s nothing stopping you from having to switch through all the gears manually, or even hooking a wheel up and going totally crazy. The choice, as they say, is yours.\n\nIt’s also worth pointing out all the mods that are available to enhance or change things up – from the big changes to the little tweaks, there’s a lot you can bolt on to the base experience. Whether it be branding the sides of trucks with famous logos, or subtly changing the map and the way your truck handles, there’s a lot you can tinker about with if things are starting to feel a little dry. Special shout out to the mod that lets you personalise the inside of your truck – because there’s something irresistible about decking out your cabin with a giant BB-8 and a bunch of other nerdy bits and bobs that fill up every empty space. While not offered in the game or mods themselves (and I can't say I tried this myself), there’s also means out there to take things online, hitting the road with truckers all over the world. Chances are you’ll end up in a traffic jam trying to get a ferry to somewhere, but hey, whatever floats your boat. \n\nIn the end, whatever you choose to do and however seriously you take what’s on offer, Euro Truck Simulator 2 is perhaps the definite chilled out experience; with everything always just coming back down to you and the open road. It’s the perfect game to unwind after a stressful day, where the challenge or intensity of most other games simply doesn't appeal, and that's what makes it something so much more than something to laugh at.",
            "steam_purchase": true,
            "timestamp_created": 1493330743,
            "timestamp_updated": 1493395474,
            "voted_up": true,
            "votes_funny": 16,
            "votes_up": 623,
            "weighted_vote_score": "0.972163736820220947",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1620509613,
                "num_games_owned": 514,
                "num_reviews": 23,
                "playtime_at_review": 7150,
                "playtime_forever": 17479,
                "playtime_last_two_weeks": 0,
                "steamid": "76561197974569748"
            },
            "comment_count": 21,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "12641410",
            "review": "This game is meditation, the thought-cleansing effect of driving a thousand kilometres along the highway cannot be understated. Occasionally poor AI choices behind the wheel may spike your blood pressure but overwhelmingly ETS2 is a relaxing thing to stick on after a rough day. And if that's not enough you can just drive into oncoming traffic in your indestructible death machine.\n\nAn alternate title for this game could be \"Zen and the Art of Logistics\".",
            "steam_purchase": false,
            "timestamp_created": 1414329594,
            "timestamp_updated": 1414329594,
            "voted_up": true,
            "votes_funny": 262,
            "votes_up": 1295,
            "weighted_vote_score": "0.971483290195465088",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1622395110,
                "num_games_owned": 271,
                "num_reviews": 5,
                "playtime_at_review": 93757,
                "playtime_forever": 127122,
                "playtime_last_two_weeks": 2254,
                "steamid": "76561198282098219"
            },
            "comment_count": 20,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "58201273",
            "review": "Wish I wrote this review years ago. But being the hardcore gamer I am, I decided to play the game instead XD\n\nI was just like any other person, \"Why should I buy a truck game, It's neither exciting nor does it have any story\" but as it was on sale, I decided to buy the game and see for myself. \n\nI played the singleplayer, got used to the physics, made myself some nice money and built a trucking empire. Then I found out there were mods..\n\n...and that was the end of my life outside. I just installed everything that was 5 star rated and used by many people. There was just something satisfying about this game, I used to spend hours playing and listening to the internet radios in the game. \n\nAnd it just went further downhill as I discovered a multiplayer mod, I made so many friends to this day I'm greatful that I played this game.\n\nIf you are reading my review, Please leave a comment, like it so people know that this game is worth buying all the dlcs for! (Yes, I bought every DLC they had)",
            "steam_purchase": true,
            "timestamp_created": 1574866349,
            "timestamp_updated": 1574866349,
            "voted_up": true,
            "votes_funny": 60,
            "votes_up": 708,
            "weighted_vote_score": "0.959381103515625",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1598335452,
                "num_games_owned": 695,
                "num_reviews": 15,
                "playtime_at_review": 803,
                "playtime_forever": 1553,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198028681413"
            },
            "comment_count": 115,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "9097411",
            "review": "Upon a winter's night quite cold\nI loaded up a game Steam sold\nThe trucking sim of much acclaim\nWhile thinking, “what a stupid game.”\n\nAt first I tried to play my way\nBy squishing peds and bringing pain\n“Where are the cops?” I asked myself\nTrying to earn my place in Hell.\n\nBut time went on I grew bored\nI'd do one run and then ignore\nThis game that they’d called 'Comfy Truck'\nAnd then move on without a-\n\nBUT WAIT! I'm almost out of time!\nJust have some faith, I'll cross that line!\nBut time was past and pay was docked\nMy world was shattered, faith was rocked.\n\n“Well just one more.” I grumbled low\nI loaded up and hit the road\n\"I've got it now.\" as off I went\nSoon to delete local content.\n\nPassed peaceful pastures in the night\nI saw a sunrise blinding bright\nI guess this game's not all that bad\nThough not the best I've ever had.\n\nPop playing on the radio\nIn harmony with my Volvo\nThis siren sought to bring me sleep\nWhile consciousness I fought to keep.\n\nI showed up, docked and dropped my charge\nAt a nondescriptive harbor yard\n“Just one more time,” said my girlfriend\n“Tomorrow you can play again.”\n\nBut no, I knew I couldn't stop\nThe needs of commerce never drop\nIf it be chemicals or steel\nI had to keep turning those wheels.\n\nSo down the road I charged once more\nThrough France, Poland and Luxembourg\nAnd soon a thought occurred to me\nCould this be what they call ‘comfy’?\n\nIf slow and peaceful is your aim\nYou'll not do better than this game\nNow just real quick here's a rundown\nSo you’re running when you hit the ground.\n\nYou move cargo from A to B\nI'd recommend quite hastily\nIf you do well and earn your pay\nThen manage other drivers days.\n\nAnd so with that ends my review\nI hope maybe you’ll try it too\nIn here you'll find no gun or knife\nBut I enjoy the trucking life.",
            "steam_purchase": true,
            "timestamp_created": 1392358451,
            "timestamp_updated": 1392358451,
            "voted_up": true,
            "votes_funny": 140,
            "votes_up": 2292,
            "weighted_vote_score": "0.956244468688964844",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1419486688,
                "num_games_owned": 847,
                "num_reviews": 231,
                "playtime_at_review": 947,
                "playtime_forever": 3720,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198038604011"
            },
            "comment_count": 3,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "12881917",
            "review": "Much like my sentiments of Farming Simulator 2013, I fell in love with Euro Truck Simulator 2 and I have no idea why. Mundane job simulators are overwhelmingly garbage, but a select few (including ETS2) are surprisingly compelling.\nThere is no way I can think of to describe this game without sounding terribly drab. You’re a truck driver, and are starting your own shipping company. You have to drive according to the law, take rest breaks, buy fuel, pay for upkeep. There is nothing on paper that should be exceptional about this game, yet for what it is, Euro Truck Simulator 2 is disturbingly enjoyable. I recommend everyone to give it a try.",
            "steam_purchase": true,
            "timestamp_created": 1415668828,
            "timestamp_updated": 1415668828,
            "voted_up": true,
            "votes_funny": 16,
            "votes_up": 404,
            "weighted_vote_score": "0.951959609985351563",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1595331294,
                "num_games_owned": 2917,
                "num_reviews": 77,
                "playtime_at_review": 5758,
                "playtime_forever": 8304,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198013520503"
            },
            "comment_count": 8,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "12854389",
            "review": "Top-notch truck driving simulator.  With support for TrackIR, wheels and pedals, this game has become a gem of the simulation genre.\n\nBefore having tried it, it's hard to see why this game will be so addicting.  I suspect much of that feeling comes from the progression from a lowly truck driver not even owning a truck to a multi-country Logistics company owning a hundred trucks and employing as many drivers.\n\nYou \"level up\" various skills which improve the rewards you get from certain types of deliveries or open up more jobs such as longer distances or different categories of dangerous cargo.\n\nDriving the trucks is a pleasure.  It's surprisingly therapeutic driving from city to city, obeying the road rules rather than smashing things up like a madman.  That said, if you disable the speed-limiter in options (90kph) you can get a bit crazy, getting as high as 150kph+ on some routes, a bit of a thrill considering the cargo you have in tow!  Speed cameras will become your enemy though.\n\nUnfortunately the AI of the other traffic can at times frustrate.  In some instances such as in underpasses under freeways you can find intersections where the cars always fail to give way, probably because the intersection was not programmed correctly.  Don't get me started on the kamikaze AI at roundabouts either.\n\nIn any case, this is the most fun you can have driving a truck in a game.  Having a controller or steering wheel would be highly recommended, and if you have head-tracking equipment it's icing on the cake.",
            "steam_purchase": false,
            "timestamp_created": 1415498642,
            "timestamp_updated": 1415499503,
            "voted_up": true,
            "votes_funny": 18,
            "votes_up": 495,
            "weighted_vote_score": "0.949559271335601807",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1621630249,
                "num_games_owned": 74,
                "num_reviews": 5,
                "playtime_at_review": 2647,
                "playtime_forever": 4391,
                "playtime_last_two_weeks": 43,
                "steamid": "76561198382630710"
            },
            "comment_count": 15,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "85914351",
            "review": "It helps me cope with my depression",
            "steam_purchase": true,
            "timestamp_created": 1612400962,
            "timestamp_updated": 1612400962,
            "voted_up": true,
            "votes_funny": 47,
            "votes_up": 407,
            "weighted_vote_score": "0.949141323566436768",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1620589934,
                "num_games_owned": 600,
                "num_reviews": 54,
                "playtime_at_review": 1409,
                "playtime_forever": 5425,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198032718356"
            },
            "comment_count": 39,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "36518195",
            "review": "Man; I'll keep this short.\n\nStarted a job, a small one, from Plymouth (England) to Rennes (France).\n\nPut on my favourite radio station through the game's radio streaming option - Hotmix radio (French station that plays 80's music non-stop with NO talking other than the odd jingle).\n\nGet 'Cutting Crew - (I Just) Died In Your Arms' blasting out.\n\nDriving down the country lanes of France, at night, with 'Died In Your Arms' playing in the background... you know this game is good.\n\nI feel like you NEED music on when playing this game unless you like engine noises, similar to those that enjoy that whale noise thing.\n\nIt's not a complicated game. You pick a job, drive form A to B, get paid. You can run a trucker business as well. It's relaxing as f**k. Not going to lie.\n\nJust... just find Hotmix radio, favourite it and you're set.\nYou get all the greats like Queen, Bee Gees, Dead or Alive, Erasure, Culture Club, Human Leauge, Pet Shop Boys, Kate Bush. You know... All the greats. The list goes on. I'm only 21, but f**k. I feel like I'm 45/55 (no offence to any 45/55 year old's).\n\nGot a cup of tea, playing Euro Truck 2 with a 80's station on at the age of 21. \nIt's just nice... to play a game, after a long day, in the evening, for a couple of hours every few nights.\n\nEuro Truck 2 is worth it. Honestly. It might look sh*t, I said that when I saw it, but now look. I f**king love it.\n\nSo much for keeping it short.",
            "steam_purchase": true,
            "timestamp_created": 1510689678,
            "timestamp_updated": 1510689883,
            "voted_up": true,
            "votes_funny": 97,
            "votes_up": 333,
            "weighted_vote_score": "0.94890981912612915",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1618467392,
                "num_games_owned": 867,
                "num_reviews": 111,
                "playtime_at_review": 43423,
                "playtime_forever": 43424,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198078811539"
            },
            "comment_count": 11,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "28317941",
            "review": "[h1]What is Euro Truck Simulator 2?[/h1]\n\nWell, basically you drive a truck and deliver trailers to your destinations across Europe. This game is from the people of SCS who made other Truck Simulator games, as referring to [i]18 Wheels Of Steel Series and Euro Truck Simulator[/i]\n\n[h1]Seems boring to play if you do the same thing over and over.[/h1]\n\nIt sure seems like it does, I honestly thought when I first saw this game it seemed boring when I saw this. I gave the first Euro Truck Simulator a try and loved it. This game soul purpose is meant for people who want to kill the time that's worth it and love driving. \n\n[h1]Is it really all about driving?[/h1]\n\nActually, yes it is. It may seem like an easy task to do, but it's actually a challenge.\nYou start off small as you drive for other companies and build your way up. You start with the very small tasks that you can get done within the first 20 minutes of your gameplay with the short trips. Eventually, you gain skills and level up as you go. You can use those skills to help you for traveling the longer distance and get higher payment as you complete the tasks. Eventually, when you get that steady income, you can own your own truck and make even MORE money. You start off with a small garage, and you'll be able to upgrade it and hire drivers as you go! Even yet, take the shortcut way taking out a loan! You pick on what to do!\n\n[h1]Is it Realistic?[/h1]\n\nYes, and no.\n\nIt's really how you look at it. The Physics on this game isn't 'Top Notch' but it get's the job done. For example, you hit a vehicle you'll just hit each other and no physical damage would be done between the collision. If anything, you'll just get a fine. Speaking of fines, there are laws you have to follow. Such as speeding, Red Lights and Green Lights and so on. The weather system is alright to my standards as you can change the settings of how often you want it to make it rain as you're on the road. Gas and time is a big factor too. It's important to keep track when you need to complete your delivery and keep your Fuel up at times! Sleep is also needed! \n\n[i]Note: Some of these features can be disabled in the future in-game, but will get rid of that 'Simulation' Feel.[/i]\n\n[h1]Is there Multiplayer?[/h1]\n\nThe game alone is more focused on the single player aspects. Although there is a mod where you can download and be able to drive with your friends and other people!\n\n[h1]Is there Mod Support?[/h1]\n\nHeck Yes!\nYou can find a lot of mods, such as custom trucks, map mods, Graphic Mods and more!\nAlthough alot of these mods aren't off the steam Workshop, you would have to try to find these mods somewhere off a ETS2 Mod Page\n\n[h1]Is there Steering Wheel and VR Support?[/h1]\n\nOh yes, definitely. I have the G29 Steering Wheel/Pedal/H Shifter included, it's so much better and very more immersive.\n\nI also have the Oculus Rift, combining it with the Wheel is awesome, I would very recommend pairing it up if you have VR or want to invest into it if your PC meets the requirements.\n\n[h1] Is The DLC even worth it?[/h1]\n\nYes and no\n\nThere's a lot of DLC's shown off this game off the page, but half of them to me aren't worth getting. Most of them are for Paintjobs for your trucks. [i]Even though the Steam Workshop Supplies Free Paintjobs Without even Paying.[/i]\n\nThe important DLC's are the Map Expansions. These are the Map Expansions you would likely want in the future\n\n- Going East\n- Scandanavia\n- Vive La France\n- Italia\n- Beyond The Baltic Sea\n- Road to the Black Sea\n- Iberia\n- Russia (Soon to be released.)\n\nAll of these Expansions alone will give you hours of fun for every single DLC. I have over 500 hours on this game, and only explored 67.32% of the map! [i]That's because I took my time, and didn't rush[/i]\n\n[h1]The Issues I had in the past.[/h1]\n\nThere hasn't been that many issues in the past for me, I had rare crashes that happen here and there and stuttering problems, but that's likely my CPU bottlenecking my performance. The AI traffic can be brutal at times, making sudden stops ahead of you, or cutting you off simply. But this is a rare occurrence. Although take care as you put Mods into your game, some mods will crash your game at times, but that's often rare in that case.\n\n[b]Update as of 2019:[/b]\n\nI upgraded my FX 8320 8-Core to a Ryzen 7 1700X, performance has been flawless ever since.\n\nPerformance has also increased with the new DX11 system. The game did chug overall with higher end PC's due to DX9 limitations. \n\n[h1]My Final Verdict.[/h1]\n\nif you love driving, this is a must-have! I never had interest in trucks until I played this! The scenery all around you while driving is just..breathtaking. Enough where you just want to stop and admire the scenery around you! There's a wonderful Day/Night Transition, weather effects, going 90kmh in the UK is just great!\n\nProMods is very recommended also if you have all the map expansions!\n\nFor a Trucking Simulator, I highly recommend this game, even if you have no desires about trucks!\n\n--------------------------------------------------------------------------\n\nDLC Reviews: (WIP)\n\nGoing East! Expansion DLC: http://steamcommunity.com/id/JDumbz/recommended/227310/",
            "steam_purchase": true,
            "timestamp_created": 1481494647,
            "timestamp_updated": 1618253485,
            "voted_up": true,
            "votes_funny": 4,
            "votes_up": 339,
            "weighted_vote_score": "0.939775824546813965",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1621944285,
                "num_games_owned": 581,
                "num_reviews": 4,
                "playtime_at_review": 44578,
                "playtime_forever": 118627,
                "playtime_last_two_weeks": 3,
                "steamid": "76561197971844939"
            },
            "comment_count": 5,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "19400408",
            "review": "Euro Truck Simulator 2 - the smash hit no one saw coming. Buy and customise your own fully licenced and detailed truck from any of the seven truck manufacturers (Scania, Volvo, Mercedes-Benz, MAN, DAF, Iveco and Renault) then haul good around Europe's cities. Earn money, level up, buy garages and more trucks then hire workers to drive them. Build a trucking empire whilst traveling across beautiful scenery with realistic-looking sunrises, sunsets, fog and rain. Works with keyboard, mouse, game controllers and steering wheels, not to mention TrackIR and Oculus Rift. With great mod support and regular DLC, this game remains fun and enjoyable almost three years after release. Just buy it, then you'll understand.",
            "steam_purchase": false,
            "timestamp_created": 1448926974,
            "timestamp_updated": 1448926974,
            "voted_up": true,
            "votes_funny": 6,
            "votes_up": 180,
            "weighted_vote_score": "0.932312965393066406",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1527906443,
                "num_games_owned": 566,
                "num_reviews": 10,
                "playtime_at_review": 2387,
                "playtime_forever": 7569,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198029986833"
            },
            "comment_count": 5,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "8238009",
            "review": "This is easily one of the best games I've got in 2013, and will probably remain in my Steam Favorites list for a long time. I never played a game like this before and now it has me hooked. It keeps getting better!\n\nAt first I was just enjoying the scenery, the gameplay of driving the trucks, taking different jobs, and leveling up my XP so I could make more money and buy my own truck (Volvo FH16 Globetrotter). Now I'm working to upgrade my truck and my business. The business part is pretty addictive too. You can take a loan, expand your first garage, start buying more trucks, and hire drivers to work for you. I'm anxious to get enough money to buy another garage somewhere else and start another fleet.\n\nYou can not only use your skill points from XP to strategically improve your abilities and rewards one step at a time to make more money, you can do the same with your drivers (or choose to have their skills auto-balanced).\n\nThe scenery is gorgeous and there are some nice little touches of different things to see on the road and in different cities.\n\nThe changing weather and day/night transformations are great. Rain storms are awesome.\n\nDriving in Europe is really not that different than driving in North America. Although, for some reason driving in the UK made me a little nervous--maybe it's the little extra traffic; maybe it's just driving on the other side of the road; or maybe I was expecting The Stig to cross my path.\n\nI play with a  Driving Force GT wheel, and even though as a fan of racing games I at first had doubts about this game, I gotta say if you have a wheel you really should try this game. Everything about the game is pure pleasure, but the driving is not just enjoyable but challenging as well. Things like parking your trailer; traveling swiftly but balancing your trailer's loads around all kinds of bends, inclines and declines; driving at night; dealing with other drivers (watch out for the evil empire of busses!) and trying to overtake slow pokes who follow the speed limit; traveling as fast as you can and watching for speeding cameras and changing speed limits make this one of the best driving games I've ever played. Oh yeah, don't blow those red lights--all the tickets you could get for various things can really ad up on one trip.\n\nIt actually is becoming a racing game as I'm travelling longer distances. Right now in order to not interrupt my delivery with rest stops and not be late (which costs money) or get fined for driving while tired (happened to me four times at the end of one trip), I'm trying to make my trips even faster. So I'm balancing my loads at top speeds, taking the ever changing curves of the road as gracefully as possible, putting the pedal to the metal but watching for speed cameras and changing speed limits (watch out for those road hazard areas and be careful in town), and trying to overtake just like in a racing game--but it's more challenging with opposing traffic on busy highways!\n\nIt's also a great music game. Hit the road and use your in-game radio to tune into different internet stations or play your favorite music on a media player in the background (I recommend AIMP3, which has a great interface and features but is very low resource).\n\nI highly recommend ETS2! I hope they make more expansions, and I am looking forward to American Truck Simulator.",
            "steam_purchase": true,
            "timestamp_created": 1387843222,
            "timestamp_updated": 1387844368,
            "voted_up": true,
            "votes_funny": 1,
            "votes_up": 319,
            "weighted_vote_score": "0.930999219417572021",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1622417090,
                "num_games_owned": 123,
                "num_reviews": 4,
                "playtime_at_review": 61321,
                "playtime_forever": 100603,
                "playtime_last_two_weeks": 1388,
                "steamid": "76561198019437014"
            },
            "comment_count": 3,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "64732770",
            "review": "There's nothing better than sitting in traffic for 2 hours when commuting home during rush hour, then sitting in virtual traffic for another 2 hours.\n\n12/10",
            "steam_purchase": true,
            "timestamp_created": 1583706260,
            "timestamp_updated": 1583706260,
            "voted_up": true,
            "votes_funny": 305,
            "votes_up": 172,
            "weighted_vote_score": "0.92932504415512085",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1528939062,
                "num_games_owned": 705,
                "num_reviews": 54,
                "playtime_at_review": 1142,
                "playtime_forever": 1142,
                "playtime_last_two_weeks": 0,
                "steamid": "76561197968320719"
            },
            "comment_count": 5,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "14511216",
            "review": "It's very hard to hype this game up. You get into a truck with some cargo to deliver and hit the road accross a scaled down version of Europe. Over time you gain experience for things, like longer distances, more valuable cargo, etc. You can eventually buy your own truck(s), hire other drivers and expand your trucking empire and stuff.\n\nBut basically, it's about driving heavy, sluggish trucks. I am having difficulties putting into words [i]why[/i] any of this is fun. Perhaps fun isn't the right word at all.\n\nIt's relaxing most of the time, satisfying, and sometimes tense.\n\nThere's something in there about small moments. The moment where you pull out of the loading dock with your frozen peas or whatnot and find the highway. The moment where the countryside changes and you cross borders. The moment where the signs change and the language is different. The moment where you know you're almost there and are about to arrive. The moment where somewhere in the middle, it rained for a while, or got really dark. Or both. The moment where you missed your exit somewhere in belgium. The moment where you discovered you could listen to actual internet radio from within your truck, from a station that matches the country you're gently passing through.\n\nThis is probably not something you'll want to sit at for multiple hours, but if you're anything like me, you'll keep coming back to it, running a delivery once in a while, because it's relaxing, and the moments are tantalizing. \n\nOh also, there's a multiplayer mod. It's all of this except once in a while you will pass another guy going in the opposite direction. You'll both cheerfully honk your horns in greeting, then continue on your respective ways. I guess that's also another moment.\n\nI am actually fairly excited about all things VR and the Occulus rift for a multitude of reasons and games I'd like to experience with it, but my deepest secret about it is that I am [i]really looking forward to playing ETS2 when the consumer version lands[/i]. Seriously. That's how much I enjoy this game.\n\nUPDATE: 2018/06/11\nI have now realized this life long dream of playing it in VR with a Wheel and Pedals.\nIt is everything I hoped it would be.",
            "steam_purchase": true,
            "timestamp_created": 1424160907,
            "timestamp_updated": 1528716337,
            "voted_up": true,
            "votes_funny": 25,
            "votes_up": 272,
            "weighted_vote_score": "0.927985072135925293",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1622457495,
                "num_games_owned": 29,
                "num_reviews": 21,
                "playtime_at_review": 39747,
                "playtime_forever": 168455,
                "playtime_last_two_weeks": 20039,
                "steamid": "76561199136139834"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "87655713",
            "review": "Driving around in virtual Europe while listening to the radio or a good podcast is a surprisingly enjoyable and relaxing experience. An acquired taste, perhaps, but still a good game.",
            "steam_purchase": false,
            "timestamp_created": 1614586649,
            "timestamp_updated": 1614586649,
            "voted_up": true,
            "votes_funny": 5,
            "votes_up": 251,
            "weighted_vote_score": "0.927796661853790283",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1621176776,
                "num_games_owned": 152,
                "num_reviews": 2,
                "playtime_at_review": 7134,
                "playtime_forever": 9371,
                "playtime_last_two_weeks": 0,
                "steamid": "76561197987655506"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "55796717",
            "review": "I hate my Job ATM.  So I come home and I'm my own Boss.  I own my Truck and Trailer, I even employ some crazy looking geezer who barely makes a profit, but I respect him and treat him better than I'm treated IRL.  \n\nMight sound a bit depressing, but this game is amazing, I love it.  Highly recommend you to at least try it.",
            "steam_purchase": true,
            "timestamp_created": 1572079077,
            "timestamp_updated": 1572079077,
            "voted_up": true,
            "votes_funny": 62,
            "votes_up": 163,
            "weighted_vote_score": "0.926566720008850098",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1595416695,
                "num_games_owned": 324,
                "num_reviews": 68,
                "playtime_at_review": 5424,
                "playtime_forever": 6645,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198115373356"
            },
            "comment_count": 16,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "71643319",
            "review": "I like to get an audio book, put it in the right folder, and listen to it while I'm trucking. Makes the experience a whole lot more satisfying. I'd advise everyone to at least try the same.\n\nSpectacular simulator 10/10",
            "steam_purchase": true,
            "timestamp_created": 1593427934,
            "timestamp_updated": 1593432342,
            "voted_up": true,
            "votes_funny": 17,
            "votes_up": 216,
            "weighted_vote_score": "0.925503671169281006",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1608732600,
                "num_games_owned": 22,
                "num_reviews": 1,
                "playtime_at_review": 2830,
                "playtime_forever": 12778,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198063732042"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "38183131",
            "review": "I like the game as it is, although one thing irritates me, and that is the fact that you cannot buy used/older trucks. So it would be nice to see a second-hand shop where you could buy older and used trucks from like early 2000's or maybe even older ones,This would affect the price and condition so it could make driving less \"easy\", and by doing so it would add more content to the game. Thus you wouldn't have to buy a brand new truck every time if you want it to be your own.",
            "steam_purchase": true,
            "timestamp_created": 1512833093,
            "timestamp_updated": 1512833093,
            "voted_up": true,
            "votes_funny": 13,
            "votes_up": 194,
            "weighted_vote_score": "0.923596560955047607",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1619571651,
                "num_games_owned": 542,
                "num_reviews": 12,
                "playtime_at_review": 67474,
                "playtime_forever": 123892,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198113539128"
            },
            "comment_count": 28,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "17845316",
            "review": "This is the best Driving Simulator that i have come across. The details are great, the driving \nis excellent and the choice of trucks makes it hard to pick a favourite. I have 1000hrs.+ and am\nstill not getting tired of pointing the nose of my volvo down the road and hauling that cargo.\n\nThe Developers are always on the ball -  upgrading, ironing out the little bugs that come up,\nintegrating new routes and cities and making the trucks work and drive as authentic as possible.\n\nNot to forget the multiplayer mode which is a change from the single player version so if anyone\ngets bored it´s their own fault.\n\nTo summon it up this is just a great Simulator.\n",
            "steam_purchase": true,
            "timestamp_created": 1441193959,
            "timestamp_updated": 1441193959,
            "voted_up": true,
            "votes_funny": 59,
            "votes_up": 389,
            "weighted_vote_score": "0.923558592796325684",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1608348567,
                "num_games_owned": 113,
                "num_reviews": 5,
                "playtime_at_review": 1567,
                "playtime_forever": 2905,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198204962869"
            },
            "comment_count": 8,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "22989856",
            "review": "We recently had our first child and I was looking for a relaxing game to play during my (limited) downtime. Well I found it. Cruising around Europe, soaking in the scenery while listening to some random french jazz radio station playing in my truck literally puts a smile on my face. It's also very effective as an excuse for more playing time... \"I'm just 25 km from finishing my tomato delivery to Venice\" is a lot harder to argue with than \"I just need to kill these last few guys\". \n\n\"Go finish your stupid delivery\" is the usual response.\n\nAnd I will.",
            "steam_purchase": true,
            "timestamp_created": 1463277695,
            "timestamp_updated": 1463304704,
            "voted_up": true,
            "votes_funny": 364,
            "votes_up": 201,
            "weighted_vote_score": "0.923366844654083252",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1615015767,
                "num_games_owned": 1059,
                "num_reviews": 47,
                "playtime_at_review": 4305,
                "playtime_forever": 7716,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198109544340"
            },
            "comment_count": 7,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "42970688",
            "review": "This is the ultimate ZEN game.\nI can't get my finger on it. I do not have any connection with trucks in real life, neither with cars, highways, driving or anything related to the theme of this game, but still it's great fun.\n\nI almost strictly play rogue games and turn based strategy games.\n\nThe gameplay is very rewarding since you can unlock all kind of new parts on your way. It's realistic but not so much that the gameplay suffers from it. It's diverse since you can explore almost whole Europe (I really want to see Romania in it), and you have access to hundreds of ingame (or via internet) radio stations that you normally won't listen to.\nFrance hip/hop stations, Polish folklore etc.\n\nIt's just very streamlined, looks very beautiful, runs on almost every PC, cost only 5 Euro with Steam sales now, won multiple rewards and all is perfectly fine for me.\n\nThis is the ultimate relaxing experience for those moments you want to try something else.",
            "steam_purchase": false,
            "timestamp_created": 1529764992,
            "timestamp_updated": 1532293350,
            "voted_up": true,
            "votes_funny": 10,
            "votes_up": 157,
            "weighted_vote_score": "0.920878291130065918",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1620408462,
                "num_games_owned": 34,
                "num_reviews": 1,
                "playtime_at_review": 8730,
                "playtime_forever": 19316,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198401414779"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "69262933",
            "review": "One of the most relaxing games I've ever played.\nWhen I was down, depressed, this game brought me peace.\nI also started streaming from this game and I am happy to see that there are people like me, who find peace watching me driving a truck around.",
            "steam_purchase": true,
            "timestamp_created": 1589660896,
            "timestamp_updated": 1589660896,
            "voted_up": true,
            "votes_funny": 10,
            "votes_up": 153,
            "weighted_vote_score": "0.920595526695251465",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1612558692,
                "num_games_owned": 269,
                "num_reviews": 37,
                "playtime_at_review": 7305,
                "playtime_forever": 7405,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198011530260"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "79522360",
            "review": "Do you suffer from anxiety? Relax, open up ETS2 choose a route, put on some music ( maybe lofi ) and calm down...breathe.....enjoy the travel. 80% of the hours I've clocked in this game are back from when i suffered from panic attacks. This game is a legit medicine.",
            "steam_purchase": true,
            "timestamp_created": 1605815418,
            "timestamp_updated": 1605815418,
            "voted_up": true,
            "votes_funny": 4,
            "votes_up": 180,
            "weighted_vote_score": "0.919030666351318359",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1506354868,
                "num_games_owned": 1729,
                "num_reviews": 22,
                "playtime_at_review": 695,
                "playtime_forever": 827,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198056320792"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "46093873",
            "review": "you drive truk",
            "steam_purchase": false,
            "timestamp_created": 1542845922,
            "timestamp_updated": 1542845922,
            "voted_up": true,
            "votes_funny": 341,
            "votes_up": 417,
            "weighted_vote_score": "0.918319225311279297",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1618153175,
                "num_games_owned": 130,
                "num_reviews": 4,
                "playtime_at_review": 12884,
                "playtime_forever": 13610,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198074001670"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "67239891",
            "review": "My driver hasnt seen his family since 2013",
            "steam_purchase": true,
            "timestamp_created": 1586795564,
            "timestamp_updated": 1586795670,
            "voted_up": true,
            "votes_funny": 369,
            "votes_up": 156,
            "weighted_vote_score": "0.913903892040252686",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1616668663,
                "num_games_owned": 709,
                "num_reviews": 176,
                "playtime_at_review": 891,
                "playtime_forever": 1372,
                "playtime_last_two_weeks": 0,
                "steamid": "76561197972258172"
            },
            "comment_count": 62,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "12325451",
            "review": "My girlfriend didn't get why I loved this game. \n\nSaid I was a loser and a weirdo. \n\nSo I built my transport company into a million dollar empire just to show her what I'm capable of. \n\nI haven't heard from her for a while. \n\n10/10",
            "steam_purchase": true,
            "timestamp_created": 1412256375,
            "timestamp_updated": 1412256375,
            "voted_up": true,
            "votes_funny": 2029,
            "votes_up": 2591,
            "weighted_vote_score": "0.912935554981231689",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1506864676,
                "num_games_owned": 2644,
                "num_reviews": 30,
                "playtime_at_review": 2118,
                "playtime_forever": 3522,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198074310107"
            },
            "comment_count": 17,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "23549863",
            "review": "1. Take the longest route available\n2. Equip audio book\n3. Forget the world",
            "steam_purchase": false,
            "timestamp_created": 1465899469,
            "timestamp_updated": 1465899469,
            "voted_up": true,
            "votes_funny": 104,
            "votes_up": 275,
            "weighted_vote_score": "0.910980939865112305",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1620239452,
                "num_games_owned": 31,
                "num_reviews": 5,
                "playtime_at_review": 23959,
                "playtime_forever": 24661,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198361687363"
            },
            "comment_count": 1,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "87671283",
            "review": "Typical Euro Truck timeline:\n-Play vanilla for a couple hours, get your first truck, expand and start to feel like you experienced all the game has to offer. \n-Realise this game has steam workshop and install all the most popular mods. The plot thickens. \n-You hear about a website called ets2mods, a whole new world opens. \n\nAt this point your deep, but not done yet. \n\n- You download 2 major mods. Map expansion called ProMods and truckersMP. \n- Before you know it your in a convoy driving a decked out Scania traversing the toughest roads Iceland has to offer. You have peaked, the game will now bring a smile to your face for many thousand miles. \n\nVanilla is only the peak of the iceberg, once you mod it the truckers life starts to be more appealing than the real one.",
            "steam_purchase": true,
            "timestamp_created": 1614608691,
            "timestamp_updated": 1614608691,
            "voted_up": true,
            "votes_funny": 8,
            "votes_up": 142,
            "weighted_vote_score": "0.908756613731384277",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1612067227,
                "num_games_owned": 321,
                "num_reviews": 28,
                "playtime_at_review": 1524,
                "playtime_forever": 2846,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198099986382"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "66390557",
            "review": "100% the safest way to travel around Europe during the Coronavirus pandemic in 2020.",
            "steam_purchase": true,
            "timestamp_created": 1585794984,
            "timestamp_updated": 1585795593,
            "voted_up": true,
            "votes_funny": 344,
            "votes_up": 209,
            "weighted_vote_score": "0.905227899551391602",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1622071002,
                "num_games_owned": 269,
                "num_reviews": 21,
                "playtime_at_review": 3064,
                "playtime_forever": 5519,
                "playtime_last_two_weeks": 389,
                "steamid": "76561198030438609"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "48225147",
            "review": "ETS2+Spotify = hours of fun. Just hit the road, the game's amazing.",
            "steam_purchase": false,
            "timestamp_created": 1547132214,
            "timestamp_updated": 1547132214,
            "voted_up": true,
            "votes_funny": 3,
            "votes_up": 109,
            "weighted_vote_score": "0.904884278774261475",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1608297991,
                "num_games_owned": 42,
                "num_reviews": 5,
                "playtime_at_review": 245,
                "playtime_forever": 364,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198321863238"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "48351504",
            "review": "Yay i can finally be like my dad- go to germany with a truck and dont come back",
            "steam_purchase": false,
            "timestamp_created": 1547579181,
            "timestamp_updated": 1547579181,
            "voted_up": true,
            "votes_funny": 852,
            "votes_up": 159,
            "weighted_vote_score": "0.9044455885887146",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1621759502,
                "num_games_owned": 83,
                "num_reviews": 1,
                "playtime_at_review": 13318,
                "playtime_forever": 16277,
                "playtime_last_two_weeks": 108,
                "steamid": "76561198037950967"
            },
            "comment_count": 1,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "19171133",
            "review": "Most of my friends would look at me playing Euro Truck simulator and say \"Why would you play that boring game??\". The thing about this game is that it is so relaxing, but at the same time very enjoyable. \n\nThink about coming home from a tough day at work or school, just depressed or tired. Just hop in your truck, turn on the radio, and diseapear into the land of the calm. \n\nI definately recommend this game. But as every game, it's not for everyone. If you want a relaxing game, buy it straight away!",
            "steam_purchase": true,
            "timestamp_created": 1448010821,
            "timestamp_updated": 1454667523,
            "voted_up": true,
            "votes_funny": 18,
            "votes_up": 134,
            "weighted_vote_score": "0.903753876686096191",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1609996360,
                "num_games_owned": 887,
                "num_reviews": 60,
                "playtime_at_review": 1416,
                "playtime_forever": 1596,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198440199246"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "72368351",
            "review": "because of this game , i have a driver's license now :D",
            "steam_purchase": true,
            "timestamp_created": 1594304931,
            "timestamp_updated": 1594304931,
            "voted_up": true,
            "votes_funny": 64,
            "votes_up": 122,
            "weighted_vote_score": "0.903554379940032959",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1572238624,
                "num_games_owned": 49,
                "num_reviews": 5,
                "playtime_at_review": 206,
                "playtime_forever": 252,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198046605263"
            },
            "comment_count": 17,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "55534208",
            "review": "Excellent game for my typically violent, wrathful autistic son. My son is on the autism spectrum and is easily aroused by movement, especially in his peripheral vision. My wife and I had him fitted for glasses that block his side vision to keep him calm. My son hit a growth spurt this summer and now stands several inches taller than me and as I am not a man of large stature, this has proved to be a challenge. My marriage and career have been suffering because on multiple occasions I have been forced to leave critical meetings with clients to drive home and force diazepam down my son's throat. By the grace of God, I just happened to find Euro Truck Simulator 2. My son is enamored by it. It captivates him and calms him. He has only spent a few hours immersed in this simulation but we can already see a difference in him. When he is making a delivery down the Autobahn, he seems to be at peace.",
            "steam_purchase": false,
            "timestamp_created": 1570691112,
            "timestamp_updated": 1570691217,
            "voted_up": true,
            "votes_funny": 57,
            "votes_up": 225,
            "weighted_vote_score": "0.902667760848999023",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1622457452,
                "num_games_owned": 320,
                "num_reviews": 58,
                "playtime_at_review": 504161,
                "playtime_forever": 829667,
                "playtime_last_two_weeks": 18683,
                "steamid": "76561197962008935"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "76624365",
            "review": "+ Great developer support. Updated quite frequently\n+ Great graphics for its game engine\n+ Great vehicle physics\n+ Dynamic time, weather and vehicle damage.\n+ Friendly interface\n+ Ability to purchase garages and hire drivers to work for you\n+ 1000s of miles of road to drive on\n+ Many cities to discover\n+ Several trucks to choose from\n+ Realistic sounds\n+ Lots of accessories and options to choose\n+ Great wheel support\n+ Many trailers and jobs to choose\n+ Multiplayer available\n+ Integrated radio and music player\n+ Console can be enabled to edit / modify different parameters\n+ Map editor\n+ Inexpensive DLC\n+ Easily the best truck simulator out there",
            "steam_purchase": true,
            "timestamp_created": 1601159826,
            "timestamp_updated": 1601159826,
            "voted_up": true,
            "votes_funny": 12,
            "votes_up": 183,
            "weighted_vote_score": "0.902579009532928467",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1619695185,
                "num_games_owned": 95,
                "num_reviews": 42,
                "playtime_at_review": 12738,
                "playtime_forever": 12924,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198091110242"
            },
            "comment_count": 14,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "82952313",
            "review": "[h1][b]The Best Relaxing Game[/b][/h1]\n[i]SCS Software is my most favourite gaming company. On 18 Oct. 2012, they release this game, Euro Truck Simulator 2. Now you probably said whaaat?! Yes, in 2012 and the game still looks awesome. But most important thing is, the game is still alive and getting new big updates during the year. SCS didn't make the third version and don't plan to do it in near future. They want to keep updated their simulators, ETS2 and younger brother American Truck Simulator. SCS is not like other big AAA studios or some indie studios, which every year or every two years release a new version of their games. That's why SCS is my most favourite gaming company. They just keep updated both games and every update makes both games better and better. They made big steps from 2012 to 2020 and they have plans for the next years.[/i] \n\nOk, maybe if you check store page you will say they have too many DLCs. Yes, you are right but let me explain it. For new players, I recommend to buy not the only basic game but choose from one of the bundles. For example the Essentials Bundle. You will get a lot of content for a very good price. New heavy cargos, new parts of Europe to explore (Scandinavia, Poland, Slovakia and a small part of Hungary), Wheel Tuning Pack and Cabin Accessories. You can individually buy basic game plus one of the map expansions and choose DLCs packs which you want but like I said for new players is better to buy a bundle. Everyone can build their own version of the game. ETS2 has many sales during the year so don't be afraid of the price. SCS need to make money from something so that's why they have many DLCs for the game and then they can keep the game updated and improve it by every new update.\n\nNow I should say something about gameplay. It's very simple. At the start, you can't have your own truck. First, you need to make money by driving for other companies. Choose a job from Quick Jobs. Later, when you make some money you can buy your first truck. Now you can take cargos with your lorry and make more money from deliveries. You can borrow money from a bank if you need it. When your capital will be big enough you can buy more trucks and employ drivers to drive for you and they will help you make you even more bucks. There is a levelling system too. After every delivery you get experiences. The amount depends on how good you drove from A to B, cargo category, how long was your trip, and from your level. Every new level you get one point which you can spend on one of the skills. For example, if you want to take ADR (dangerous) cargos you will need use point to unlock this. A new level will unlock new customizations and trucks too. If you afraid of grinding don't worry. When you start driving you will see it isn't annoying. You can take a shortcut by using mods or cheats ;). \n\nDid I say mods? Yeah, you can download cars, trucks, graphics mods, maps, etc from Steam Workshop or various modding websites. I prefer to play with stock version but during Christmas, I like [url=https://grimesmods.wordpress.com/]Frosty Winter Weather Mod[/url]. \n\nOk, back to gameplay. Maybe it sounds quite boring just driving around a map but trust me, it's really relaxing. You don't have any table with a score where you compare your stats with friends or other players. Turn on your favourite radio station or listen to your favourite music playlist. Just sit back and relax. You can clear your mind and feel more positive. If you are a hardcore simulator player like me you can set many things to be more realistic. You can have realistic air brakes, sequential or manual gearbox, more realistic physics, and so on. \n\nI play the game with Xbox One Gamepad. I made [url=https://steamcommunity.com/sharedfiles/filedetails/?id=1827794866]guide[/url] how to set it up. Do you need gamepad or steering wheel to enjoy the game? No, you don't. You can play only on a keyboard but I recommend you use mouse for steering and maybe for acceleration and braking too, depends what you prefer. Steam Community tab offers many guides about how to set up things if you will need help with it.\n\nSCS makes during the year some giveaways where you can get free DLCs. Don't forget to make an account on [url=https://www.worldoftrucks.com/]World of Trucks[/url]. It isn't necessary to have it but I recommend it because you will be able to take External Contracts. External Contracts are jobs which you must finish in time, not in-game time but real-time. So if you have 24 hours to finish the job you have 1 day to finish it in real life. External Contracts offer more jobs to choose from. If you didn't find cargo which you want in normal jobs you can find it in External Contracts. The best part of the World of Trucks is events. During the year SCS makes a few events. For example, at Christmas, you will deliver a special Christmas trailer with gifts. After completion, you get some items to your Steam inventory which you can sell on the Steam market or use it in the game to customize your lorry.\n\nGraphics look very good and you can enjoy the game on low-end and high-end PCs too. Everyone can play this awesome game. \n\n[b]Ok, that's all. Now a few end words. I definitely recommend Euro Truck Simulator 2 for everyone who likes driving and want the best relaxing game. Community is nice, friendly and devs keep the game updated. If you want to drive in the USA try American Truck Simulator.[/b]",
            "steam_purchase": true,
            "timestamp_created": 1608728823,
            "timestamp_updated": 1608729142,
            "voted_up": true,
            "votes_funny": 5,
            "votes_up": 107,
            "weighted_vote_score": "0.902404129505157471",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1621751433,
                "num_games_owned": 35,
                "num_reviews": 4,
                "playtime_at_review": 2026,
                "playtime_forever": 6000,
                "playtime_last_two_weeks": 63,
                "steamid": "76561198843131607"
            },
            "comment_count": 1,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "70320295",
            "review": "        试问一款只能开车拉货，然后壮大公司的枯燥的经营游戏，在今日还有什么吸引力？\n        这是一款慢节奏的游戏，几百一千多的路程，往往需要动辄半小时或者一小时以上的游戏时间，在游戏高度快餐化的背景下，这款12年的老游戏在中国注定热度不高。我们喜欢十几分钟一把的“超神”，喜欢几十分钟一局的“白给”，但是谁又愿意花几个小时重复地在景色相似的城市和道路上开着龟速的卡车，做着看似一样的运输任务，并且随时可能超速，肇事，损坏货物导致一趟几小时的货运任务血本无归，在拖着半挂货车倒车入库的时候大费周折？\n       说欧卡模拟是硬核游戏有些牵强，因为现实生活中的卡车司机，尤其是我国的卡车司机的生活远比游戏里要艰难，没有一趟几万块的报酬，却有着数目差不多的罚款，一次几千公里的高速费，路费，修车费和运输报酬相抵所剩无几。但是，这种慢节奏的游戏最吸引我的，就正在于它获得成就的途径是曲折的而不是轻而易举，这种成就感远远比快餐游戏的成就感要长久，深刻，并且人人都可以通过这段曲折的进阶成为游戏里的佼佼者，建立自己的跨国运输公司。这段历程也许需要几十，几百个小时的游戏时长，但是在欧洲大陆上，开着心爱的卡车穿越阿尔卑斯的高山隧道，驰骋东欧茂密的常绿树林，畅行荷兰美丽的向日葵花海，游走在那不勒斯金色的海岸。。。这种不为目的的驾驶心境，不正是最大的收获么。\n       我刻意将首发城市选在斯特拉斯堡，一个很“德国”的法国城市，著名超跑布加迪的故乡。这是西欧的中心，从这里出发前往德国，法国南部，荷兰，比利时，瑞士和奥地利都十分方便，这也为我前期累计资本打下了基础。虽然我还是倒车都不会的萌新，但是里面丰富的地理知识和难得的游戏细节让我沉迷其中。\n       近几年快节奏游戏玩的太多了，偶尔慢下来，也是挺好的。",
            "steam_purchase": true,
            "timestamp_created": 1591340772,
            "timestamp_updated": 1591340772,
            "voted_up": true,
            "votes_funny": 8,
            "votes_up": 188,
            "weighted_vote_score": "0.901933610439300537",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1621832504,
                "num_games_owned": 131,
                "num_reviews": 35,
                "playtime_at_review": 59476,
                "playtime_forever": 267174,
                "playtime_last_two_weeks": 309,
                "steamid": "76561197962302908"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "71896616",
            "review": "This simulator is one of the most relaxing games ever, but can also be very intense when carrying fragile cargo. The scenery is beautiful. When it rains ingame, I get the same warm feeling inside as when it rains in real life. I give it a perfect score because I just can't find anything \"wrong\" with it. \n\nGet this game!",
            "steam_purchase": false,
            "timestamp_created": 1593714440,
            "timestamp_updated": 1593714440,
            "voted_up": true,
            "votes_funny": 1,
            "votes_up": 122,
            "weighted_vote_score": "0.901049375534057617",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1483248787,
                "num_games_owned": 627,
                "num_reviews": 24,
                "playtime_at_review": 1100,
                "playtime_forever": 1478,
                "playtime_last_two_weeks": 0,
                "steamid": "76561197975586307"
            },
            "comment_count": 8,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "7740755",
            "review": "It's just one of those games you can turn on the radio (Game has an interface for internet radio) and just space out as you're driving through Europe's highways. Great game, would recommend to every single person out there!",
            "steam_purchase": false,
            "timestamp_created": 1385404555,
            "timestamp_updated": 1385404555,
            "voted_up": true,
            "votes_funny": 1,
            "votes_up": 534,
            "weighted_vote_score": "0.898253738880157471",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1448260741,
                "num_games_owned": 362,
                "num_reviews": 96,
                "playtime_at_review": 3470,
                "playtime_forever": 3532,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198006560453"
            },
            "comment_count": 13,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "16766004",
            "review": "[h1]TL:DR? See Conclusion[/h1]\n\n[h1]INTRODUCTION:[/h1]\nEuro Truck Simulator 2 (ETS2) is a 2012 vehicle simulation game developed and self-published by SCS Software. It features a massive game world spanning most of mainland Europe, the British Isles, and Scandinavia with each of the cities being connected by the beautifully recreated road systems such as the German autobahn roads.  The game also offers detailed simulation mechanics for hardcore sim players while also offering an alternative 'automatic' mode for the more casual players or beginners such as myself.\n\nAlthough the game's primary and obvious gameplay mechanic consist of driving across Europe, it does feature additional mechanics to give the game a little more spice such as; a progression (level up) system where each level unlocks new cargos, trucks, upgrades and delivery conditions; Truck Company Management system where you manage a trucking company by purchasing / upgrading garages, trucks and hiring drivers to use them.  \n\nStart the game as a driver for hire and earn enough money to build your own trucking empire that will span the entirety of Europe.\n\n[h1]PROS:[/h1]\n+ Beautiful graphics with detailed truck interiors, world environment, and road systems\n+ Good sound effects and assets\n+ Europe is vast and well detailed  giving individuality to each location you visit\n+ Good selection of trucks with a good upgrade and customization system\n+ Various cargo and delivery conditions\n+ Surprisingly contains a relevant progression (level-up) system\n+ Garage and Truck Company management system\n+ Offers different game modes to cater for both hardcore sim players, casuals, and beginners\n+ [url=https://steamcommunity.com/sharedfiles/filedetails/?id=401036567]Easy modding capabilities[/url]\n+ Very fast load times (Even on a mechanical hard drive)\n+ Live European Radio Streaming or custom music playlist using the in-game radio feature\n+ Has a demo in the Store page for anyone who's not sure if this genre is to their liking\n\n[h1]CONS:[/h1]\n- Some micro-stuttering despite the FPS being above 60\n- Low number of pedestrians makes some parts of the cities a bit empty\n- Poor reward for manually parking a trailer (they could have at least given 100xp for it)\n- Anti-aliasing is limited to only MLAA\n\n[h1]NEUTRAL:[/h1]\n+/- The game's overall concept is for a narrow/niche audience.\n+/- The AI needs to attend a Road Courtesy and Discipline class. (Although this does add to the immersion since the player will have to exercise due diligence while driving)\n\n[h1]CONCLUSION:[/h1]\n[b]GREAT SIMULATION GAME.[/b] Playing this game is surprisingly stress relieving and gives off a zen-like feeling while also offering a lot of other contents within the game world. \n\n\n[h1]WORTH IT?:[/h1]\nI can [b]RECOMMEND[/b] this game at full price if you're a hardcore simulation fan but if not, I suggest you purchase this game on a sale. Either way however, I [b]HIGHLY RECOMMEND[/b] purchasing the [url=http://store.steampowered.com/sub/64904/]Delux Bundle[/url] which includes all available DLCs and Expansion Packs as well as SCS' other games such as Bus Simulator, Trucks & Trailers, and Euro Truck Simulator (1).\n\n[h1]FINAL NOTES:[/h1]\nTo be completely honest, I didn't think much of this game when I first bought it because I did not see the appeal in driving trucks around in a game without a plot or a story. I was, however, pleasantly surprised on how much I enjoyed the experience because what the game lacks in story (being a simulation game and all), it makes up for in solid gameplay, excellent presentation, and player-friendly game mechanics. \n\nThe game carries with it a relatively high system requirement so be sure to check that out before making a purchase.\n\n--------------------------------------------------------- \n[h1]Like my Reviews? Follow my Curator's Page:[/h1]\n\n[url=http://store.steampowered.com/curator/6861651-Miyumi%27s-Review-Corner/]Miyumi's Review Corner (MIRECO)[/url]",
            "steam_purchase": true,
            "timestamp_created": 1435518282,
            "timestamp_updated": 1482727784,
            "voted_up": true,
            "votes_funny": 16,
            "votes_up": 180,
            "weighted_vote_score": "0.897340059280395508",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1620869170,
                "num_games_owned": 148,
                "num_reviews": 21,
                "playtime_at_review": 8199,
                "playtime_forever": 32167,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198088167579"
            },
            "comment_count": 33,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "38551150",
            "review": "This game is not for those who want action.\nThis is for the people who want to sit down, and relax.\n\nYou are a truck driver, starting your own business. \nYou start off without a truck, using trucks supplied to you.\nEventually, you buy a truck, from here, you start to really make money.\nBuy more garages, hire employees to drive for you, create a million dollar company.\n\nThe base game is great, but I highly recommend the world expansion DLCs.\n(Going East, Viva La France, Scandinavia, Italia)\n\nThere are some amazing mods on the steam workshop. (Yes! Steam workshop!)\nThese are the ones I use:\n\nGameplay:\nDP's Realistic Traffic\nRealistic Headlight Range v1.1 \n\nGraphics: (Place in mod list in this order)\nFael Environment v3.0\nDarker Graphics  Mod Addon for Realistic Graphics.\nRealistic Graphics Mod v2.0.1\n\nOther:\nGoogle Maps Navigation (Night Version)\nSiSL's Trailer Pack\nReal European Gas Stations Reloaded\n\nI use mods and have some of the DLC, but none of it is necessary, the base game is great.\nAlso most of the mods I use require a good PC, but the base game greatly optimized.\n\nI play on all high settings with all those graphics mods in 1080p.\nIt sometimes lags in cities but it's not that bad.\n\nPC Specs:\nGPU: AMD RX 580 4GB\nCPU: Intel i5-7400 3.0ghz\nRAM: 8gb ddr4\n\nIf you have any questions, ask below and I'll answer asap!\n\nEDIT:\nThis is my setup on an Xbox One controller.\n\nA - Activate\nB - Detach Trailer\nX - Cruise Control\nY - Screenshot (You can change this to whatever you'd like)\n\nLeft and Right bumpers are Indicators.\n\nD-Pad Controls:\nRight - Next Camera\nDown - Light Modes\nUp - High Beam Headlights\nLeft - Windshield Wipers (You can put this on Y if you dont take screenshots.\n\nStart - Engine On/Off\nSelect - Pause Menu\n\nLeft thumbstick in - Horn\nRight thumbstick in - Interior Camera\n\nUpdate:\nI just witnessed a car crash in Italy.\nA cop in a lambo switched lanes and a car rammed them in the back.\nAnd then another car almost hit the second car.\nCheck my screenshots",
            "steam_purchase": true,
            "timestamp_created": 1513979192,
            "timestamp_updated": 1516391257,
            "voted_up": true,
            "votes_funny": 6,
            "votes_up": 220,
            "weighted_vote_score": "0.894392132759094238",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1606449161,
                "num_games_owned": 186,
                "num_reviews": 7,
                "playtime_at_review": 798,
                "playtime_forever": 1140,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198049491380"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "77261113",
            "review": "I like how the devs keep working and improving the product instead of releasing a new version every year.",
            "steam_purchase": true,
            "timestamp_created": 1602208855,
            "timestamp_updated": 1602208855,
            "voted_up": true,
            "votes_funny": 5,
            "votes_up": 143,
            "weighted_vote_score": "0.893792510032653809",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1621641739,
                "num_games_owned": 63,
                "num_reviews": 2,
                "playtime_at_review": 91056,
                "playtime_forever": 94066,
                "playtime_last_two_weeks": 258,
                "steamid": "76561198856874057"
            },
            "comment_count": 5,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "89816891",
            "review": "3 years ago when i bought this game i never new how life changing it would be.. I've made new friends I've lost friends.. i was unable to go out the house on my own and about 6 months after getting the game i took my 1st steps out.. if you use this game correctly and how you want to use it it can help you in so many ways my anxiety is cut in half im able to go out the house my anger has dropped loads and if i am angry i put it on and this game helps me calm down.. so if your thinking of getting the game just buy everything for it make the game best as possible you wont regret it. im a new person because of this game. but it will make you spend lots of money creating your favourite truck set up.",
            "steam_purchase": true,
            "timestamp_created": 1617699228,
            "timestamp_updated": 1617699228,
            "voted_up": true,
            "votes_funny": 14,
            "votes_up": 185,
            "weighted_vote_score": "0.892874538898468018",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1595687084,
                "num_games_owned": 59,
                "num_reviews": 10,
                "playtime_at_review": 3833,
                "playtime_forever": 22606,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198066193629"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "54288865",
            "review": "I bought this 9 days ago, and I've done 63 hours on it since, and I'm a grown-up with a job and a wife.\n\nI saw it reduced to about £3.50; having joked about this game quite a lot over the last year or so (\"What you... drive trucks? On the motorway? and that's it?\") when I saw it on sale for almost nothing I felt like, OK, I've got to see what it's actually like after I've taking the mickey out of it for months. I ended buying a package that included some DLC for about £11 I think; the next day I went back and bought all the map expansions except the recent more expensive Baltic one; the day after that I bought a \"100 greatest hits of Country music\" to put in the stereo (Yeah, I know it's Euro Truck Sim, but what do European truckers listen to? Classic rock? Not as funny). Today I've just bought the Baltic DLC because, yeah, actually, it's well worth it. This whole set for only just more than one EU4 expansion.\n\nThat really is it though. Driving trucks. On the motorway/autoroute/highway. For hours on end. It's astonishing, but somehow it makes a really great game. Very calm, yet somehow also very addictive. You can do it with one hand while you're drinking a beer (unlike in real life). Also, unlike in real life, if you crash you can just load an autosave.\n\nThe driving fines are a bit annoying, especially for traffic lights that change when you're too close to stop, or cars that decide to pull onto a roundabout and ram you when you're half-way round. And in default settings it's much more pleasurable driving in Britain or France where the speed limit is higher than the 56mph limiter on the truck, than in everywhere else where you have to constantly keep your eye on staying under 50. But you can switch all that off; so then, hammering down the autobahn at 85mph in a 45 ton juggernaut is quite something, or even better flat out through town centres ignoring the traffic lights (although you do tend to get crashed into if you do that). And all of it in the company of Dolly and Tammy and the gang.\n\nI really like this game, I totally recommend it. The only complaint I have is that my truck (I've only bought one so far) has a whine in the engine noise that sounds a lot like a dentists' drill (younger readers may not have experienced this delight irl!); I'm gonna buy another truck soon and see if that's got it too.\n\nOne thing I've learned from all this: reversing these beasts requires such an innate understanding of physics that my respect for real truckers has grown enormously. Anyone who can handle one of these things confidently, in the knowledge that anyone you hit is probably dead, deserves a lot of admiration.",
            "steam_purchase": true,
            "timestamp_created": 1564070882,
            "timestamp_updated": 1564070882,
            "voted_up": true,
            "votes_funny": 12,
            "votes_up": 105,
            "weighted_vote_score": "0.892243087291717529",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1620869895,
                "num_games_owned": 260,
                "num_reviews": 1,
                "playtime_at_review": 20826,
                "playtime_forever": 79674,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198050047000"
            },
            "comment_count": 48,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "17082892",
            "review": "Euro Truck Simulator 2 isnt a game you play. its a game that consumes you. its a drug. you dont buy this game knowing that you will loose your social life. but ETS2 takes what it wants. my entire family has abandoned me. all thats left is my fleet of 50 trucks. my girlfriend crys from our bed \"turn off the game, its time to go to sleep\" she dosnt understand. its not a game. I run a Multi-Million doller International trucking empire, sleeping is for the noobs. this game recieves a perfect 10/10 from me, i have lost everything i have ever loved. but, i do have 20 Volvo trucks now....",
            "steam_purchase": true,
            "timestamp_created": 1437083308,
            "timestamp_updated": 1437083308,
            "voted_up": true,
            "votes_funny": 3478,
            "votes_up": 1207,
            "weighted_vote_score": "0.888732492923736572",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1612036996,
                "num_games_owned": 218,
                "num_reviews": 8,
                "playtime_at_review": 19453,
                "playtime_forever": 22355,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198055730399"
            },
            "comment_count": 2,
            "language": "english",
            "received_for_free": true,
            "recommendationid": "35582273",
            "review": "Even though no one understands why am I playing this game, it is self-therapy. I'm playing this since 2013, and I got it from a friend somewhere in 2015, but I gotta thank SCS for making this game. ETS2 is a big relief to me. Almost every day I'm taking a long route and clean my mind and get over \"everyday problems\". \n\nI'm strongly recommending this game to people who are angry everytime or those who are \"covered\" by problems everytime, even though this game seems to be boring, it is, but it also helps you reflecting and clean your mind. At least this works for me.",
            "steam_purchase": false,
            "timestamp_created": 1507493842,
            "timestamp_updated": 1545079902,
            "voted_up": true,
            "votes_funny": 3,
            "votes_up": 84,
            "weighted_vote_score": "0.887094438076019287",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1606505322,
                "num_games_owned": 28,
                "num_reviews": 3,
                "playtime_at_review": 260626,
                "playtime_forever": 310300,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198135570499"
            },
            "comment_count": 14,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "28894531",
            "review": "Considering how much I've played this game, I could say it is a nice game.\nI like the Game , and like the dlc's that come with them.... <<<",
            "steam_purchase": false,
            "timestamp_created": 1483257312,
            "timestamp_updated": 1575295169,
            "voted_up": true,
            "votes_funny": 120,
            "votes_up": 219,
            "weighted_vote_score": "0.886668622493743896",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1618193969,
                "num_games_owned": 304,
                "num_reviews": 64,
                "playtime_at_review": 4784,
                "playtime_forever": 7925,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198146450963"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "71209154",
            "review": "Time to hop into your fancy truck and make various type of deliveries all over Europe. A game that’s still going strong after it’s initial release 8 years ago, this is my take on Euro Truck Simulator 2.\n\n[h1]The Good[/h1][i]Strong community and continuous updates added since release.[/i]\n\nEuro Truck Simulator 2 is still going strong considering that the game was released back in October 2012. The developers have expanded the game as separate DLCs, while making multiple updates to improve the experience. In fact, they’re now giving some of the cities they had on the original release a major face lift, like updating the roads, changing the landscape and making the cities look bigger.\n\nIt should also go without saying that the community for this game is quite strong. I only started playing this game late last year, but I have noticed a lot of positive feedback to the game, especially when it’s through the Steam Awards at the end of the year and this game makes it to one of the featured categories.\n\n[h1]The Bad[/h1][i]No options to manage rest time.[/i]\n\nSomething that eventually started to bother me was that you don’t have a proper option to manage how long you want to rest yourself, the driver. Whenever you want to make a pit-stop (Hotel, Garage, Gas Station, etc.) and rest, you sleep for 8 or 9 hours and you don’t have any ways of adjusting the time.\n\nI understand that resting, especially for a profession such as truck drivers, can require a lot of needed breaks and rests, but if there was a way to give yourself a chance to rest for maybe 4 hours instead, especially in the middle of a job, it can prove to be helpful. The only unintended alternative that could be used to get some short rest would be to take a ferry, but besides that, no other options are currently available.\n\n[h1]The Ugly[/h1][i]So many police vehicles; feels easy to get fined.[/i]\n\nWhether you’re on a job or not, something bothersome that I noticed late was the abundance of police vehicles, not in terms of roadblock or accidents, rather in terms of standard patrol. As a result, I find myself getting hit with speeding tickets quite a bit, even at times when I’m above the limit by 3 km/h at times.\n\nI can’t recall if there was an option to lower the frequency of police patrol or not, but if there is, considering that this was on the default setting, this gets annoying after a while, especially when the fine for speeding is an easy loss of $1,000.\n\n\nWhile the negatives are profound, it doesn’t take away the simplicity and easily addicting nature of this game. As noted before in the intro, the fact that the game is 8 years old and still going strong in the community and development side, there’s absolutely no reason to not give this game a go. Whether you play it for a few hours or it becomes your next year long time waster, pick this game up and go for a drive.\n\n[h1]Developers (Headquarters)[/h1]\n[list]\n    [*]SCS Software (Prague, Czech Rep.)\n[/list]",
            "steam_purchase": true,
            "timestamp_created": 1592891661,
            "timestamp_updated": 1593831431,
            "voted_up": true,
            "votes_funny": 2,
            "votes_up": 110,
            "weighted_vote_score": "0.88618922233581543",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1455978827,
                "num_games_owned": 160,
                "num_reviews": 14,
                "playtime_at_review": 16185,
                "playtime_forever": 24324,
                "playtime_last_two_weeks": 0,
                "steamid": "76561197970668846"
            },
            "comment_count": 7,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "16356056",
            "review": "Because of age and health issues I was stopped from driving unless I drove a hand adapted vehicle, which I declined. This game puts me again behind the wheel of a vehicle and I have spent in excess of 230 hours playing this simulator, I love this game and hope further expansion DLCs are soon forthcoming, the mods take this game even further, I have included American trucks, military mods and more paint jobs than I thought possible, immersed in the game you actually do feel as though you are on the road, the detail in trucks cities and countryside, and yes the A'holes that should never be allowed a license to drive are in the game, I let the AI know that if you do things to me I will do unto you, and I did, costing me £100s of pounds in repair bills and fines, but the satisfaction you get when you shove that car or truck into a river if one is close by is to much to resist, this game is for all ages, and I think it teaches all how to drive correctly, the young once familiar with driving a simulator like this will have no trouble obtaining a license, and keeping it clean, take your frustrations out on the traffic AI and drive squeaky clean in the real world, I highly recommend this game.",
            "steam_purchase": false,
            "timestamp_created": 1434199855,
            "timestamp_updated": 1434199855,
            "voted_up": true,
            "votes_funny": 25,
            "votes_up": 115,
            "weighted_vote_score": "0.886160612106323242",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1621722022,
                "num_games_owned": 203,
                "num_reviews": 8,
                "playtime_at_review": 13061,
                "playtime_forever": 19462,
                "playtime_last_two_weeks": 724,
                "steamid": "76561198082171791"
            },
            "comment_count": 7,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "29337678",
            "review": "I'm a 35 year old female who doesn't drive in real life, somehow I'm addicted to this game!\nI bought this after Christmas in the winter sale (also bought the DLC scandinavia and going east) and already have nearly 200hours of playtime on it and I'm ranked 33 ingame with 10 garages and a bunch of drivers, working on achievements now.\n\nSo why do I love this game?! Erm ..well even on the simpliest driving settings (I play using keyboard and mouse) I've come a long way and  learned so much about driving a truck and actually getting an education about city names in europe lol \nIn my first few days I wasn't using lights half the time, cruise control, indicating, looking left and right at junctions, moving lanes in time on the motorways (and hitting barriers/other vehicles) I was getting fined for everything...including falling asleep at the wheel. Keep your fuel tank topped up too or find out the hard way when you run out and need a tow lol \nI can now do the harder reverse parking and yesterday I finally got the achievement for no fines/damage and in-time urgent delivery for 1000km lol a real achievement for me :)\nThis game is fun in many ways, I like recruiting new drivers and training them in certain areas (kind of in my head give them a backstory! Like Ethan who I recruited and is based at my Cambridge branch is most skilled at delivering expensive cargo, he comes from a rich family that think hes at Uni but hes dropped out to \"travel europe\" literally!)\nI also love seeing real landmarks in cities like the fortress in Salzburg, along with the beautiful mountains.\n\nAnyway, so even if you're not usually into driving games - this might surprise you! Definately value for money :)",
            "steam_purchase": true,
            "timestamp_created": 1484750631,
            "timestamp_updated": 1484752192,
            "voted_up": true,
            "votes_funny": 13,
            "votes_up": 120,
            "weighted_vote_score": "0.885757863521575928",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1618245103,
                "num_games_owned": 734,
                "num_reviews": 9,
                "playtime_at_review": 59192,
                "playtime_forever": 67212,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198026310847"
            },
            "comment_count": 16,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "20563090",
            "review": "I did a review before, Back then i had 18 Hours playtime. Now i gained a lot more hours on it :D\nBack then my Review was not very detailed and  since then [i]Euro Truck Simulator 2[/i] got updated constantly and has much more to offer by now, i decided to redo my review. So let's begin shall we? :3\n(For those who don't want to read a book and expect a review in form of an IGN Joke - 10/10 would relax again)\n\n[h1]The General Idea of the Game/Whats it about[/h1]\nThe easiest answer would obviously be \"Driving Trucks\" B-But wait! That's not all there is to know silly. This game is in all reality a \"Relax and listen to a Podcast/Music while you drive Simulator\". This game is about you, your truck and an open Europe to travel across. How you do it, what trucks you will drive, what cargo you will haul or the places you will see is all up to you. \n\n[h1]Gameplay[/h1]\n\n[b]Game Start and Quick Jobs[/b]\nThe game starts you off as a hired driver. You have no money, no truck and only a rusty empty garage to work with. So what do you do? You work your butt off with \"Quick Jobs\" In these jobs you will get put inside a truck and just drive to the destination. In this starting phase of the game your goal should be to make as much Money as possible and of course to level up (More to the level system below). \n\n[b]Freight Market and your own Truck[/b]\nAfter you are level 6 or 7, which is about 2 hours in the game, you finally have enough Money to buy your first truck!\n(You could also take a bank loan and do it faster. This is where the game starts to become fun and somewhat addicting. There you sit. In your own little truck, in your rusty garage. What now? Now you can start making the big money. Instead of getting hired for an apple and a hug, you will now be paid directly by the Companies. All that freight money goes into your pocket. So you select a freight from the \"Freight Market\" Unlike \"Quick Jobs\" you will not just spawn in place. You have to physically drive to the loading spot. So don't choose something on the other side of the Country because you will have to drive there. This will be your life from now on. You pick a job, you drive to the loading dock, pick it up, and deliver it to the destination. Then you will get paid, and based on how you did you will get rated with XP to level up. \n\n[b]The Level System:[/b]\nAs mentioned many many times above. The game has a level system. You earn XP to spend in the following categories to unlock freight and boost income.\n\n[table]\n    [tr]\n        [th]Skill[/th]\n        [th]Description[/th]\n    [/tr]\n    [tr]\n        [td]ADR[/td]\n        [td]Lets you haul more dangerous cargo like gasoline or toxic stuff[/td]\n    [/tr]\n    [tr]\n        [td]Long Distance[/td]\n        [td]Lets you take on jobs with a longer distance which will be higher paid[/td]\n    [/tr]\n    [tr]\n        [td]High Value Cargo[/td]\n        [td]Expensive equipment such as diggers and forklifts[/td]\n    [/tr]\n    [tr]\n        [td]Fragile Cargo[/td]\n        [td]Glass, Cars, Electronics and so on[/td]\n    [/tr]\n    [tr]\n        [td]Just-in-time Delivery[/td]\n        [td]Deliveries with a shorter but more rewarding deadline[/td]\n    [/tr]\n    [tr]\n        [td]Ecodriving[/td]\n        [td]Makes your trucks consume lesser fuel[/td]\n    [/tr]\n[/table]\n\nIn addition to your own skillset, your hired drivers will also level up in these. Which makes a level 30 driver far more productive than a rookie. Hired drivers brings us to the next aspect: Management \n\n[b]The Management Aspect[/b]\nAfter you made some Money, leveled up, bought more trucks and upgraded + bought new garages. You should start hiring drivers on your own. They will deliver cargo for you, just like you do. You equip them with a truck and they will bring in money. At first very little, up to 1000€. But soon you will have lots of drivers, and the higher their level, the more money they will make you. In the late game you will have so much money that you don't know what to do with it. Which is one of my biggest concern about the game. Once you reach a certain point you will just never run out of money. You will have millions and millions. Which makes it so the late game is literally only about the driving aspect. Which is not a major problem for me, but it might be for you, so please keep that in mind.\n\n[b]Tuning[/b]\nAs your level grows you will unlock more trucks and more parts for you to customize your truck with. You can even install mods that add more tuning parts. (Like you can install mods for basically everything in this game) You can also upgrade the trucks of your hired drivers, though that doesn't really do much since you won't see them on the road. :D\n\n[h1]Graphics, Audio and Performance[/h1]\n\n[b]Graphics[/b]\nDon't expect Crysis. But the game looks beautiful enough in my opinion. The weather effects just got overhauled and I catch myself sitting there thinking \"What an amazing View, lets take a Screenshot of that\" far more often than in a lot of other Games. The Truck models look beautiful and they are all fully licensed. The Dashboards all are functional and you really feel the love SCS (the developer) has put into them. I had some odd Shadow bugs earlier on but it seems they have been fixed since then\n\n[b]Audio[/b]\nThis is one of the strongest aspects of this game. To be fair, SCS improved quite a lot here as well, compared to when the game was first released. From the sound of rain dripping on your cabin, to the rumbling of a thunderstorm, the sounds are just beautiful. The trucks themselves sound amazing! And not just the engine sounds, also the little levers in the truck itself has sound, and it just helps to immerse you in this game so much. Only the beeping sound. when you reverse from inside the cabin is way too loud in my personal opinion. I have never used a sound Mod since playing this game. I know they exist, and of course I use them for modded trucks but i never used one that changes the original sounds, but i just never felt the need to do so.\n\n[b]Performance[/b]\nNow i have to say my PC is one of the weakest. I'm still using an old ATI HD4650 and a dual core processor, but I can get the game to a steady 30-35 FPS (20 in cities) on Medium Settings. If you use mods, especially big ones, such as the ProMods Map or the TSM Map, that number will obviously decrease, but I'm very happy with that aspect of the game.\n\n[h1]Pros and Cons + Verdict[/h1]\n\n[b]Pros[/b]\n+ Fun and Relaxing Driving\n+ Fully Licensed Trucks\n+ Customization\n+ Big and Active Modding Community incl. a MP Mod\n+ Decent AI\n+ Amazing Audio\n+ Great Performance\n+ Good Looking\n+ Full Steering Wheel and Controller Support\n\n[b]Cons[/b]\n- Late Game far too Easy\n- Managment Aspect not deep enough\n\n[b]Verdict[/b]\nIts one of my favorite driving games and the fact that I can only find 2 flaws with it makes me give it a strong 95%. If you are into trucks, or just want a relaxing open world driving game, get it.",
            "steam_purchase": false,
            "timestamp_created": 1452957935,
            "timestamp_updated": 1543239372,
            "voted_up": true,
            "votes_funny": 14,
            "votes_up": 98,
            "weighted_vote_score": "0.885706067085266113",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1622298132,
                "num_games_owned": 229,
                "num_reviews": 61,
                "playtime_at_review": 13664,
                "playtime_forever": 16864,
                "playtime_last_two_weeks": 113,
                "steamid": "76561198388638894"
            },
            "comment_count": 31,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "90354151",
            "review": "[quote]Looking for more reviews from pens of gamers and enthusiasts? Look for [url=https://store.steampowered.com/curator/37072886/][b]Devils in the Detail[/b][/url].[/quote]\n\nTl;dr, trucks go vrooooom!\n\nI won't pretend to know anything about trucks, retarders, air brakes or trailer stability and I've never been in an actual truck, but I felt drawn by this game. I bought it on a whim, in a bundle with a few DLCs at the beginning of 2021 when my mind was elsewhere, in a space between nowhere and anywhere else. Map expansions were Beyond the Baltic Sea, Going East! and Scandinavia, along with Heavy Cargo Pack, High Power Cargo Pack and Cabin Accessories.\n\n[h2]An ETS 2 story[/h2]\n\nWhat I thought would be a curious and sporadic dive into trucking and highways turned into many hours of taking the longest possible hauls, chilling and meditating as the kilometers zoomed by, accompanied by my favorite radio or a post-rock soundtrack. It turned into a window to another reality, a life never lived. It turned into driving into the unknown, charting all the roads and seeing all the sights in this wonderful diorama of Europe where you don't need vaccine certificates to travel.\n\nWhen I started, I was confounded by all the options on offer. There's an ocean of things you can adjust. From gameplay options, where you can turn a casual sim into a hardcore driving simulation, to many button or key assignments and game preferences. Audio setup deserves a special mention with 16 options to fiddle with. You can adjust sound levels of individual truck and ambient sounds, fine-tuning until your ears are satisfied with all the noise reaching them, and your brain hums along with the engine. I've played this in the most plebeian way possible; mouse, keyboard, controller occasionally and a single monitor, but the control settings allow for using wheels, pedals, multiple monitors, and even Tobii eye tracking. Visual settings also offer numerous options for tinkering.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2457181810\n\nThe game starts you in a country of your choice, with no truck of your own and you must work and drive for others until you can afford one. That means only quick jobs from the market with rented equipment. Or you could get a bank loan. I drove, toiled and sweated for companies in Norway until I got some experience under my belt and saved enough for a shiny new truck. There are seven truck manufacturers and plenty of truck variations that can be further customized with many options and parts, but I settled for a yellow Volvo FH Classic Sleeper. There was no reasoning behind it other than that I liked the way it looked. And with the real adventure started, it became my chill out zone and my retreat into the diorama for over 200 hours.\n\nI've plumbed the depths of the Cargo Market and External Contracts that you can use if you link an optional, free World of Trucks account to the game, broke many laws and violated many red lights and wrong ways while scouring every inch of the map, hauling cargo the longest possible route I could find. Careful with the cargo one way for a safe delivery, free spirited the other way, just driving around, enjoying the roads, looking for sights and discovering miniature versions of cities that consist of a few houses or buildings, landmarks if the city has any, and a lot of company lots, garages, and resting spots. Neon hotel lights became my best friends.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2457181291\n\nCountryside always fared much better, offering, among other things, balloons, monuments, strange statues, fighter jets on pedestals, old castles and forts, windmills and verdant fields. The game is capable of producing some seriously stunning and breathtaking moments of sightseeing. In all my travels, one constant companion was the game's mostly pedestrian traffic with moments of profound cosmic loss of self, leading to weird occurrences. I've witnessed freak highway accidents, cluttered roundabouts like some tangled caterpillars, and some questionable driving ethics that led to crashes. The only penalty for any violation is an instant fine and a percentage increase in damage for your truck, which stays visually in pristine condition. The game features no visible damage on vehicles.\n\nI can't remember when I hired my first company driver and started dabbling in logistics, truck and trailer customizations. Her name is Ella, and she's now probably a more skilled driver than me, with maximized points in multiple of the game's six trucking skills. She's definitely the highest earner. I stopped hauling cargo and just drive around, searching for sights unseen, sporadically glancing at a blue news ticker telling me what the rest of my 29 drivers are doing and how much money they made — or lost due to a bad trip. My company keeps growing. 17 garages for now, some stand empty until I find the drivers satisfying my standards, most are dotted with various truck and trailer combinations, hauling cargo all over Europe and parts of Russia. The one in Oslo holds my first yellow Volvo truck, resting peacefully. He deserves it. I've bought a new beefier, larger Volvo truck. I liked the sound the engine made with my current audio settings.\n\nOn one of the recent trips, I stopped at a resting stop in the middle of Germany to get some sleep and had the weirdest dream, even a nightmare, of breaking free from the diorama and soaring over the map. Buildings and forests turned into cardboard cutouts, gaping black voids opened between cities, traffic disappeared into nowhere, water floated in mid-air and my mind kept thinking how easily shattered the illusion of the world is. I awoke with a start, right before two identical humanlike dolls on bicycles almost ran me over on the bank of a levitating river. If this is all an illusion, a scam, it is still a splendidly crafted scam. I ascribed my chaotic thoughts to lack of sleep, not enough food, and never looked back.\n\nAll my wanderings and sleepless nights run on an i7-7700, RTX2070, 32GB of RAM, an SSD, and in 1080p/60. In spite of occasionally weird traffic, I've encountered no serious issues, no falling through the void symptoms, no slowdowns and the simulation never crashed. The loading times are fast and there aren't many of them. I've noticed some slight visual glitches, but nothing really immersion breaking. I was running the Realistic Graphics Mods v5.2 by Frkn64, but I removed it when SCS pushed a lighting overhaul. The only mods I use now are Fael Environment V3.1 for improved foliage and SiSL's Mega Pack for cabin accesories and less lonely nights.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2457182009 \n\nI still haven't seen and heard all the sights and sounds of the current map, and SCS Software keeps adding more and improving and reworking older parts, visuals included. Yes, each part is a DLC, but a DLC that adds huge chunks of Europe and new things to haul, transport, see and explore, and new achievements to earn. I don't think they intend to stop any time soon. It's incredibly impressive what's on offer in this game or, dare I say, way of life and it's often on sale with bundles to get your road not taken started. Eventually, we must all find our quietest place in the loudest ones. ETS2 was, and still is, mine. Perhaps it can become yours as well.\n\nP.S. I still don't know what a retarder is.\n\nTake a peek inside the [url=https://steamcommunity.com/groups/thecabinetofcuriosities/discussions/0/2272575584124463561/][b]Cabinet of Curiosities[/b][/url] if you like to walk off the beaten path and only sometimes return to the main roads.\n\n[url=https://store.steampowered.com/curator/30168383][b]Follow the Average Achievement Hunter Curator for reviews and useful information on Steam achievements[/b][/url]: Lots of achievements, many of them time consuming. Nothing troublesome or hard, but every content DLC is required for 100% and new content is coming regularly.",
            "steam_purchase": true,
            "timestamp_created": 1618497874,
            "timestamp_updated": 1619080616,
            "voted_up": true,
            "votes_funny": 9,
            "votes_up": 106,
            "weighted_vote_score": "0.884411454200744629",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1617217074,
                "num_games_owned": 430,
                "num_reviews": 1,
                "playtime_at_review": 235,
                "playtime_forever": 381,
                "playtime_last_two_weeks": 0,
                "steamid": "76561197991104879"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "32857980",
            "review": "So this is the first time I've done a review in a long time but wanted to leave one for this game.\nI took the plunge on this mainly as I got the Oculus and saw people saying fun it was. At first I was like how fun can it be.....then I found out.\nOk the graphics aren't of the likes of modern days but it holds up well for it ages and has slot of charm.\nI've only played a few hours but can't wait to go back for another blast.\nSlap on a custom playlist, out on your trucker hat and hit the road...just be careful as you will be fined for not following the road rules....so far in -£2300 and topple my Tesco wagon...but still having a blast.\nGive it a shot and you'll understand why people like the game so much, the physics of the trucks, the feel of it all...well put together. As said it not my normal go to type of game but it's hellafun and glad I got it...specially for the sale price you got nothing really much to lose.\nIf you have the vive or oculus then give this a try it's excellent  especially if you have a steering wheel.\nTo use it for VR when you download it got to preferences then Betas and select Oculus 1.4 option.\nWhen you do that go to General then set launch option; put -oculus in there and off you go.\nHere's a link to a video that gives a guide.\n\nhttps://youtu.be/4j3WsycbPU4",
            "steam_purchase": true,
            "timestamp_created": 1498575294,
            "timestamp_updated": 1498575294,
            "voted_up": true,
            "votes_funny": 18,
            "votes_up": 99,
            "weighted_vote_score": "0.883970856666564941",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1512076440,
                "num_games_owned": 580,
                "num_reviews": 33,
                "playtime_at_review": 5689,
                "playtime_forever": 7284,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198056739666"
            },
            "comment_count": 9,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "29814254",
            "review": "[h1][b]A quick introduction[/b][/h1]\n\nI will start by adressing the elephant in the room. [b]Yes, the game has 2 steam awards, and yes, they are well-deserverd by the game for being the amazing simulator that it is.[/b] Euro Truck Simulator 2 is not only a great experience that everyone can enjoy, but also a masterpiece in its own right. With such a large and active fanbase, the game grew with the help of its community: mods, multiplayer, new skins, trucks, etc., besides the huge amount of content it has been given from the developers. Official content is still being added to the game to the current day, be it in the form of patches, expansions or bug fixes. This makes my first point: buying ETS2 is a smart investment, since the developers truly care about the game and continue to update it and listen to their fanbase. I can make a quick prediction and say that ETS2 will still have updates or expansions coming out for at least a year or two more after the writing of this review. \n\n[h1][b]What exactly is Euro Truck Simulator 2? (Gameplay)[/b][/h1]\n\nETS2 is a truck driving simulator, but not only that. It places you into the position of the manager of an entire international delivery company. The goal of the game, even though most players will just say it's to relax or to have fun (which is also true), is actually to expand your company, hire more drivers, buy more trucks, more garages and obtain the monopoly for deliveries in Europe. The game takes this simple concept and manages to add an astonishing complexity to it (at first sight only, because after the first 20 hours or less in-game, you'll realize that the gameplay is actually simple and enjoyable). As the manager, you can also make deliveries yourself, which is how you will get your company up and running before you have the money to hire drivers to do that for you. You will start by doing quick jobs for various employers, with a truck given by them for the specific delivery, and your first objective is to buy your own truck so you can start taking jobs from the freight market, which get you more income. Once you get your own truck, it's all yours: you need to take good care of it, repairing it, refuelling it, being careful not to get fined for your actions on the road, and so on. From that point onward it is your job to build a strong and succesful business. As you do more deliveries and manage to get more experience (both literally, for leveling up, and figuratively, because you will learn the mechanics of the game better and better), you will earn skill points with each level up. There are a variety of skills to choose from, including getting better pay for different types of jobs (fragile cargo, urgent deliveries, ADR deliveries, valuable cargo), less consumption of fuel, or being able to deliver cargo across longer distances. Your employees also have skills, a feature that on its own opens lots of possibilities for company management. \nIf the information here or on the store page doesn't quite answer all of your questions, I'll tell you that there is also a demo for this game available to download on Steam so you can try the game out. \n\n[h1][b]But is it accurate? (Driving mechanics)[/b][/h1]\n\nBefore I start explaining the mechanics of the game, please take note that I'm not a truck driver and have never driven a truck before, so excuse me if I don't have all of my facts straight. From my 90 hours of playing the game at the time of writing this review, I'd say that the driving in this game is absolutely beautiful. First of all, the complexity of the mechanics is fully customizable, so everyone from the newest player to the veteran trucker are able to enjoy the game. The driving is relaxing, be it day or night, rain or sun, highway or forest road, because it doesn't require that much focusing, but only as much as to not pass the speed limit, to avoid other people in traffic and to not come tumbling off the road. That gives you time to enjoy the wonderful scenes you'll pass by, which I'll be talking about in the next section. On-board the truck you have every switch you need, meaning headlights, wipers, the horns (air, regular, light), the handbrake, the toggle for high beams, for the beacon and the turning signals. It has everything you would want and need from a proper simulator of real life driving, so don't expect a truck racing game. The only thing that is a tiny bit more difficult is the parking, but there's also a solution for that. The parking is skippable in every delivery, while denying you a small amount of experience. But as you gather more knowledge and start learning what's what, parking should immediately become a breeze after a few hours of gameplay.\nAlso, going a little off-topic, you also have a radio. You can upload your own playlist of music into the game and listen to it while on the road. Genius. [b]Genius[/b], I say. \n\n[h1][b]That's all well and good, but how does it look? (Graphics)[/b][/h1]\n\nDo not go into the game expecting it to look like it was made with Unreal Engine 32. The game came out a good amount of time ago (I'd even go as far as to call it a classic now, heh), and I can say it still looks decent to this day. The in-game world still is wonderful if you're willing to sit for a bit and think about how old the game is. Even if it doesn't have the latest graphics, ETS2 doesn't fail to impress, making up for raw graphical power in great world design. The landscapes in the game are beautiful, and the vehicle models still manage to look good and blend into the environment perfectly, giving the game a really special ambiance and relaxing potential. It is easy to get immersed into the massive world and if you're not careful you can lose hours driving your virtual truck around (as it happens to me quite often).\nBut if I were honest, the question here is how good you [b]can[/b] make it look. As I have said before, the game has such an active community, and modders are no exception. There are a variety of graphic mods to choose from both in the Steam Workshop and outside of it that do a wonderful job at enhancing your visual experience, making the game not only graphically impressing, but also making you want to get into the photo mode and snap some shots of your journey through ETS2's Europe. \n\n[h1][b]So...did you enjoy it? (My personal experience)[/b][/h1]\n\nThe short answer would be yes, absolutely. But the answer worthy of this review is that I just spent so many hours into this game, in which everything you basically do, if we were to dumb it down to an extreme level, is drive around and turn left or right at some points, and I can't even explain why exactly. ETS2 just has a mesmerizing atmosphere to it, making the game beautiful in its own way, and being one of the most relaxing games I have and will ever play. Other simulators can't even get near its level (except American Truck Simulator, made by the same developers and based on the same concept), because for me, ETS2 will always have that [i]je ne sais quois[/i], that *something* which always makes me come back to it and do yet another delivery, over and over again. In other words, everything about the game is enjoyable, from the relaxing driving to the sweet feeling of getting another truck or further customzing your current one, to the trance induced by the exquisite feeling of being alone with the road, and for that, Euro Truck Simulator 2 wil always and forever have a special place in my heart.\n\n[h1][b]Conclusion[/b][/h1]\n\nIf you are looking for a relaxing driving experience with various customization options, a variety of trucks, perfect world design, mesmerizing atmosphere and most of all, a detailed company management gameplay component, then I am sure you will not regret buying this game. If you need further convincing, please do download the demo (which is available on Steam).",
            "steam_purchase": true,
            "timestamp_created": 1486691740,
            "timestamp_updated": 1486691889,
            "voted_up": true,
            "votes_funny": 5,
            "votes_up": 133,
            "weighted_vote_score": "0.883758485317230225",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1496054563,
                "num_games_owned": 307,
                "num_reviews": 3,
                "playtime_at_review": 20816,
                "playtime_forever": 26385,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198000529222"
            },
            "comment_count": 25,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "9746754",
            "review": "Are you fucking kidding me, This game puts any other simulator to shame.  You're talking 24 hour long transportation of the finest fucking IKEA furniture, Running them what seem to be green lights but in Euro they're yellow or some shit like that who knows, not you, you're too busy driving 60 tons of Soviet Russia's finest Vodka and Prostitutes, who cares what a light means.\n\nWhen you're all alone on the highway is the best time, turn off the heallights and let the magic happen, some of that crocodil cocaine will keep you pumping through the fear as you barrel down the autobahn in reverse with kilos of petroleum and wooden dutch shoes in tow.\n\nWhen you make it to that destination though, and you back up that fat trailer ass and just dump your load all over the parking lot of some Wal-Mart in Norway, the satisfation you get when at least 10% of your cargo is still intact makes you a god amongst other mobile mortals.  A King of the Transportation Ring.  Europeans Finest.",
            "steam_purchase": true,
            "timestamp_created": 1396806695,
            "timestamp_updated": 1396806695,
            "voted_up": true,
            "votes_funny": 27,
            "votes_up": 592,
            "weighted_vote_score": "0.883564591407775879",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1578806590,
                "num_games_owned": 81,
                "num_reviews": 9,
                "playtime_at_review": 98,
                "playtime_forever": 98,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198049188506"
            },
            "comment_count": 4,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "88330430",
            "review": "This game should be called \"Zen and the Art of Logistics\"\n\nThis game is meditation, the thought-cleansing effect of driving a thousand kilometers along the highway cannot be understated. Occasionally poor AI choices behind the wheel may spike your blood pressure but overwhelmingly ETS2 is a relaxing thing to stick on after a rough day. And if that's not enough you can just drive into oncoming traffic in your indestructible death machine.",
            "steam_purchase": true,
            "timestamp_created": 1615594632,
            "timestamp_updated": 1615594632,
            "voted_up": true,
            "votes_funny": 33,
            "votes_up": 86,
            "weighted_vote_score": "0.883532583713531494",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1622450785,
                "num_games_owned": 259,
                "num_reviews": 7,
                "playtime_at_review": 67361,
                "playtime_forever": 98981,
                "playtime_last_two_weeks": 2612,
                "steamid": "76561198272288703"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "63957482",
            "review": "Hey all!\n\nI've played ETS2 for over a thousand hours now and I feel like it's time to write a review on the game that has been my favorite game to play for around 4 years now. I play a lot of games, but this one is surely my favorite, although it might seem like the most boring driving game out there for some people. It's really not, and I'll explain why. \n\nIn Euro Truck Simulator two, you drive around with your truck and trailer, pick up some freight and deliver it. Easy as that, right?? Well no. It's not easy really, there's AI drivers that screw you over, and there's laws to follow, unless you don't want that, you can turn that feature off. The most important part of driving around is the world around you. The scenery in ETS is great. The map is big, really big and has a lot of beautiful spots you can drive to. \nThis game is even more fun when installing mods. Some make the map bigger, some make you have different trucks or cars, or more trailers to choose from.. It's overall just a lot of fun. \n\nIt's relaxing as well, you don't have to keep paying attention. I personally drive with a Logitech G29 and a shifter which makes the game even more fun to play if you ask me. I love ETS. \n\nI highly recommend playing this. \nThanks for reading!",
            "steam_purchase": true,
            "timestamp_created": 1582410014,
            "timestamp_updated": 1582410014,
            "voted_up": true,
            "votes_funny": 6,
            "votes_up": 85,
            "weighted_vote_score": "0.883296012878417969",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1428323210,
                "num_games_owned": 247,
                "num_reviews": 8,
                "playtime_at_review": 650,
                "playtime_forever": 1300,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198041479186"
            },
            "comment_count": 6,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "12245381",
            "review": "After 7 hours playing this game, i was about ready to give up my career as a European Truck Simulator 2.\n\nBut then something magical happened. \nI inadvertently pressed the 'R' key whilst driving, and discovered radio. \n\nRadio Gothic from the Czech Republic saved me. \nBlaring songs about god knows what in some bork bork language reinvigorated my will to drive trucks in Europe. \n\nThank you based Radio Gothic/10",
            "steam_purchase": false,
            "timestamp_created": 1411736214,
            "timestamp_updated": 1411736214,
            "voted_up": true,
            "votes_funny": 306,
            "votes_up": 340,
            "weighted_vote_score": "0.883076369762420654",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1611666640,
                "num_games_owned": 248,
                "num_reviews": 16,
                "playtime_at_review": 2182,
                "playtime_forever": 4056,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198107109105"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "53970544",
            "review": "https://steamcommunity.com/sharedfiles/filedetails/?id=1797647836\n\n>Started a job\n>60,000 Euros in my pocket\n>Didn't sleep or repair truck in a long time\n>Empty road. Racing vibes kicked in.\n>Speed limit? What speed limit?\n>Also, sleep is for the poor\n>7 speed violations and 4 'avoiding sleep violations'\n>'Maybe I should slow down'\n>'customer is expecting shipment soon'\n>'f--- it' . Floor it.\n>Another 2 speeding violations\n>Last sharp turn up ahead. That's it.\n>Sleep deprivation causing me to doze off\n> Zero f--s given, steered the truck like it's NFS Carbon\n>It's not\n>Truck flipped off and landed upside down.\n>F---\n>Towed the truck to service centre.\n>Final balance -383 euros.\n\nNow that's [i] simulation [/i]",
            "steam_purchase": true,
            "timestamp_created": 1562613044,
            "timestamp_updated": 1562674470,
            "voted_up": true,
            "votes_funny": 353,
            "votes_up": 127,
            "weighted_vote_score": "0.882304072380065918",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1622403062,
                "num_games_owned": 67,
                "num_reviews": 2,
                "playtime_at_review": 260411,
                "playtime_forever": 349097,
                "playtime_last_two_weeks": 2485,
                "steamid": "76561198052013380"
            },
            "comment_count": 10,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "56824115",
            "review": "This game will never get boring to me...Totally Recommended..",
            "steam_purchase": true,
            "timestamp_created": 1573292547,
            "timestamp_updated": 1573292547,
            "voted_up": true,
            "votes_funny": 20,
            "votes_up": 136,
            "weighted_vote_score": "0.882183253765106201",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1444433696,
                "num_games_owned": 394,
                "num_reviews": 5,
                "playtime_at_review": 3621,
                "playtime_forever": 4760,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198042058579"
            },
            "comment_count": 13,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "8237600",
            "review": "NOONE KNOWS WHY THIS GAME IS FUN\nTHE WORLD'S LARGEST MYSTERY SINCE WOMEN",
            "steam_purchase": true,
            "timestamp_created": 1387841969,
            "timestamp_updated": 1387841969,
            "voted_up": true,
            "votes_funny": 28,
            "votes_up": 509,
            "weighted_vote_score": "0.881791889667510986",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1618164930,
                "num_games_owned": 88,
                "num_reviews": 7,
                "playtime_at_review": 9090,
                "playtime_forever": 12337,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198820386114"
            },
            "comment_count": 9,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "73204330",
            "review": "---{Gameplay}---\n☑️Try not to get addicted\n🔳Very good\n🔳Good\n🔳Nothing special\n🔳Ehh\n🔳Bad\n🔳Just dont\n\n---{Graphics}---\n🔳Masterpiece\n🔳Beautiful\n☑️Good\n🔳Decent\n🔳Will do\n🔳Bad\n🔳Awful\n🔳Paint.exe\n\n---{Audio}---\n🔳Fascinating\n🔳Very good\n☑️Good\n🔳Decent\n🔳Not too bad\n🔳Bad\n🔳Earrape\n\n---{Audience}---\n🔳Kids\n🔳Teens\n🔳Adults\n☑️Everyone\n\n---{PC Requirements}---\n🔳Check if you can run paint\n🔳Potato\n☑️Decent\n🔳Fast\n🔳Rich boi\n🔳Ask NASA if they have a spare computer\n\n\n---{Difficulity}---\n🔳Just press a bunch of buttons\n🔳Easy\n🔳Significant brain usage\n☑️Easy to learn / Hard to master\n🔳Not so easy\n🔳Difficult\n🔳Dark Souls\n\n---{Grind}---\n🔳Nothing\n🔳Only if you care about leaderboards/ranks\n🔳Isnt necessary to progress\n🔳A bit grindy sometimes\n🔳Average grind level\n☑️A bit grindy\n🔳Insanity\n\n---{Game Time}---\n🔳Long enough for a cup of tea\n🔳Short\n🔳Average\n🔳Long\n🔳Depends on you\n☑️Endless\n\n---{Price}---\n🔳Just buy it\n☑️Worth the price\n🔳Wait for sale\n🔳Maybe if you have some spare money left\n🔳Not recommended\n🔳Dont throw money into a rubbish bin\n\n---{Micro-Transactions}---\n🔳EA\n🔳Mobile Game(Necessary if you don’t want to wait 15 weeks to construct a toaster)\n🔳”Premium” Currency AND Normal Currency\n🔳”Premium” Currency OR Normal Currency\n🔳Quick way to advance\n🔳Fortnite(Skins/Emotes/Etc)\n🔳Only to show off big time\n☑️Some DLC's\n🔳None\n\n---{Bugs/Glitches}---\n🔳Never had any\n☑️Minor bugs/glitches\n🔳Few bugs/glitches\n🔳Can get annoying\n🔳Ruining the game\n🔳The game itself is a big terrarium for bugs/glitches\n\n---{?/10}---\n🔳1\n🔳2\n🔳3\n🔳4\n🔳5\n🔳6\n☑️7\n🔳8\n🔳9\n🔳10",
            "steam_purchase": true,
            "timestamp_created": 1595588446,
            "timestamp_updated": 1595588446,
            "voted_up": true,
            "votes_funny": 38,
            "votes_up": 224,
            "weighted_vote_score": "0.880655467510223389",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1511848634,
                "num_games_owned": 560,
                "num_reviews": 287,
                "playtime_at_review": 1394,
                "playtime_forever": 1724,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198058817465"
            },
            "comment_count": 4,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "12652300",
            "review": "When I first saw it, I thought, \"How could driving a truck around Europe be fun?\"\n\nNow, driving that beautiful truck around Europe is one of the things I look forward to doing everyday.",
            "steam_purchase": true,
            "timestamp_created": 1414386206,
            "timestamp_updated": 1414386206,
            "voted_up": true,
            "votes_funny": 60,
            "votes_up": 364,
            "weighted_vote_score": "0.880387723445892334",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1600136365,
                "num_games_owned": 1995,
                "num_reviews": 38,
                "playtime_at_review": 359,
                "playtime_forever": 3546,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198040495503"
            },
            "comment_count": 5,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "62403214",
            "review": "So [b]Euro Truck Simulator 2[/b] was a sleeper hit for me, having got it from a recent Humble Bundle. I'm not normally into sims and driving for me is simply to get where I need to be and not a source of joy in itself. But due to the Overwhelmingly Positive reviews and having seen the game all over the place, I felt like I should at least try it.\n\nHaving played for several hours at this point, I can say that I find this game extremely relaxing and interesting without being demanding. There's a slight learning curve for manipulating a very large vehicle around turns and backing up to load and unload trailers - I've never driven a freight truck in my life - but at no point did I find it frustrating. Since I don't own a racing wheel and have no plans to buy one, I chose the simplest steering setup with WASD + mouse and it was very intuitive to pick up. Other driving actions like turn signals, headlights, cruise control, wipers and so on aren't shown in the tutorial but you can find their keyboard commands easily enough in the menu.\n\nThe game allows you to turn on the radio and listen to any number of online European radio stations or add your own music files or streams to the game files, if you prefer. The game's sat nav screen works like just about any other GPS you've probably used in real driving.\n\nAfter doing a few jobs for trucking agencies, you'll get points to level up skills in things like hazardous cargo, and the option to take out a loan from the bank opens so you can buy your first truck and garage. You'll be able to hire other drivers and buy your own fleet of trucks in time, so there is an element of economics at play but nothing overly complicated.\n\nThe best part of the game is just cruising through some beautiful, peaceful landscapes and sunsets while out on the open road. Nothing like driving by fields of sunflowers and wind turbines while chillin to a French rock station: just you, your truck, and the trailer full of yoghurt that needs to get to Düsseldorf stat. I'm not European so the novelty of touring places I've never seen is also enjoyable. With an enormous amount of paid DLC available and Steam Workshop support, you're pretty much guaranteed to be able to customize your game to the way you like it.",
            "steam_purchase": false,
            "timestamp_created": 1579981726,
            "timestamp_updated": 1579986590,
            "voted_up": true,
            "votes_funny": 2,
            "votes_up": 96,
            "weighted_vote_score": "0.879636645317077637",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1573943972,
                "num_games_owned": 29,
                "num_reviews": 5,
                "playtime_at_review": 413,
                "playtime_forever": 923,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198012696824"
            },
            "comment_count": 21,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "49651655",
            "review": "As a TRUCKER myself  (i drive a JUNGHEINRICH ERE220 delivering goods all over Europe)  i just fell in love with this game. The realism is great mixed in with the opportunity to start your trucking empire and to deliver goods as far as Poland-it will no doubt keep you occupied  creates the best trucking experience any keen petrol and 16 wheeler enthusiast will find. Its like I’m in my cabin driving my Ere220 in real life; IT IS A MUST BUY!!!! \n\nAfter a long shift at work its so rewarding playing your actual route on a game. Me and my mates (gavin, pete) especially enjoy it after a couple of beers at the local pub watching the footy and coming home wasted and mucking around on Euro Truck :D.\n\nThe memories we have made all down to are love of trucks, driving and videogames.:) No doubt u will have the same passion as us.:)\n\nENOUGH SAID BUY THE GAME!",
            "steam_purchase": true,
            "timestamp_created": 1553026258,
            "timestamp_updated": 1587903373,
            "voted_up": true,
            "votes_funny": 25,
            "votes_up": 91,
            "weighted_vote_score": "0.879615068435668945",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1514043449,
                "num_games_owned": 462,
                "num_reviews": 32,
                "playtime_at_review": 3851,
                "playtime_forever": 6856,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198043150229"
            },
            "comment_count": 7,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "10229695",
            "review": "Euro Truck Simulator 2 puts you in the shoes of a.................. truck driver. You start out as any regular bloke being a hired driver and delivering various things with a given truck.\n\nAfter a few jobs you have the option to get a loan from the bank to buy your very own truck. This is where the game truly opens. With your own truck you can drive around anywhere in the map and explore it as you please. Jobs give a higher pay so you can profit something while also paying off your debt. After some jobs the bank will offer you another loan, so you can start your very own trucking company. You use that money to buy a few trucks and hire drivers to work for you. \n\nThere is no objective in the game, you're free to do anything, but you could say the objective is to have the biggest trucking empire.\n\nThe game does a very good job at keeping you driving, if you don't pay off your debts, it's game over, but that's not all. You need more experience levels to be able to customize your truck to the max and also acquire better trucks. \n\nThere many trucks in this game. Iveco, Scania, Volvo, Mercedes-Benz, MAN and Renault; all with different models and configurations. \n\nThe world extends from Aberdeen to Budapest, but there are mods that expands the map even more, such as TSM, which will open up parts of Italy, France, Spain and Northern Africa. Or the Scandinavia Promod, it opens up Denmark, Sweden and Norway.\n\nThis game will probably never die all thanks to the modding community who make mods and the players who play them and the developers who never stop developing.",
            "steam_purchase": false,
            "timestamp_created": 1401020694,
            "timestamp_updated": 1401023128,
            "voted_up": true,
            "votes_funny": 0,
            "votes_up": 197,
            "weighted_vote_score": "0.878815233707427979",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1622299136,
                "num_games_owned": 1559,
                "num_reviews": 36,
                "playtime_at_review": 1931,
                "playtime_forever": 7748,
                "playtime_last_two_weeks": 81,
                "steamid": "76561197994759988"
            },
            "comment_count": 7,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "8630171",
            "review": "Just one more delivery. *[i]several hours later[/i]* WHAT YEAR IS IT?!",
            "steam_purchase": false,
            "timestamp_created": 1389259036,
            "timestamp_updated": 1389259036,
            "voted_up": true,
            "votes_funny": 9,
            "votes_up": 190,
            "weighted_vote_score": "0.874454140663146973",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1617927371,
                "num_games_owned": 1182,
                "num_reviews": 92,
                "playtime_at_review": 10320,
                "playtime_forever": 12954,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198154425859"
            },
            "comment_count": 1,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "46702809",
            "review": "[h1]Can't Drive 55[/h1]\n\nI've had Euro Truck Sim 2 for awhile now, but I remember watching the game notifications pop up all the time when my friends were playing, back before I took the plunge and tried the game myself. I wondered what could be so fun about driving trucks... as opposed to racing games. When I finally got the game on sale I realized of course. \n\n1. Trucks will be driven. Yeah, definitely that. \n2. The Euro Map is incredibly fun to explore with several expansion countries.  \n3. The paint jobs are cool to paint, and paint over, and repaint... so many designs. \n4.  Building your own trucks, upgrading to better parts, choosing models and makes... that.\n5.  Hiring employees to make you money so you can ... paint more trucks for your own fleet of trucks you won't let anyone else drive. \n6. The engineering marvels, bridges, etc. around the maps. \n7. The AI drivers... you can shove them around and wreck in hilarious ways. Accidentally and/or on purpose. \n\nThere's more, but I need to go repaint my truck. It's a great game though and I highly recommend it. And, I'm looking forward to the Beyond the Baltic expansion. But, there is a learning curve. Be prepared to wrap your truck around the highway guardrails many times as you are learning to drive a rig unless you are an ace game driver, unlike some of us who are prone to see the highway upside down every now and again.",
            "steam_purchase": true,
            "timestamp_created": 1543028611,
            "timestamp_updated": 1543028611,
            "voted_up": true,
            "votes_funny": 45,
            "votes_up": 93,
            "weighted_vote_score": "0.872414171695709229",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1590240731,
                "num_games_owned": 182,
                "num_reviews": 14,
                "playtime_at_review": 15757,
                "playtime_forever": 15862,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198030039862"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "57947475",
            "review": "Best trucking simulator ever made with developers that still push new content 7 years after release.",
            "steam_purchase": false,
            "timestamp_created": 1574799258,
            "timestamp_updated": 1574799258,
            "voted_up": true,
            "votes_funny": 2,
            "votes_up": 84,
            "weighted_vote_score": "0.87239152193069458",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1416872682,
                "num_games_owned": 1166,
                "num_reviews": 11,
                "playtime_at_review": 14614,
                "playtime_forever": 15527,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198140869674"
            },
            "comment_count": 2,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "13044159",
            "review": "Quality of the game put all other simulation games to shame. Because of its realistic approach, Euro truck simulator 2 is a awesome simulator. Thanks to the Prism3D engine, the driving looks a lot better than before. Anyway EU2 is not for everyone but if you enjoyed trucking simulators than you've come to the right place!\n\nGameplay:\n+ Lots of licensed trucks. - DAF, IVECO, MAN, RENAULT, SCANIA and VOLVO trucks officially licensed, Although there is a not officially licensed company. (Mercedes-Benz changed to Majestic)\n+ A vast world to explore. -  Hours of gameplay for fans of truck simulators.\n+ Customization. - Unlock a huge range of customization options, from cabin and engine to interiors and paint job.\n+ Management. - Buy garages, recruit drivers and create your own company.\n+ Built-in Music player. - listening your favorite musics or internet radio.\n+ Awesome physics.\n\nThe atmosphere and graphics:\n+ Excellent UI. - Simple, clear and readable fonts on wide range of screen sizes in any devices.\n+ Stunning realistic world.\n+ Realistic day-night cycle.\n+ Quite nice landscapes.\n+ Good texture quality.\n+ Beautiful 3D graphics.\n+ Incredible detailed trucks and interiors.\n+ Good music and sound.\n\nPerformance:\n+ Running pretty well and smooth on a mid-range PC.\n+ Stable.\n+ Almost bug free.\n\nAdditional:\n+ Moddable.\n- No steam cloud.",
            "steam_purchase": false,
            "timestamp_created": 1416683384,
            "timestamp_updated": 1416817380,
            "voted_up": true,
            "votes_funny": 0,
            "votes_up": 127,
            "weighted_vote_score": "0.872180402278900146",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1447624090,
                "num_games_owned": 94,
                "num_reviews": 3,
                "playtime_at_review": 650,
                "playtime_forever": 696,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198104629290"
            },
            "comment_count": 5,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "13462672",
            "review": "Looked away for a second to answer a text, wracked up about £2000 in car damage fines. \n\nThis game has taught me the importance of not texting and driving.\n\n10/10.",
            "steam_purchase": false,
            "timestamp_created": 1419041821,
            "timestamp_updated": 1419041821,
            "voted_up": true,
            "votes_funny": 1574,
            "votes_up": 750,
            "weighted_vote_score": "0.872041940689086914",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1564704517,
                "num_games_owned": 755,
                "num_reviews": 35,
                "playtime_at_review": 123,
                "playtime_forever": 1157,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198000165296"
            },
            "comment_count": 2,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "7751582",
            "review": "The ultimate in European ground logistics simulators. No other game out there comes even remotely close to matching the sheer enjoyment of driving around an extremely scaled-down version of Europe that this game provides. Ever wanted to listen to BBC Radio 4 for 6 hours at a time without getting bored? Fire it up and drive around Germany.\n\nThe mystical addictive nature of this game defies explanation. You cannot describe it, you can only experience it.",
            "steam_purchase": true,
            "timestamp_created": 1385420933,
            "timestamp_updated": 1385420933,
            "voted_up": true,
            "votes_funny": 0,
            "votes_up": 366,
            "weighted_vote_score": "0.871965706348419189",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1602642791,
                "num_games_owned": 1971,
                "num_reviews": 306,
                "playtime_at_review": 5810,
                "playtime_forever": 10195,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198043250032"
            },
            "comment_count": 11,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "13623805",
            "review": "The Simulator you expect to never like but somehow fall in love with, Euro Truck Simulator 2 lets you experience the world of cargo haulage right at your PC and it does it very well for the most part. You start with nothing, just taking low paying jobs in the quick job menu but gradually you will expand your company until you have your very own fleet of trucks and truckers all across Europe.\n\n+Great graphics, the trucks and trailers in particular are very high quality\n+Large map made even larger by the Going East DLC and the Scandinavia expansion\n+The system of building up your company works well and as you improve as a driver it becomes easier to improve your company\n+It's a very relaxing game and is a perfect excuse to listen to music, podcasts or the radio\n+You can play your music or a radio station through the game's menu\n+Trucks have lots of customisation options\n+Lots of different skills to improve to make yourself a better driver or to unlock new types of cargo\n+The paint job packs are very high quality and in my opinion are worth their price (especially on sale)\n+Plenty of great mods and it's very easy to install mods\n+Controls are fully customisable\n+Plenty of different cargo types, especially with the High Power pack and some of the skills you can unlock\n+Several truck manufacturers with several truck designs each \n+Seat heights, lights used etc are all customisable\n+Has a photo mode with lots of different options allowing you to take plenty of nice shots of your truck\n+The devs run events which give you the opportunity to unlock exclusive content through the World of Trucks website\n+It's easy to progress through the game without taking loans from the bank which is good for players who want to maximise their rewards in-game\n\n+/-Pretty hard to play with a mouse and keyboard but this is more than made up for with the controller and wheel support, if you don't have a controller or a wheel you might find this significantly more challenging to play\n\n-The AI can be pretty poor sometimes, AI vehicles almost always travel faster than the speed limit, trucks in particular have acceleration faster than makes sense, cars will sometimes accelerate into you while you are turning rather than stop\n-Major cities do not resemble cities in anyway, they are very small and all cities have a similar layout (a repair shop, two distributors, somewhere to sleep and a garage)\n-Major cities do not have gas/petrol stations so you have to rely on service stations on major highways for fuel \n-Doesn't have different seasons which seems odd considering they run seasonal events, such as the Winter Holiday event (seeing as you had to deliver presents it would seem logical to have snow)\n\nVerdict:\n8.5\n\nDespite the game's flaws I find myself absolutely addicted to it and would recommend this to anyone, there's nothing quite like the open road especially when you're building a business empire.\n\nEl K.",
            "steam_purchase": true,
            "timestamp_created": 1419637733,
            "timestamp_updated": 1435099300,
            "voted_up": true,
            "votes_funny": 12,
            "votes_up": 285,
            "weighted_vote_score": "0.871239364147186279",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1622398473,
                "num_games_owned": 202,
                "num_reviews": 5,
                "playtime_at_review": 274161,
                "playtime_forever": 299382,
                "playtime_last_two_weeks": 1994,
                "steamid": "76561198076608473"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "55333190",
            "review": "For the last few years, I have practically no-life'd this game, I can honestly say at times, it does get annoying at times and  I find myself compleating one delivery a day then quitting due to boredom despite this fact I always come back to the game for more weather its the crazy AI or the thrill of driving a truck, this game has inspired me to try and become a truck driver in real life and hope to be soon taking my HGV Licence Test. The game does offer Online contracts to complete if you want a sense of community, it is unofficial, but there also is TruckersMP, but I do not recommend going on TMP due to too many trolls and rammers.",
            "steam_purchase": true,
            "timestamp_created": 1569756219,
            "timestamp_updated": 1569756219,
            "voted_up": true,
            "votes_funny": 15,
            "votes_up": 93,
            "weighted_vote_score": "0.871077001094818115",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1621854962,
                "num_games_owned": 26,
                "num_reviews": 6,
                "playtime_at_review": 45736,
                "playtime_forever": 85083,
                "playtime_last_two_weeks": 10106,
                "steamid": "76561199117835520"
            },
            "comment_count": 10,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "90896157",
            "review": "It helps me cope with my depression  \n\nFriendly interface.\nAbility to purchase garages and hire drivers to work for you.\nMany cities to discover.\nSeveral trucks to choose from.\nRealistic sounds.\nLots of accessories and options to choose.\nGreat graphics for its game engine.\nGreat vehicle physics.\nDynamic time, weather and vehicle damage.\nMany trailers and jobs to choose.\nIntegrated radio and music player.\nEasily the best truck simulator out there.\n\nTRUCC\nGOO\nVROOMMM",
            "steam_purchase": true,
            "timestamp_created": 1619355822,
            "timestamp_updated": 1619355822,
            "voted_up": true,
            "votes_funny": 6,
            "votes_up": 109,
            "weighted_vote_score": "0.868812322616577148",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1620615774,
                "num_games_owned": 558,
                "num_reviews": 12,
                "playtime_at_review": 13586,
                "playtime_forever": 16550,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198065210279"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "70127156",
            "review": "In a world dominated by first-person shooters, action-adventure RPGs and the like, it's nice to just come home from work and relax with a slower-paced game that's still lots of fun. What is it about jumping on here and delivering load after load (or that one 4,000 km load) that's just so satisfying? Is it unlocking new perks as you level up? Is it exploring the new countries that continue to be added? Or is it trying to get that \"roads explored\" section up to 100%? The achievements perhaps? It's all of this and more. If you're in a simple mood you can just drive around on or off the job, take detours, shortcuts, new routes, see new sights. There's something in here for everyone, and though not everyone will get 225+ hours of enjoyment out of it, there are thousands (if not hundreds of thousands) of people who do, just like me. I definitely recommend this game for anyone who isn't bored at the thought of getting behind the wheel of a big rig. Just so it's out there, I have just about as many hours in American Truck Simulator as well. Both great games.",
            "steam_purchase": true,
            "timestamp_created": 1590981667,
            "timestamp_updated": 1590981667,
            "voted_up": true,
            "votes_funny": 3,
            "votes_up": 86,
            "weighted_vote_score": "0.868554174900054932",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1610867539,
                "num_games_owned": 62,
                "num_reviews": 9,
                "playtime_at_review": 10481,
                "playtime_forever": 16006,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198041366289"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "44502804",
            "review": "Never in a million years would I have thought that I would purchase a driving simulator. I gave this game a try and it is one of the best games I own. That \"Overwhelmingly Positive\" is no lie. SCS is one of the best developers out there. Just think of the trash developers littering Steam with their garbage. SCS is a developer that is constantly improving ETS2. Most importantly though, this game actually has utility for real life: if you treat it like the simulator it is, it can improve your driving, which is always a positive. Use your mirrors properly, stay in your lane, watch your speed, learn how to turn with a large vehicle, make you aware of your large blind-spots as a trucker would have to be, etc. The rest of the games you own and play are mostly just for fun and have no usefulness for the real world--in fact, they are, in all honestly, wasting your time. Not this game though. If it improves your awareness on the road, as it has mine, then it is worth more than all the other games on Steam. Give it a try. You will not be disappointed.",
            "steam_purchase": true,
            "timestamp_created": 1535786426,
            "timestamp_updated": 1535786426,
            "voted_up": true,
            "votes_funny": 10,
            "votes_up": 88,
            "weighted_vote_score": "0.867849230766296387",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1569178217,
                "num_games_owned": 758,
                "num_reviews": 15,
                "playtime_at_review": 9927,
                "playtime_forever": 11798,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198132646011"
            },
            "comment_count": 7,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "41895304",
            "review": "It's difficult to describe this game. I like it a lot. But if you watch someone play you might think it looks boring. It's a simulator that you have to play yourself to really get the feel of it. While it's certainly not action-packed, there is something enjoyable, and even relaxing, about this game.\n\n[h1]Pros[/h1]\n> Plenty of roads (and I mean PLENTY)\n> Good graphics, especially the landscapes\n> Very friendly community\n> Runs great -- I have never had any technical issues running this simulator\n\n[h1]Cons[/h1]\n> none that I can think of...honestly\n\n\n[h1]And please, no jokes about Asian or women drivers. I am a very safe driver with a perfect record.[/h1]   hehe",
            "steam_purchase": true,
            "timestamp_created": 1525642111,
            "timestamp_updated": 1549062322,
            "voted_up": true,
            "votes_funny": 48,
            "votes_up": 104,
            "weighted_vote_score": "0.867649078369140625",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1594460672,
                "num_games_owned": 102,
                "num_reviews": 7,
                "playtime_at_review": 406,
                "playtime_forever": 793,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198116686832"
            },
            "comment_count": 2,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "32197687",
            "review": "Dissapointed we couldn't stop and get fast food at McDonalds or stuff and gain 300 pounds slowly over the next 10 years.\nOtherwise, oddly relaxing and realistic.\n\n9/10\n\nP.S if you dont find inner peace while playing the game, you're playing it all wrong.",
            "steam_purchase": true,
            "timestamp_created": 1496664527,
            "timestamp_updated": 1496664527,
            "voted_up": true,
            "votes_funny": 260,
            "votes_up": 798,
            "weighted_vote_score": "0.866169571876525879",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1611684171,
                "num_games_owned": 429,
                "num_reviews": 3,
                "playtime_at_review": 1101,
                "playtime_forever": 2635,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198063689855"
            },
            "comment_count": 2,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "28530927",
            "review": "-Bought as a joke\n-Played as a joke\n-Fell in love\n-No longer a joke, it is true love\n10/10 like skyrim with trucks",
            "steam_purchase": true,
            "timestamp_created": 1482422903,
            "timestamp_updated": 1482422903,
            "voted_up": true,
            "votes_funny": 383,
            "votes_up": 346,
            "weighted_vote_score": "0.866131842136383057",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1616948527,
                "num_games_owned": 149,
                "num_reviews": 5,
                "playtime_at_review": 8870,
                "playtime_forever": 10313,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198337057710"
            },
            "comment_count": 1,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "66446274",
            "review": "You turn on the game, turn on the background music, sit comfortably in the chair and spend good time listening to music or talking with friends. great game, I recommend it. :D",
            "steam_purchase": false,
            "timestamp_created": 1585855493,
            "timestamp_updated": 1585855493,
            "voted_up": true,
            "votes_funny": 8,
            "votes_up": 79,
            "weighted_vote_score": "0.865835249423980713",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1615469505,
                "num_games_owned": 297,
                "num_reviews": 137,
                "playtime_at_review": 7843,
                "playtime_forever": 9598,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198031033148"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "50919613",
            "review": "The AI are brilliant, they cut me off and brake check me just like real life!",
            "steam_purchase": false,
            "timestamp_created": 1559089527,
            "timestamp_updated": 1559089527,
            "voted_up": true,
            "votes_funny": 193,
            "votes_up": 83,
            "weighted_vote_score": "0.86433708667755127",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1622401305,
                "num_games_owned": 57,
                "num_reviews": 17,
                "playtime_at_review": 43386,
                "playtime_forever": 82670,
                "playtime_last_two_weeks": 347,
                "steamid": "76561198249136480"
            },
            "comment_count": 6,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "32289411",
            "review": "Very good Game, Drove from Poland to Scotland in 40 hours.\n10/10.",
            "steam_purchase": true,
            "timestamp_created": 1497007431,
            "timestamp_updated": 1574965695,
            "voted_up": true,
            "votes_funny": 308,
            "votes_up": 2515,
            "weighted_vote_score": "0.864045679569244385",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1610983812,
                "num_games_owned": 497,
                "num_reviews": 12,
                "playtime_at_review": 739,
                "playtime_forever": 1019,
                "playtime_last_two_weeks": 0,
                "steamid": "76561197977559920"
            },
            "comment_count": 2,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "78721441",
            "review": "A great game to play whilst I have been missing getting out of the house for almost 1 year due to the covid situation. A great way to relax whilst listening to some podcasts.",
            "steam_purchase": true,
            "timestamp_created": 1604513787,
            "timestamp_updated": 1604513787,
            "voted_up": true,
            "votes_funny": 2,
            "votes_up": 76,
            "weighted_vote_score": "0.862682044506072998",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1540404188,
                "num_games_owned": 126,
                "num_reviews": 14,
                "playtime_at_review": 1849,
                "playtime_forever": 2211,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198157202125"
            },
            "comment_count": 11,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "39756075",
            "review": "===[ ❤ Audience: ]===\n☐ Kids\n☑ Everyone\n☐ Casual players\n☐ Pro players\n☐ Hackers\n\n===[ ☼ Graphics: ]===\n☐ Potato\n☐ Really bad\n☐ Bad\n☐ OK\n☑ Good\n☐ Beautiful\n☐ Masterpiece\n\n===[ $ Price/quality: ]===\n☑ Full price\n☐ Wait for sale\n☐ Average\n☐ Refund it if you can\n☐ Don't do it\n☐ Free\n\n===[ ☣ Requirements: ]===\n☐ 90' PC\n☐ Minimum\n☑ Medium\n☐ Fast\n☐ High end\n☐ NASA computer\n\n===[ ☼ Difficulty: ]===\n☐ You just need 2 arms\n☐ Ez\n☑ Easy to learn / Hard to master\n☐ Hard (first few hours)\n☐ Super Meat Boy\n\n===[ ۞ Game time/length ]===\n☐ Really short ( 0 - 2 hours)\n☐ Short ( 2 - 8 hours)\n☐ Few hours ( 8 - 12 hours)\n☐ Long ( 12+ hours)\n☑ Endless\n\n===[ ♬ Story] ===\n☑ It doesn't have\n☐ Still better than Twilight\n☐ Average\n☐ Good\n☐ Fantastic\n\n===[ § Bugs ]===\n☐ Game itself is one big BUG\n☐ Bugs destroying the game\n☐ Lot of bugs\n☐ Few Bugs\n☑ You can use them for speedrun\n☐ Nothing\n",
            "steam_purchase": true,
            "timestamp_created": 1517434696,
            "timestamp_updated": 1517434696,
            "voted_up": true,
            "votes_funny": 28,
            "votes_up": 132,
            "weighted_vote_score": "0.861461341381072998",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1583408199,
                "num_games_owned": 128,
                "num_reviews": 18,
                "playtime_at_review": 2579,
                "playtime_forever": 2773,
                "playtime_last_two_weeks": 0,
                "steamid": "76561197976923334"
            },
            "comment_count": 5,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "33645406",
            "review": "I bought this game and got hooked.\n\n1 week later I booked my truck license in real life.\n\nNow looking for jobs as truck driver.",
            "steam_purchase": true,
            "timestamp_created": 1500444766,
            "timestamp_updated": 1501150660,
            "voted_up": true,
            "votes_funny": 41,
            "votes_up": 85,
            "weighted_vote_score": "0.859063625335693359",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1613551035,
                "num_games_owned": 100,
                "num_reviews": 1,
                "playtime_at_review": 1278,
                "playtime_forever": 10054,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198141253753"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "11116087",
            "review": "On numara 5 yıldız birde mercedes in lisansı satın alınırsa çok fena olur.",
            "steam_purchase": false,
            "timestamp_created": 1404732990,
            "timestamp_updated": 1404732990,
            "voted_up": true,
            "votes_funny": 8,
            "votes_up": 59,
            "weighted_vote_score": "0.858218133449554443",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1565201799,
                "num_games_owned": 141,
                "num_reviews": 13,
                "playtime_at_review": 6750,
                "playtime_forever": 11394,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198011666704"
            },
            "comment_count": 7,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "26893741",
            "review": "Nominated for the \"We didn't think of everything\" Steam Award 2016 for the category: Best Lifetime Support by a Developer.\n\nI think SCS Software deserves this recognition for the continued support of this game ( and american truck sim) during its lifetime so far through patching, quality non-overprized dlc and the many news updates in their development process.",
            "steam_purchase": true,
            "timestamp_created": 1479936367,
            "timestamp_updated": 1479936367,
            "voted_up": true,
            "votes_funny": 8,
            "votes_up": 165,
            "weighted_vote_score": "0.857270419597625732",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1617789541,
                "num_games_owned": 48,
                "num_reviews": 6,
                "playtime_at_review": 5475,
                "playtime_forever": 15435,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198108226616"
            },
            "comment_count": 15,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "50561308",
            "review": "---{Graphics}---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ Paint.exe\n\n---{Gameplay}---\n☑ Addictive like heroin\n☐ Very good\n☐ Good\n☐ It‘s just gameplay\n☐ Mehh\n☐ Starring at walls is better\n☐ Just don‘t\n\n---{Audio}---\n☐ Eargasm\n☑ Very good \n☐ Good\n☐ Not too bad\n☐ Bad\n☐ Earrape\n\n---{Audience}---\n☑ Kids\n☑ Teens\n☑ Adults\n☑ Average Solitare Players\n\n---{PC Requirements}---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boiiiiii\n☐ Ask NASA if they have a spare computer\n\n---{Difficulity}---\n☐ Just press ‚A‘\n☐ Easy\n☐ Significant brain usage\n☑ Easy to learn / Hard to master\n☐ Difficult\n☐ Dark Souls\n\n---{Grind}---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isnt necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You‘ll need a second life for grinding\n\n---{Story}---\n☐ Story?\n☐ Text or Audio floating around\n☐ Average depends an DLC\n☐ Good\n☑ Lovley\n☐ It‘ll replace your life \n\n---{Game Time}---\n☐ Long enough for a cup of tea\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{Price}---\n☐ There is no „price“\n☑ Worth the price\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money \n\n---{Bugs}---\n☐ Never heard of\n☐ Minor bugs\n☑ Can get annoying\n☐ Assassin‘s Creed: Unity\n☐ The game itself is a big terrarium for bugs",
            "steam_purchase": false,
            "timestamp_created": 1557427089,
            "timestamp_updated": 1566988059,
            "voted_up": true,
            "votes_funny": 110,
            "votes_up": 222,
            "weighted_vote_score": "0.854678571224212646",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1622116868,
                "num_games_owned": 533,
                "num_reviews": 12,
                "playtime_at_review": 108423,
                "playtime_forever": 125131,
                "playtime_last_two_weeks": 1,
                "steamid": "76561198045905361"
            },
            "comment_count": 1,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "52092940",
            "review": "Steam has problems letting me post my long review, I will edit the full text later.\nFor now, take my word on it that I love this game, it has excellent, dedicated devs, is beautifully made and provides a relaxed, yet entertaining experience.",
            "steam_purchase": true,
            "timestamp_created": 1561829525,
            "timestamp_updated": 1561829525,
            "voted_up": true,
            "votes_funny": 5,
            "votes_up": 84,
            "weighted_vote_score": "0.854238808155059814",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1598030906,
                "num_games_owned": 860,
                "num_reviews": 13,
                "playtime_at_review": 6285,
                "playtime_forever": 10829,
                "playtime_last_two_weeks": 0,
                "steamid": "76561197973564459"
            },
            "comment_count": 13,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "56615940",
            "review": "How long have I been on the road? When was the last time I ate? No, that half-eaten sandwich on the dashboard does not count. It is not real, it [i]can’t[/i] be; if it were, it would surely be covered in mold by now. There is a cat sleeping on the passenger seat next to me. Is it alive? It’s not moving. It has not moved in weeks. Meanwhile, I have never stopped moving. What would happen if I did? I’m not in a hurry to find out.\n\nI do not dream anymore. I close my eyes now and then, and everything goes black. Sometimes when I open them, everything is still black. I turn on the lights, but they only seem to make the surrounding darkness even more pronounced. I think about closing my eyes again and sinking back into my dreamless slumber. But then I feel it. Death’s cold breath, making each hair on the back of my neck stand up as if it was getting ready to pluck them one by one with a pair of contaminated tweezers. I resume my journey out of sheer terror.\n\nVoices speaking in an incomprehensible tongue keep me company for a few hours. The radio begins to crackle, then it dies. A barely legible sign tells me I am approaching Knjazalovac. I do not know where Knjazalovac is, but it’s safe to say it was never the center of a high civilization. The Ruritanian peasants living here at the height of the Austro-Hungarian Empire were probably not even aware that they belonged to one.\n\nFor some reason, the denizens of this God-forsaken country demand fish. At least that is what my trailer smells like. I once stopped to have a closer look at what I was transporting. I vowed never to look again.\n\nSome hundred meters ahead, my headlights reveal a silhouette of roughly humanoid shape. I slow down to a crawl. Who is this furtive creature? A fellow stranger to society, no doubt. I check the dashboard clock. 03:33. Nary a healthy soul awake at this ungodly hour. As I get closer to our mysterious nightwalker, I notice he’s not wearing a jacket. For an instant our eyes meet. His loathsome stare betrays a mixture of savage animosity and utter disappointment; I am going far too slow for his purposes. A moment later, I have forgotten everything about this cursed insomniac—everything except his face. I have seen that face many times before. Too many times.\n\nI see it every time I look myself in the mirror. But then practical considerations inevitably get in the way: Who would drive the truck? The cat? It is useless even thinking about it. Maybe one of these nights, one of you could stop my truck for me. In the meantime, I have no choice but to stay on the move. I must keep moving.",
            "steam_purchase": true,
            "timestamp_created": 1573032963,
            "timestamp_updated": 1573514112,
            "voted_up": true,
            "votes_funny": 106,
            "votes_up": 139,
            "weighted_vote_score": "0.854020893573760986",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1446024409,
                "num_games_owned": 219,
                "num_reviews": 13,
                "playtime_at_review": 712,
                "playtime_forever": 2932,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198050530958"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "13061758",
            "review": "I, I have never had this much fun in months. \nI got this game today and i just HAD to write a review.\nDay 1- Mom said go find a job.\nFound an AD for a truck driver job.\nCalled got the Job. Got paid 3,000 euros the first day.\n\nDay 2- Woke up thinking \"why should i get paid half and work using a company's truck\".\nWent to work as usual and got paid 3,000. Commited lots of driving law infringements. Ended up getting a call from the bank that i am in debt and that i have negative funds in my accounts. (They were nice enough to give me funds to sort things out).\n\nDay 3- Said \"Screw it, i'm buying my own truck\"\nWent to the bank, got a 100,000 Euros loan (Thanks Merkel) and bought a volvo (Should change license plate to Diretide soon).\nNow i make 8,000 euros a day. I still sleep inside a truck tho (Don't worry it's warm).\n\nWhat's next? Well i will probably save 180,000 euros to buy a garage and hire some employees and hit the road daily as usual. Life on the road never ends. \n\nThank for everyone at SCS Software who worked on this. \n10/10 Game totally recommended!",
            "steam_purchase": false,
            "timestamp_created": 1416785102,
            "timestamp_updated": 1416785102,
            "voted_up": true,
            "votes_funny": 78,
            "votes_up": 177,
            "weighted_vote_score": "0.850848019123077393",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1474119603,
                "num_games_owned": 1897,
                "num_reviews": 72,
                "playtime_at_review": 1520,
                "playtime_forever": 2202,
                "playtime_last_two_weeks": 0,
                "steamid": "76561197977594570"
            },
            "comment_count": 4,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "15722333",
            "review": "It's like Skyrim with trucks!\n\nExcept well, not. But it's a lot of fun, and it definitely gives the feeling of a completely open world that's just ready for you to explore. Hop right in a truck and start hauling freight for others, and earn enough money to buy your own fleet of vehicles and keep more of the profits to yourself.\n\nIt's really two games in one, because in addition to the fairly robust truck driving simulation, there's a pretty great business management simulation as well where you can play some kind of Trucking Tycoon and grow a small business into a profitable little empire of trucks and drivers all across Europe.\n\nI have to admit, Euro Truck Simulator 2 really surprised me with just how fun it is to play. It's pretty challenging to get the hang of at first, but once you do, it's a pretty enjoyable (and even relaxing) experience. The thrill of discovery — and the desire for a little more cash to pay off loans, hire drivers, buy new trucks, expand garages, and customize rigs — keeps me taking just \"one more job\" again and again.",
            "steam_purchase": false,
            "timestamp_created": 1430973000,
            "timestamp_updated": 1430973000,
            "voted_up": true,
            "votes_funny": 115,
            "votes_up": 282,
            "weighted_vote_score": "0.850568711757659912",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1616705426,
                "num_games_owned": 565,
                "num_reviews": 5,
                "playtime_at_review": 244,
                "playtime_forever": 2849,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198020475954"
            },
            "comment_count": 16,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "12911220",
            "review": "I'm having fun in this game. WHY AM I HAVING FUN IN THIS GAME?\nEXPLAIN YOURSELF, GAME.",
            "steam_purchase": false,
            "timestamp_created": 1415800989,
            "timestamp_updated": 1415800989,
            "voted_up": true,
            "votes_funny": 984,
            "votes_up": 1141,
            "weighted_vote_score": "0.850518226623535156",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1600588464,
                "num_games_owned": 622,
                "num_reviews": 86,
                "playtime_at_review": 175,
                "playtime_forever": 2695,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198302112088"
            },
            "comment_count": 6,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "31800160",
            "review": "Spotify + ETS 2 ===> A good way to coop with your crippling depression and suicidal tendencies. It kept me from killing myself at least.",
            "steam_purchase": true,
            "timestamp_created": 1495004355,
            "timestamp_updated": 1495004355,
            "voted_up": true,
            "votes_funny": 63,
            "votes_up": 186,
            "weighted_vote_score": "0.850453674793243408",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1545713828,
                "num_games_owned": 564,
                "num_reviews": 5,
                "playtime_at_review": 3585,
                "playtime_forever": 9257,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198048064304"
            },
            "comment_count": 2,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "12577008",
            "review": "There is a trucker in all of us.",
            "steam_purchase": false,
            "timestamp_created": 1413767842,
            "timestamp_updated": 1413767842,
            "voted_up": true,
            "votes_funny": 200,
            "votes_up": 531,
            "weighted_vote_score": "0.850296437740325928",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1591104201,
                "num_games_owned": 757,
                "num_reviews": 122,
                "playtime_at_review": 698,
                "playtime_forever": 5936,
                "playtime_last_two_weeks": 0,
                "steamid": "76561197962150121"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "69918449",
            "review": "There isn't a better driving sim.\n\nSure, there are great racing sims, with bleeding edge realism, and laser scanned tracks... but none have ever captured the experience of driving on the open road quite like this. \n\nThis isn't setting track times, or breaking speed records, this is navigating traffic, construction, and getting there safely. This is a real road experience, and it's hard to compare it to anything else.",
            "steam_purchase": true,
            "timestamp_created": 1590629554,
            "timestamp_updated": 1590629554,
            "voted_up": true,
            "votes_funny": 1,
            "votes_up": 80,
            "weighted_vote_score": "0.849771022796630859",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1590485235,
                "num_games_owned": 774,
                "num_reviews": 32,
                "playtime_at_review": 2621,
                "playtime_forever": 5541,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198034238053"
            },
            "comment_count": 5,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "35461727",
            "review": "Hauling seventeen tons of nitrocellulose at 157 km/h on a German highway isn't normal. But when you're a Polish truck driver on meth, it is.",
            "steam_purchase": false,
            "timestamp_created": 1507086728,
            "timestamp_updated": 1507086728,
            "voted_up": true,
            "votes_funny": 137,
            "votes_up": 68,
            "weighted_vote_score": "0.849243879318237305",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1588359145,
                "num_games_owned": 5,
                "num_reviews": 2,
                "playtime_at_review": 111655,
                "playtime_forever": 169328,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198342121627"
            },
            "comment_count": 0,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "45499090",
            "review": "Best game ever try it for a few minutes and you will be glued for life\nHAPPY TRUCKING",
            "steam_purchase": false,
            "timestamp_created": 1540818986,
            "timestamp_updated": 1540818986,
            "voted_up": true,
            "votes_funny": 20,
            "votes_up": 93,
            "weighted_vote_score": "0.849184095859527588",
            "written_during_early_access": false
        },
        {
            "author": {
                "last_played": 1466198684,
                "num_games_owned": 271,
                "num_reviews": 40,
                "playtime_at_review": 883,
                "playtime_forever": 883,
                "playtime_last_two_weeks": 0,
                "steamid": "76561198110369097"
            },
            "comment_count": 1,
            "language": "english",
            "received_for_free": false,
            "recommendationid": "23621284",
            "review": "It seems like vehicles on the road actually TRY to collide with you.  In this game, all the other drivers are complete idiots.\n\nIn other words... It's just like real life.  10/10",
            "steam_purchase": false,
            "timestamp_created": 1466199189,
            "timestamp_updated": 1466199189,
            "voted_up": true,
            "votes_funny": 301,
            "votes_up": 141,
            "weighted_vote_score": "0.848814487457275391",
            "written_during_early_access": false
        }
    ],
    "success": 1
}